{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neo4J Import and Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting neo4j==4.4.11\n",
      "  Downloading neo4j-4.4.11.tar.gz (87 kB)\n",
      "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m87.5/87.5 kB\u001b[0m \u001b[31m1.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25h  Preparing metadata (setup.py) ... \u001b[?25ldone\n",
      "\u001b[?25hRequirement already satisfied: pytz in /opt/conda/lib/python3.11/site-packages (from neo4j==4.4.11) (2023.3)\n",
      "Building wheels for collected packages: neo4j\n",
      "  Building wheel for neo4j (setup.py) ... \u001b[?25ldone\n",
      "\u001b[?25h  Created wheel for neo4j: filename=neo4j-4.4.11-py3-none-any.whl size=111249 sha256=e1d95c89bf456f3604559b494c9ad275840f0f1fcc78ab80313d41c01188c4e6\n",
      "  Stored in directory: /home/jovyan/.cache/pip/wheels/9b/29/51/cd9c7f08102e1afefd87d7307e45556c08f51eec519f2e6e05\n",
      "Successfully built neo4j\n",
      "Installing collected packages: neo4j\n",
      "Successfully installed neo4j-4.4.11\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "pip install neo4j==4.4.11"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import random\n",
    "import csv"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Aufbau der Datenbankverbindung"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = Neo4jConnection(uri=\"bolt://core1:7687\", user=\"neo4j\", pwd=\"password\")\n",
    "secondConn = Neo4jConnection(uri=\"bolt://core2:7688\", user=\"neo4j\", pwd=\"password\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record n=<Node id=0 labels=frozenset({'Tweet'}) properties={'date_time': '12/01/2017 19:52', 'language': 'en', 'content': 'Is history repeating itself...?#DONTNORMALIZEHATE https://t.co/ngG11quhmK', 'tweetId': '1'}>>]\n",
      "Query failed: Couldn't connect to core1:7688 (resolved to ('178.201.0.2:7688',)):\n",
      "Failed to establish connection to ResolvedIPv4Address(('178.201.0.2', 7688)) (reason [Errno 111] Connection refused)\n",
      "None\n"
     ]
    }
   ],
   "source": [
    "print(conn.query(f\"MATCH (n) RETURN n LIMIT 1;\"))\n",
    "\n",
    "print(secondConn.query(f\"MATCH (n) RETURN n LIMIT 1;\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Importieren der Knoten und Beziehungen"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Einlesen des \"twitter_combined\" Files"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "follows_file = open('twitter_combined.txt', 'r')\n",
    "lines = follows_file.readlines()\n",
    "\n",
    "follows = []\n",
    "users = set()\n",
    "for line in lines:\n",
    "    line = line.replace('\\n','')\n",
    "    id1, id2 = line.split(' ')\n",
    "    users.add(id1)\n",
    "    users.add(id2)\n",
    "    follows.append([id1, id2])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der User"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "count = 0\n",
    "f = open(\"import/users.csv\", \"w\")\n",
    "f.write(\"userId,name,:Label\\n\")\n",
    "for user in users:\n",
    "    f.write(user + \",user\" + str(count) + \",USER\\n\")\n",
    "    count += 1\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Importieren der User"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.56 ms, sys: 274 µs, total: 2.84 ms\n",
      "Wall time: 2.48 s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///users.csv' AS row CREATE (:User {userId: row.userId, name: row.name})\")\n",
    "conn.query(\"CREATE CONSTRAINT user_constraint IF NOT EXISTS FOR (u:User) REQUIRE u.userId IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record u=<Node id=52543 labels=frozenset({'User'}) properties={'name': 'user0', 'userId': '30782151'}>>, <Record u=<Node id=52544 labels=frozenset({'User'}) properties={'name': 'user1', 'userId': '399727099'}>>, <Record u=<Node id=52545 labels=frozenset({'User'}) properties={'name': 'user2', 'userId': '23618093'}>>, <Record u=<Node id=52546 labels=frozenset({'User'}) properties={'name': 'user3', 'userId': '31565013'}>>, <Record u=<Node id=52547 labels=frozenset({'User'}) properties={'name': 'user4', 'userId': '490171722'}>>, <Record u=<Node id=52548 labels=frozenset({'User'}) properties={'name': 'user5', 'userId': '190807988'}>>, <Record u=<Node id=52549 labels=frozenset({'User'}) properties={'name': 'user6', 'userId': '7980402'}>>, <Record u=<Node id=52550 labels=frozenset({'User'}) properties={'name': 'user7', 'userId': '144012142'}>>, <Record u=<Node id=52551 labels=frozenset({'User'}) properties={'name': 'user8', 'userId': '92676878'}>>, <Record u=<Node id=52552 labels=frozenset({'User'}) properties={'name': 'user9', 'userId': '21110908'}>>]\n",
      "[<Record u=<Node id=52543 labels=frozenset({'User'}) properties={'name': 'user0', 'userId': '30782151'}>>, <Record u=<Node id=52544 labels=frozenset({'User'}) properties={'name': 'user1', 'userId': '399727099'}>>, <Record u=<Node id=52545 labels=frozenset({'User'}) properties={'name': 'user2', 'userId': '23618093'}>>, <Record u=<Node id=52546 labels=frozenset({'User'}) properties={'name': 'user3', 'userId': '31565013'}>>, <Record u=<Node id=52547 labels=frozenset({'User'}) properties={'name': 'user4', 'userId': '490171722'}>>, <Record u=<Node id=52548 labels=frozenset({'User'}) properties={'name': 'user5', 'userId': '190807988'}>>, <Record u=<Node id=52549 labels=frozenset({'User'}) properties={'name': 'user6', 'userId': '7980402'}>>, <Record u=<Node id=52550 labels=frozenset({'User'}) properties={'name': 'user7', 'userId': '144012142'}>>, <Record u=<Node id=52551 labels=frozenset({'User'}) properties={'name': 'user8', 'userId': '92676878'}>>, <Record u=<Node id=52552 labels=frozenset({'User'}) properties={'name': 'user9', 'userId': '21110908'}>>]\n"
     ]
    }
   ],
   "source": [
    "print(conn.query(\"MATCH(u: User) return u LIMIT 10\"));\n",
    "print(secondConn.query(\"MATCH(u: User) return u LIMIT 10\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der Tweets anhand des \"tweets\" CSV Files "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "tweets = pd.read_csv(\"tweets.csv\")\n",
    "f = open(\"import/tweetsDB.csv\", \"w\")\n",
    "writer = csv.writer(f)\n",
    "writer.writerow([\"tweetId\",\"content\",\"date_time\",\"language\",\":Label\"])\n",
    "count = 1\n",
    "for index, tweet in tweets.iterrows():\n",
    "    writer.writerow([count,tweet[\"content\"],tweet[\"date_time\"],tweet[\"language\"],\"TWEET\"])\n",
    "    count += 1\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Importieren der Tweets"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Query failed: {code: Neo.ClientError.Schema.ConstraintValidationFailed} {message: Node(0) already exists with label `Tweet` and property `tweetId` = '1'}\n",
      "CPU times: user 652 µs, sys: 2.65 ms, total: 3.3 ms\n",
      "Wall time: 98.2 ms\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///tweetsDB.csv' AS row CREATE (:Tweet {tweetId: row.tweetId, content: row.content, date_time: row.date_time, language: row.language})\")\n",
    "conn.query(\"CREATE CONSTRAINT tweet_constraint IF NOT EXISTS FOR (t:Tweet) REQUIRE t.tweetId IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der FOLLOWS-Beziehung"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "f = open(\"import/follows.csv\", \"w\")\n",
    "f.write(\"userId,followerId,:TYPE\\n\")\n",
    "for follow in follows:\n",
    "    f.write(follow[0] + \",\" + follow[1] + \",FOLLOWS\\n\")\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import der FOLLOWS-Beziehungen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.13 ms, sys: 3.51 ms, total: 4.64 ms\n",
      "Wall time: 57.8 s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///follows.csv' AS row MATCH (e:User {userId: row.userId}) MATCH (c:User {userId: row.followerId}) MERGE (e)-[:FOLLOWS]->(c)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der POSTED-Beziehung\n",
    "Jeder der Tweets wird zufällig auf einen der 100 User mit den meisten Followern verteilt."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "top100 = conn.query(\"MATCH (a)-[:FOLLOWS]->(b) RETURN b, COUNT(a) as followers ORDER BY followers DESC LIMIT 100\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "user_ids = []\n",
    "for record in top100:\n",
    "    user_ids.append(record.get(\"b\").get(\"userId\"))\n",
    "\n",
    "tweets = pd.read_csv(\"import/tweetsDB.csv\")\n",
    "f = open(\"import/posted.csv\", \"w\")\n",
    "f.write(\"userId,tweetId,:TYPE\\n\")\n",
    "for index, tweet in tweets.iterrows():\n",
    "    f.write(f'{random.choice(user_ids)},{tweet[\"tweetId\"]},POSTED\\n')\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import der POSTED-Beziehungen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.85 ms, sys: 0 ns, total: 3.85 ms\n",
      "Wall time: 2.18 s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///posted.csv' AS row MATCH (u:User {userId: row.userId}) MATCH (t:Tweet {tweetId: row.tweetId}) MERGE (u)-[:POSTED]->(t)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der LIKES-Beziehung\n",
    "Für jeden Tweet werden aus den Followern des Posters etwa 10 % ausgewählt, welche des Post liken. Die Like-Zahlen aus dem \"tweets\" CSV File werden dabei nicht berücksichtigt."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "allTweets = conn.query(\"Match (t: Tweet) RETURN t\");\n",
    "f = open(\"import/likes.csv\",\"w\")\n",
    "f.write(\"userId,tweetId,:TYPE\\n\")\n",
    "\n",
    "for user in top100: \n",
    "    followers = conn.query(f\"MATCH (follower:User)-[:FOLLOWS]->(following:User) WHERE following.userId ='{user['b']['userId']}' RETURN follower\")\n",
    "    tweets = conn.query(f\"MATCH (u:User {{userId: '{user['b']['userId']}'}})-[:POSTED]->(t:Tweet) RETURN t\");\n",
    "    for tweet in tweets: \n",
    "        for follower in followers:\n",
    "            shouldLike = random.random() < 0.1\n",
    "            if shouldLike:\n",
    "                f.write(f\"{follower['follower']['userId']},{tweet['t']['tweetId']},LIKES\\n\")\n",
    "\n",
    "f.close()    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import der LIKES-Beziehungen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 7.48 ms, sys: 4.32 ms, total: 11.8 ms\n",
      "Wall time: 3min 14s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///likes.csv' as row CALL { with row MATCH (u:User {userId: row.userId}) MATCH (t:Tweet {tweetId: row.tweetId}) MERGE (u)-[:LIKES]->(t) }  IN TRANSACTIONS OF 100000 ROWS\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Alle Posts eines zufälligen Users"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tonight: @BillCosby is back! Then playing a game with @TigerWoods &amp; @McIlroyRory and music from @royksopp &amp; @robynkonichiwa! #FallonTonight\n",
      "\n",
      "Brooklynnnnnnnnn!!!!!\n",
      "\n",
      "#Selenators this is all you guys MTV's song of the summer. http://t.co/Z3ATp13T92 http://t.co/MylSDVHWiT\n",
      "\n",
      "Pakistan passes a law to correct a loophole that allowed perpetrators of \"honor killings\" to escape prosecution… https://t.co/XG2MTLtwFz\n",
      "\n",
      "I 💜 seeing my babes this excited 🙈 yes, you'll have the real thing tomorrow pm! yes, there's still more tea for the rest of the countdown.☕️\n",
      "\n",
      "Ophelia we match!!!!!!!!!!!! https://t.co/F75c2aACKn\n",
      "\n",
      "🌈🌈TULSA WE ARE CELEBRATING EQUALITY WITH YOU TONIGHT AT #THEPRISMATICWORLDTOUR 🌈🌈\n",
      "\n",
      "Congrats, @becolibe and @meganyousmile! You may have had terrible #VacationNightmares, but you won my contest, so clearly it was worth it.\n",
      "\n",
      "The chaos in USA is the result of Trump's irresponsible campaigning. He is not a role model, look at this mess he created. #LoveTrumpsHate\n",
      "\n",
      "Feb 15... RT@nbcsnl: The #SNL40 reunion begins Sunday, February 15 at 8pm ET.\n",
      "https://t.co/DwU80CFb7w\n",
      "\n",
      "Me and Tony are so excited!! @TheGRAMMYs has nominated \"Cheek To Cheek\" for Best Traditional Pop Vocal Album WOW!!!!! http://t.co/hDyt8vOjtN\n",
      "\n",
      "LIVE: President Obama is in Utah talking about training American workers for clean energy jobs. http://t.co/tVLVPOQw7v #ActOnClimate\n",
      "\n",
      "We have way too much fun together 💓😂😍💋 https://t.co/iA5fhlSwvs\n",
      "\n",
      "Armed assailants abduct US aid worker in Niger, and kill his bodyguard and a police officer, government source says… https://t.co/Poi8r6fpng\n",
      "\n",
      "My WORLD!!!!!!! I painted my mimaw's nails yesterday.. She said she wanted pink and my papa picked… https://t.co/gf6SjLVCQC\n",
      "\n",
      "Meet Justice.\n",
      "\n",
      "@Mariska \n",
      "#BadBloodMusicVideo http://t.co/gZK3VhnbOy\n",
      "\n",
      "baby you jus gotta make up your mind\n",
      "that every lil thing is gonna be alright \n",
      "🌑 https://t.co/xfCVF8wuwW\n",
      "\n",
      "\"El Chapo\" is one step closer to facing charges in US after Mexican federal judge ruled in favor of extraditing him… https://t.co/nTDmrWEnyn\n",
      "\n",
      "Thank you guys, I loooove this book so much! You put so much thought into it! I appreciate this and… http://t.co/6iiSDDxXY4\n",
      "\n",
      "Thank you, Secret Service Director Julia Pierson, for leaving the White House. At least it’s really easy to get back in. #thankyounotefriday\n",
      "\n",
      "In the weekly address, President Obama explains the comprehensive #IranDeal: http://t.co/khCtEXhIhA\n",
      "\n",
      "More #HausWork in Manchester in BCALLA Fashion, improv practice with Ella, Tony loves her so do I, Just a Friday. http://t.co/e7rSzriuyc\n",
      "\n",
      "http://say.ly/Twy4rA - Trying for Puskas' 13. It's time to set a new record.\n",
      "\n",
      "@thiojoe Thanks for the question! Only the @ names of those you're replying to won't count.👇\n",
      "https://t.co/pRXJ8QIrvI\n",
      "\n",
      "Amazing birthday surprise from my extended family &lt;3 http://t.co/cJozQZybjN\n",
      "\n",
      "And fuck yeah I just quoted spider man.\n",
      "\n",
      "Catabunga, dudes! 😸🏄https://t.co/6iCTMLyifH https://t.co/gNSxciLIrN\n",
      "\n",
      "❤️ RT @Nastya_02_12_81 #WMABritneySpears @britneyspears The best Fan Base ♡ The best FAMILY ♡ The BIGGEST FAMILY ♡ http://t.co/JudDBz3zRs\n",
      "\n",
      "Clearly, we are very nonchalant about the whole thing. #whereismyCHILL #outofthewoods http://t.co/QAwf8LxwE7\n",
      "\n",
      "1 hour until #SORRY on @Spotify and @AppleMusic @iTunes https://t.co/FygvPiJmpn\n",
      "\n",
      "@GagaObsession24 wanna cry every time I sing that\n",
      "\n",
      "see u soon babe  https://t.co/PU594jU4BF\n",
      "\n",
      "#NEWJERSEY that's what the phuck iz up!!!! #DiamondsWorldTour\n",
      "\n",
      "That face -@charmladonna you my face muse tho 😂 http://t.co/CeOBP9ZUWA\n",
      "\n",
      "terryrichardsonstudio #outtakes http://t.co/ifbq905R\n",
      "\n",
      "\"I want to make sure all our kids get a great education from the earliest age.\" —President Obama\n",
      "\n",
      "Life in Iran from the lens of @Hanifshoaei  https://t.co/VLybwcpLp5 https://t.co/XZEV0yov0F\n",
      "\n",
      "💕💕 https://t.co/BkO8ETtWPG\n",
      "\n",
      ".@POTUS Lip Sync Battle? Announcing third term? Neither? Find out Thursday. #FallonTonight\n",
      "\n",
      "Hey guys, today I've been filming. Have a nice weekend everyone. http://t.co/haEHznzI\n",
      "\n",
      "“You can hear the nib scratching across the surface.” —Calligrapher Seiji Cataldo https://t.co/vYaTDUoDiO\n",
      "\n",
      "Backstage watching y'all!!! #TheMonsterTour NY/NJ y'all are amazing!!! http://t.co/4ItX1LEL6o\n",
      "\n",
      "you boys are too talented for your own good. I'm so thankful for youu @brilovelife @iamskot @iamBoyBoi. #webeworkin\n",
      "\n",
      "At the #TwitterRetreat setting up for a panel on tech in Tunisia. If you're around come join us. We have blankets! #SxSW http://t.co/360aFQx\n",
      "\n",
      "Tonight: @aaronpaul_8, @TigNotaro and music from @FLAGALine! #FallonTonight\n",
      "\n",
      "#DailyFluff\n",
      "https://t.co/fQRoVeVNvD 🐾 https://t.co/Z5aV1vp996\n",
      "\n",
      "Fargo and St Paul were SO loud and wonderful. I can't believe we only have 7 more shows in North America. #redtour\n",
      "\n",
      "Blasting Shakira in the car with my cousin.... Stoked for my show in my hometown!!!! :)\n",
      "\n",
      "President Obama announced a pause on new coal leases on federal lands—a step forward in the fight to #ActOnClimate: https://t.co/boMQbHvImy\n",
      "\n",
      "#WhatDoYouMeanMusicVideo http://t.co/N7PFqMcWAK\n",
      "\n",
      "Happy Holidays 🎶❤️️🎁🎉! #MillionReasons xoxo, Joanne https://t.co/QE8KTcAfZ3\n",
      "\n",
      "For the hammer times, the baby one more times, and the best times #YouTubeMusic https://t.co/C4BE9wh5UA https://t.co/M1fvuqff1r\n",
      "\n",
      "And to the ones in da back... I'm blessed to have y'all ridin dis dick\n",
      "\n",
      "UK Navy, #ROGUEMAN is out now at @HouseofFraser!!! http://t.co/bFMvBVjnoD\n",
      "\n",
      "¡Waka Waka lidera el ránking de @billboard de las canciones de la Copa Mundial! http://t.co/STPTJWuNyf El vídeo http://t.co/1gknJxxy3M SHQ\n",
      "\n",
      "@987ampradio did you like yer cake bb? @TheRealSlacker\n",
      "\n",
      "Your silver tongue is full of lies, with tricks and thrills and Bambi eyes\n",
      "\n",
      "Did this on my birthday... coming soon. Thank you for all the love. I love you guys, God bless https://t.co/4Pb5usx2Pk\n",
      "\n",
      "4.2 seconds that explode into a full music video.\n",
      "\n",
      "The latest from music video icons @okgo → https://t.co/TCHhY73iXN https://t.co/qaKQQ0xnjv\n",
      "\n",
      "I think I found the cat. https://t.co/mYUxQN1Bd5\n",
      "\n",
      "Are you all ready for T-day? Discover #thanksgiving here: \n",
      "http://t.co/8LRVYAgT\n",
      "\n",
      "Thank you to my city and The Memphis Music Hall Of Fame for last night. I am truly honored to share… https://t.co/o7lVPbl5Ks\n",
      "\n",
      "Thanks to @common, @BJTHECHICAGOKID and @TheRoots for this awesome performance https://t.co/FsIU8bq2uN #FallonTonight\n",
      "\n",
      "#savetheday\n",
      "\n",
      "So excited @Mr_Ponyyboyy  is making exclusive sketches 4 http://t.co/M0m4mjqwvP &amp; my app! LUV these pregnancy looks http://t.co/WdIN32TylI\n",
      "\n",
      "@AS_adurm U are lovely!!! Muah #PieceOfMeTickets\n",
      "\n",
      "I heard the 60 minutes special is on now!! Watch it?! Cool thanks.\n",
      "\n",
      "Baby I'm addicted to you.... #‎throwbackthursday #‎tbt ShakHQ http://t.co/BBNX7OFfBc http://t.co/MsD30AxatC\n",
      "\n",
      "We’re projecting #ElectionNight results in real-time on the @EmpireStateBldg 🇺🇸 #MyVote Watch live: https://t.co/0vLgMV0eIG\n",
      "\n",
      "And here we have Curt, demonstrating the newly mandated male dress code for the 1989 World Tour. http://t.co/kwpyhviVWY\n",
      "\n",
      ".@mabgraves combines creepy and innocent for #drawlloween  https://t.co/zisjAee47i https://t.co/hQnlEPytnk\n",
      "\n",
      "Glad you enjoy it. @theRealWheeler 1st go at CR7penalty and got 86500 on mad moire, sense this will be addictive. @Cristiano great game\n",
      "\n",
      "🐼🐼🐼🐼\n",
      "\n",
      "Happy Techno day! I’m celebrating with boots. And cats. Boots, cats, boots, cats, boots n cats n boots n cats.\n",
      "\n",
      "La Fundación Howard G. Buffet se une a @fpiesdescalzos y @Activia en el programa de comidas escolares de @WFP http://t.co/2G1Q7edAhp ShakHQ\n",
      "\n",
      "Getting ready to go to the #TeenChoiceAwards. Which #EDbyEllen piece will I wear? http://t.co/2J0l5WoqlW\n",
      "\n",
      "Get ready. #HandsHighCollege https://t.co/DiF9Ms1kh6\n",
      "\n",
      ".@amyschumer and I have a very emotional interview https://t.co/xr0dt3Yghb #FallonTonight\n",
      "\n",
      "Angel. #RIPMayaAngelou The first book I read as a teenager, \"I know why the caged bird sings\". Felt like we knew her http://t.co/inHEh9zIhs\n",
      "\n",
      "Wing part found on Tanzanian island \"highly likely\" from #MH370, Australia's transport minister says. https://t.co/k7JLJ7iDN7\n",
      "\n",
      "Discover the latest on any topic, instantly. Search to see what everyone's saying. #TwitterTips https://t.co/EvdxGjppjp\n",
      "\n",
      "Hahaha! #CantStopTheFeeling  https://t.co/4r1I59U6uZ\n",
      "\n",
      "Why do we park in a driveway and drive on a parkway? #bassackwards\n",
      "\n",
      "I miss it when my little angel falls asleep on my face..... I miss you little man 💕 https://t.co/Mr5fdgQaku\n",
      "\n",
      "#Unapologetic\n",
      "\n",
      "Listen to #WORK from the #ANTI album here —&gt; https://t.co/atvJ4F4xuj\n",
      "\n",
      "#CheekToCheek is OFFICIALLY OUT NOW in US, Canada, &amp; Mexico!!! 🎺🎉  BUY NOW: http://t.co/cDRXGkHJ7b http://t.co/c4A6cbEHYm\n",
      "\n",
      "my son! https://t.co/i6bwWsFdzO\n",
      "\n",
      "Check out the official lyrics video for \"Hit The Lights\"—the whole video will be out on 11/16, can't wait for you... http://t.co/FigJC74g\n",
      "\n",
      "DALLAS!!!! I'm coming homeeee!! Meet &amp; greet info here: https://t.co/QLMaUwTLeq #CONFIDENT\n",
      "\n",
      "@FuadFathalla That’s true, another big game coming up on Saturday.\n",
      "\n",
      "Happy Memorial Day!!!  Here in Budapest we are working on the movie but, I wanted to stop in and say hello and let... http://bit.ly/cuSGsK\n",
      "\n",
      "Young Cruz! Great job buddy #hometomama https://t.co/A7IvKhpQWE\n",
      "\n",
      "Oh yes!!! #777 pix on instagram http://t.co/WsUiK3Mi\n",
      "\n",
      "Uh... You're welcome?? 😬\n",
      "\n",
      "#CantStopTheFeeling  https://t.co/tQ2yVV5l8P\n",
      "\n",
      "@yungskeeter ugh. I'm not limp bizquick?! 🙍\n",
      "\n",
      "@727deluxe hi my baby. love youu\n",
      "\n",
      "Britney Army, I am counting on you tomorrow… rest your little voting fingers for @CarlyRoseMusic!! #CarlyForTheWinTomorrow\n",
      "\n",
      "We've got a present for you: The year on Twitter, wrapped, and ready to open. http://t.co/e5orTsqNc6\n",
      "\n",
      "9 days left in the myyoutube contest.  Click this link to learn how to win two tickets to an upcoming concert in 2011 http://bit.ly/94IGiQ\n",
      "\n",
      "Check out how they decorate for Halloween here in LA it's crazy! Shak http://t.co/cc4a3jWXvH\n",
      "\n",
      "CEO John Stumpf retires, Wells Fargo says, a stunning downfall for one of industry's most powerful banking figures.… https://t.co/vUD9EbX7GM\n",
      "\n",
      ".@Macklemore and @LeonBridges. Blown away by that amazing performance. #AMAs\n",
      "\n",
      "Happy #MeMeMonday! https://t.co/M0y3k18ncE\n",
      "\n",
      "Win a $500 Container Store gift card in the Ellen Shop today! I’m so excited I can’t contain myself, which is ironic. http://t.co/32vpLzfNQC\n",
      "\n",
      "Tweet and he will come! A great example of how communities are more connected to their leaders than ever. http://t.co/kuTEUzN\n",
      "\n",
      "Wait until you see what happened during a commercial break. Tonight was so much fun with Billy Joel.\n",
      "\n",
      "Wasabi doesn’t just grow on trees, you know. https://t.co/qrm6UD1oHR https://t.co/x1cT4dVhwD\n",
      "\n",
      "Just posted a photo http://t.co/VHqHYRNKXM\n",
      "\n",
      "One person is dead, multiple others injured in a shooting in Austin, Texas. https://t.co/xXgDNrO9XN\n",
      "\n",
      "\"When the dust has settled, there can be no doubt that this law is working.\" —President Obama #ACAWorks\n",
      "\n",
      "Find out how @OFA is giving organizers around the country the training and management skills they need to succeed. http://t.co/zUECBnYZhP\n",
      "\n",
      "Watch: President Obama gives a behind-the-scenes look into tonight's #SOTU address. http://t.co/bCW5Kt2Jb4\n",
      "\n",
      "❤️ my 🇬🇧 glam team @lisaeldridgemakeup @dayaruci Wearing a vintage t,Chloe skirt, Manolo heels&amp; some of Kanye's belts http://t.co/WiCKtemc29\n",
      "\n",
      "Siempre doy todo por las camisetas que llevo, pero estas, son especiales RT @LaraGoonzalez Podeis ganar. Gracias por luchar por esa camiseta\n",
      "\n",
      "Hanging with @joebermudez in Boston. Y'all ready?!!\n",
      "\n",
      "Tweet @SaturdayOnline and request EMPIRE using #MaxwellPlayShakira to help make it most requested - thank you! http://t.co/ezL8gWPaaT ShakHQ\n",
      "\n",
      "I just wanted to say Thank You to all who came out and supported the \"We Own the Night Tour\"  Thank you all so... http://t.co/44Bh7h0Z\n",
      "\n",
      "@MyleezaKardash OMG literally just was texting Olivier wait til the bounce back happens!!!!\n",
      "\n",
      "Happy Holidays! This season may all your pain he cham-payne 🍾. All I have is because of you. ❤️ https://t.co/Acvh7ss30G\n",
      "\n",
      "Spread the word! #PlanetBritney #PieceOfMe #December2013\n",
      "\n",
      "Today, do something you wouldn't usually do, and take surveys of how it makes you feel. It may surprise you! 📷 http://t.co/by7L39XSas\n",
      "\n",
      "@twerkyago @danielparo hahahahha\n",
      "\n",
      "Skylight through the pool... GoodMorning from #thailand http://t.co/29uysMRExi\n",
      "\n",
      "#DailyFluff\n",
      "https://t.co/NBTh7k5cyC🐾 https://t.co/GUQLQIW0EE\n",
      "\n",
      "Kourtney looks amazing!! @cosmopolitan @kourtneykardash https://t.co/U7MTd4m04s\n",
      "\n",
      "Cover 15/16 Gaga &amp; Taylor By Taylor Kinney 100% of sale goes to @BTWFoundation We made love on a canvas for peace. https://t.co/pvsjgs8FTd\n",
      "\n",
      "ISIS leaders planned Europe strikes beyond Paris, worse carnage, CNN investigation reveals. https://t.co/rWKE1ebykf\n",
      "\n",
      "@ItsBritneyAgain Thank u sweetie! :*\n",
      "\n",
      "At least 4 police officers were injured Wednesday in a protests in Charlotte, authorities posted on Twitter.… https://t.co/cMUR91SBu1\n",
      "\n",
      "haha thank you! we had so much fun watching the lightening driving in a convertable! https://t.co/NDGAZqDsCd\n",
      "\n",
      "🎀🎈30 years later &amp; now celebrating our kids parties! 🎉🎀 http://t.co/1Mef2ebX4z\n",
      "\n",
      "My #clique http://t.co/JHhNUtzK\n",
      "\n",
      "Thank you!!! https://t.co/PwCwaRmTSc\n",
      "\n",
      "A (sort of) synchronized summer splash #WHPsymmetry https://t.co/gPakpq7xnW\n",
      "\n",
      "#CouchSelfie http://t.co/AZDIB88OwR\n",
      "\n",
      "Primera Navidad de Sasha! Shak https://t.co/qBLot5dfh0\n",
      "\n",
      ".@russellcrowe and I play \"Box of Lies\" https://t.co/KHH4YBrU5a #FallonTonight\n",
      "\n",
      "...but I'm just gonna shake.\n",
      "\n",
      "http://t.co/JhUZG7ADJ4\n",
      "#TS1989 \n",
      "#taylorlurking http://t.co/tdqbIJsOPK\n",
      "\n",
      "Woman accidentally fatally shot during community police academy exercise in Punta Gorda, Florida, police say. https://t.co/yAoMEe3809\n",
      "\n",
      "Of course @iamcolinquinn steals the show. Thank you Colin. Stay tuned… More to come…\n",
      "\n",
      "Campeones !!!!\n",
      "\n",
      "@zainal_audio Thank you.\n",
      "\n",
      "Thank you :) https://t.co/rIuhvHDG8z\n",
      "\n",
      "My Instagram is definitely my expression and what I love to show the world. My snap is kinda my silly sarcastic alter ego\n",
      "\n",
      "Now this is a party....http://t.co/LEsc9DuJ6a @BenAffleck #RunnerRunner out Oct 4th -teamJT\n",
      "\n",
      "We've painted a new Twitter Tale with @MuseumModernArt: Twitter is about Art http://t.co/NpuBoj7\n",
      "\n",
      "@EBUNC1 thank you!!!\n",
      "\n",
      "@nixiepixi So close! What are you going to do to celebrate?\n",
      "\n",
      "Welcome. My fans are great if you need pointers. @deedsmcd My first day on Twitter, no idea how it works but following @Cristiano Ronaldo.\n",
      "\n",
      "When you could go anywhere for your bday dinner but you're so OG that you go to OG with all your… https://t.co/Ihj8FWsjR9\n",
      "\n",
      "🇺🇸 💰 📲 https://t.co/LMsW62WQv3\n",
      "\n",
      "French President says controversial makeshift camp known as \"The Jungle\" in Calais will be completely dismantled. https://t.co/l7NYiQNusk\n",
      "\n",
      "17.6 million Americans have gained coverage under #Obamacare—that’s a BFD. https://t.co/BrSkDAvLsn\n",
      "\n",
      "St Louis. Pre Show. @caitlinbird and me. Lyrics. http://t.co/w3hgGKYI2I\n",
      "\n",
      "Shit like this makes me feel right!!! http://t.co/CSTv7BvO\n",
      "\n",
      "What's in your creative world? #CreativityIs @GQMagazine @CondeNast\n",
      "https://t.co/GuBA3ef4WI\n",
      "\n",
      "@sem5661 You're right, Sydney — they sure do. Now you can tap to Retweet any of your older Tweets! 🙌\n",
      "\n",
      "@bellamia228 😂😂😂\n",
      "\n",
      "Here’s a quick catch up of #GOT. You’re welcome. https://t.co/YvaaaeMGZj https://t.co/rFYSnjI69z\n",
      "\n",
      "DARE I CHANGE MY HEADER????? (it's been 84 years) (you already know)\n",
      "\n",
      "Have you guys set a wedding date yet? https://t.co/VMxuYb32cQ\n",
      "\n",
      "Having long hair in winter is a must! https://t.co/PNsmbt9Si3\n",
      "\n",
      "Tack Sweden! #JT2020Tour http://t.co/6heQpSBRGl\n",
      "\n",
      "@joejonas OMG! This is too good... Thanks, Joe!\n",
      "\n",
      "Performing \"Love You Like a Love Song\" on @JayLeno tonight.\n",
      "\n",
      "Thank you @kevinbacon. He destroys tonight. @TheBeachBoys fans tune in!! #HamburgerStand #FunFunFun #FallonTonight\n",
      "\n",
      "Carole King and James Taylor(the FIRST JT!)on PBS Live at the Troubadour is giving me life right now. #MasterMusicians\n",
      "\n",
      "Selena is @postcarding \"Thanks to help online I finally figured out how to properly dip an Oreo.\" http://t.co/rfmGvFzu\n",
      "\n",
      "Stay tuned! #rockinriolisboa The #JT2020Tour @rockinriolisboa show is streaming LIVE in a bit! http://t.co/vItICjAAp1 -teamJT\n",
      "\n",
      "Tippin at gunpoint #MagicCity #ATLnights http://t.co/9fUvN6vLLe\n",
      "\n",
      "Love playing Football? Think you have the skills to join a global competition? Follow @GAMEbyRonaldo now!\n",
      "\n",
      "I'm so excited for my album to come out in 7 days! Once again our monster community will come together in love, inc… https://t.co/9ZTuL739GV\n",
      "\n",
      "@tomlincoke :)\n",
      "\n",
      "“@freestylesteve: Ok So Why Am I Reading The Paper Today And I See A Story That Justin Was... http://t.co/uA7tgjCLmU” GET EM STEVE! Haha!\n",
      "\n",
      "\"I just realized we got through Christmas this year without listening to 'Christmas Lights' by Coldplay and crying!\" \n",
      "-@austinswift7\n",
      "\n",
      "https://t.co/CYwi1fR7lx\n",
      "\n",
      ".@SUP3RFRUIT do the creepiest YouTube challenge we’ve ever seen. Ahhh MAKE IT STOP. https://t.co/aI0mxnEZi4 https://t.co/QqCivaerck\n",
      "\n",
      "🐭FOR HIRE🐭 http://t.co/OwuXyGZVWX\n",
      "\n",
      "Skate the rainbow. https://t.co/QcMcGxEt7S https://t.co/ibakEILVXu\n",
      "\n",
      "There are many options for late night snacking when in the studio, but obviously I chose wisely! Duh! @popchips http://t.co/fBbUssNC8q\n",
      "\n",
      "Yes @traceayala. More tweets of your daughter(my God-Daughter)in my hats... http://t.co/oT078wMJ\n",
      "\n",
      "@TTLYTEALA @IISuperwomanII We have so much love for this love. ❤️\n",
      "\n",
      "“@Brogers821: @jtimberlake JT my lil man Ryan just had his bday. Lil 6yr old loves Suit &amp; Tie. Love it! Happy Bday to your lil' guy, broham!\n",
      "\n",
      "We. http://t.co/1F7qsXcEfd\n",
      "\n",
      "@iamnoXii thank u!!! I could never do it without my fans and music lovers I'm so grateful everyday!\n",
      "\n",
      "@youmeandheya Yes I do I can't wait.\n",
      "\n",
      "\"When the cynics tell us we can't change this country for the better, we know they're wrong. We've got proof.\" —President Obama\n",
      "\n",
      "Lots of good lookin’ fellas on my show today, like this one who told me about dancing in a thong. Better him than me. http://t.co/f8P9A7Akej\n",
      "\n",
      "“@AlwaysHopeinRI: Pre ordered #The2020Experience part 2 from @Target...can't wait to hear it!!” I can't wait for you to hear it too!! #2of2\n",
      "\n",
      "Baby we're the New Romantics.\n",
      "Come on, come along with me..\n",
      "#TS1989 \n",
      "#taylurking http://t.co/bIyx3E111L\n",
      "\n",
      "Lights off, lights on whoop! Great class!! https://t.co/6F0xsORCZQ\n",
      "\n",
      "Lookin’ good, @JKCorden 💁 \n",
      "\n",
      " #GagaCarpool Karaoke → https://t.co/jRxK8fdX1u https://t.co/pclyphBba8\n",
      "\n",
      "Far out! https://t.co/bGOGN4zo3O https://t.co/BroKsTE2wx\n",
      "\n",
      "MEMES https://t.co/PJgduFHJLE\n",
      "\n",
      "#UNAPOLOGETIC http://t.co/jOWT3YV2\n",
      "\n",
      "A bird flies into a beautiful shadow scene for #WHPlightandshadow https://t.co/tYdU6Y9HZQ\n",
      "\n",
      "Portuguese and italian.  - @ChikiiAm @Cristiano What is your favorite food??\n",
      "\n",
      "Apple cider and my girls ☺ Happy new year my loves ❤ love you all endlessly http://t.co/JlGsiQn1dx\n",
      "\n",
      "#LetsMove MT @FLOTUS: The First Lady wants to know… #TurnipForWhat? https://t.co/fcekmYqAiM  #AskTheFirstLady #TD4W\n",
      "\n",
      "Had the most fun being authentic with my peers. Thank u @Spotify for understanding the community that we are creating &amp; holding the space ❤️\n",
      "\n",
      "Thanks to my ATL pal @ninadobrev for lip syncing with me tonight. You killed it!!! http://t.co/l4aBGtsPAj\n",
      "\n",
      "Colombiaaaa\n",
      "\n",
      "#OverAndOverAgain Jan 15 https://t.co/JRqcCca76Y\n",
      "\n",
      "Open enrollment begins tomorrow—make sure you and your loved ones #GetCovered. https://t.co/2aak7Bt0s3\n",
      "\n",
      "✌ http://t.co/49PCS9VQMJ\n",
      "\n",
      "Filmed by the amazingly talented @AwkwardAya at the sweetest place of all, @duffscakemix! #KPBIRTHDAY\n",
      "\n",
      "Catch up on the The Finale of @AHSFX watch show stopping performances from @MsKathyBates @denisohare the whole cast https://t.co/gKXPkJkIHy\n",
      "\n",
      "Spelling a name right on a coffee cup is hard to do, or my name’s not Hellen DinnerGenius. http://t.co/A1p0oa1VhJ http://t.co/aZMVkJ674i\n",
      "\n",
      "This #TravelTuesday, choose your own adventure in Dubai.\n",
      "https://t.co/RKRIRgnbpl\n",
      "https://t.co/osZolXcUky\n",
      "\n",
      "@Fps_Kimberly Don't worry it will still be there when u get home :) #OohLaLaVideoPremiere\n",
      "\n",
      "Celebrating a year on Vine: https://t.co/bCkNjOHMg7 cc @vineapp\n",
      "\n",
      "@MissyLynn_1 Tell me about it. Norfolk St. and Lehigh just ruined me. #15over2\n",
      "\n",
      "London's calling for today's #ShakiraCountdown graphic by @Sitofon! 14 days to go. Send yours for tomorrow! ShakHQ http://t.co/11AUUiKEY4\n",
      "\n",
      "@BrunoMars I am ready papi\n",
      "\n",
      "“@FireBombFenty: Rih never fails to surprise, and keep her fans interested! thanks boo. #Navy4Life” we serve!! It's a #Navy thang!\n",
      "\n",
      "Selena is @postcarding \"new hair for a new movie :) I love changing my hair!\" http://t.co/S465eIkX\n",
      "\n",
      "#COOLFORTHESUMMER 😎🌴☀️🍒🍉 http://t.co/Eljbo6MjbO http://t.co/nFDD2ty9gS\n",
      "\n",
      "Btw... http://t.co/ngLVs3TohK\n",
      "\n",
      "Thank you so much @yelyahwilliams 💗💗💗\n",
      "\n",
      "@WiseKarl Confetti Tweets sure are addicting #LoveTwitter https://t.co/7GMOOmgi5p\n",
      "\n",
      "Vegas !! y'all were amazing tonight. I love you so much. thank you for your love &amp; energy 💞💕\n",
      "\n",
      "@CarinMB drinking sprite isn't the same without you :)\n",
      "\n",
      ".@BlakeShelton told me about the beautiful music he’s making with @GwenStefani. They’re also writing songs. https://t.co/ZjS3BWisL2\n",
      "\n",
      "Who's fault is it that teens can name more celebrity feuds than wars?\n",
      "\n",
      "@PhillyChic5 You're welcome! Orange you glad about #PrankAcademy?\n",
      "\n",
      "Purpose album ---&gt;  https://t.co/ZWMJvhasht\n",
      "\n",
      "I'm going to watch Blue Crush tonight :) started it this morning. Made me happy lol\n",
      "\n",
      "👨‍👩‍👧 http://t.co/1v5Q7viBmA\n",
      "\n",
      "Small town living is the best\n",
      "\n",
      ". @AmyGrimesSux so happy, a most beautiful feeling\n",
      "\n",
      "Thank you. Means a lot http://t.co/VduloM2x2w\n",
      "\n",
      "Happy bday Mr President @BarackObama ! All the best and big hug! Shak\n",
      "\n",
      "#                #phuckyophuckyo http://t.co/07dli5E6Zg\n",
      "\n",
      "Tonight: Keith Richards (@officialKeef), @DebraMessing &amp; music from @TheReplacements! Plus a special edition of #ProsAndCons! #FallonTonight\n",
      "\n",
      "Reading all the news about Texas. It's a very sad time for lots of ppl. Let's send extra love &amp; light out. Don't take anything for granted.\n",
      "\n",
      "\"soon\". &amp; you're getting more than just oneee.  https://t.co/cZOHrm7S7n\n",
      "\n",
      "There’s handcrafted harmony in Sabina Gibson’s magical animal kingdom https://t.co/sVUjZqHLQM https://t.co/gx4S1u8UIH\n",
      "\n",
      "Millions of Americans still need to get health insurance—this is your chance to make an impact: http://t.co/nCjdfzik9v\n",
      "\n",
      "ELLEN I AM CACKLING \n",
      "@TheEllenShow \n",
      "http://t.co/c26jsXyHYS\n",
      "\n",
      "Bae's in Paris https://t.co/oQcWJpW6Ao\n",
      "\n",
      "#BTS GIVENCHY http://t.co/sHeSjQrpDg http://t.co/gQR4lpB9iQ\n",
      "\n",
      "The new video for #TryEverything from #Zootopia already has 5m views! Watch it at https://t.co/2xqIw3e4CP ShakHQ\n",
      "\n",
      "love you my babies\n",
      "\n",
      "The cold never bothered @taylorswift13 anyway. https://t.co/4vDyMqGpdC #OutofTheWoods https://t.co/M529nHBYxA\n",
      "\n",
      "👀 👀 👀 👀 Right back at you @jimmyfallon @FallonTonight #Looks\n",
      "https://t.co/K7oc37T4Zs\n",
      "\n",
      "Excited to help launch http://t.co/h5mHDEbD3E, a new initiative encouraging people to speak up for #mentalhealth! http://t.co/EdHI5Xnnwq\n",
      "\n",
      "Me too!! Followed u! RT @MarilymSalinas I am excited... #ScreamAndShoutToday ♥ Follow me, please!\n",
      "\n",
      "It's time again radio listeners... Know Your Napkins!! https://t.co/DbXHRhtCSs\n",
      "\n",
      "#CoolForTheSummer 4 DAYS 😎 http://t.co/FfoZoScipy\n",
      "\n",
      "Tonight on the show: Jeff Bridges, Ali Larter (@TheRealAliL), and comedian @andywoodhull. Plus it's #ThankYouNoteFriday! #FallonTonight\n",
      "\n",
      "He did it! He won the marathon! Congrats @EdGlavin on completing the #TCSNYCMarathon. Incredible. Now run back to LA. We got a show tomorrow\n",
      "\n",
      "@CottonCandyKaty OY OY OY!\n",
      "\n",
      "\"We pray that the greatest fighter of them all finally rests in peace.\" —President Obama #RIPMuhammadAli\n",
      "\n",
      "Thank you all for such a wonderful night, I could not have imagined winning all that I won.  It is all because of... http://fb.me/1dv2ZHv4D\n",
      "\n",
      "It’s really happening. http://t.co/I3AoMemkxf\n",
      "\n",
      "To our Heroes http://t.co/wDvwF9puDP\n",
      "\n",
      "I was in my 1st Twister commercial at 10, now I’m in another! Can’t wait 4 u guys 2 see it!!! #LetsMove #TwisterMoves http://t.co/WET0ZJEcwc\n",
      "\n",
      "The Week on Instagram | 253 \n",
      "https://t.co/LMkOKDbGmk https://t.co/luBjbJgiPy\n",
      "\n",
      "When my fave photog uses my @lumeecase ... Get yours at https://t.co/Wcvt43a1qy https://t.co/Wmbvbs9G3z\n",
      "\n",
      "As I have a last listen, I thought a lot about my year. I thought a lot about my voice. And after a… http://t.co/p0IpbOCoxr\n",
      "\n",
      "@roddict Say hello to Brazil for me :) Xo\n",
      "\n",
      "@givenchydress sorry\n",
      "\n",
      "When you're making wish, but you already have all you really need standing around you. http://t.co/HNU7aJ4mfZ\n",
      "\n",
      "Thank you Claudio's in Greenport!! Best chowder, best people. #familyowned https://t.co/kONPTGjQ0M\n",
      "\n",
      "of course i had to fly to Paris for fashion and foooood!!!!\n",
      "\n",
      "#BestFanArmy #Beliebers #iHeartAwards https://t.co/dlRiy7TmXn\n",
      "\n",
      "Bae http://t.co/R82vJnXKil\n",
      "\n",
      "Today we're taking legal action to provide more #transparency to our users about requests from the US government. https://t.co/hyY4Ui3dDH\n",
      "\n",
      "“Whenever I work with flowers, I’m in a great mood.” —Natalia Zhizkho\n",
      "\n",
      "@ToriKelly you have a special gift. God bless\n",
      "\n",
      "Singer Chris Brown arrested on suspicion of assault with a deadly weapon, LAPD official says https://t.co/RScJysJwu1 https://t.co/e0XWGQLmn5\n",
      "\n",
      "@snowiner I have a delicate chemistry too 😔\n",
      "\n",
      "#4DaysTilFocus 😂😭 @frankiejgrande https://t.co/HKZqV79pcF\n",
      "\n",
      "Maryland AG appeals new trial granted to Adnan Syed, who was subject of “Serial” podcast. https://t.co/5767jbgkUD https://t.co/kDPFxcwR59\n",
      "\n",
      "Maryanne has better coverage at a lower cost: http://t.co/1amxtPnwiL #ThisIsWhy http://t.co/FBGJw5aI91\n",
      "\n",
      "Cover 2/16. Karl Lagerfeld shot by Hedi Slimane @vmagazine https://t.co/Kkubrle9ME https://t.co/z2Sjk2hisH https://t.co/5P1lYlRFpW\n",
      "\n",
      "Help us pick Shakira's new Facebook cover photo from a selection of new pics from the #AddictedToYou video shoot http://t.co/zDEvKrJl ShakHQ\n",
      "\n",
      "@yolanda_gampp We’re gonna need to take this on our next vacation.\n",
      "\n",
      "Happy Monday folks!! RT #VoteTimberlake #KCA to vote JT for Favorite Male Singer! -teamJT\n",
      "\n",
      "Gettin beautified for ya Dubai music week. #BeAtinya #imgonnasweatitalloff http://t.co/ep8uXMJAzO\n",
      "\n",
      "Cool for the summer....time sadness???? 😳😝🤓@lanadelrey 😍😍😍 so so so nice to meet you!! #WomenInMusic #lanadelslay https://t.co/FPZfgknLwh\n",
      "\n",
      "For ur sub-tweeting pleasure - #TBT to me &amp; my tour mate @KaceyMusgraves on @CMT #Crossroads: http://t.co/30YxGXpDhe\n",
      "\n",
      "Hoy en Quito @el_BID y @MovimientoALAS reconocen las experiencias destacadas de Ecuador en primera infancia del #PremioALASBID2014 ShakHQ\n",
      "\n",
      "Sup? http://t.co/U3KmFZyeyr\n",
      "\n",
      "I just loved this song and it spoke to me right away. RT @hausofbader The beat and lyrics are everything! #BritneyJeanListeningParty\n",
      "\n",
      "Dancing in Indonesia for #WWIM14🍴\n",
      "https://t.co/9PTY96K2Cu\n",
      "\n",
      "My co star @reevecarney did all of his own stunts in the Trouble video- another fantastic reason to vote for VMAs! :) http://t.co/nK9rhV95RP\n",
      "\n",
      "@kidrauxhls Luv it!\n",
      "\n",
      "“I’m Real” was the #1 song 15 years ago today. Yet the question remains: Are you Ellie? https://t.co/C4LGqCGw1c https://t.co/JjoL371dIs\n",
      "\n",
      "Backstage at MetLife Stadium. Trying really hard to feel like this sign in my dressing room isn't… http://t.co/sy9ZgWVbT4\n",
      "\n",
      "Performing \"Slow Down\" on The Tonight Show with @jayleno http://t.co/z6ACBgI6sy\n",
      "\n",
      "Brand new song is out 🎶 Stream #PrivateShow on @Spotify now!!! https://t.co/du9z9mhNau\n",
      "\n",
      "Merry merry.\n",
      "\n",
      "“This is not just a Latino issue. This is an American issue.” —President Obama #ImmigrationAction\n",
      "\n",
      "Doing my #FFF today since yesterday was about the album!! Hope u guys are enjoying both #CONFIDENT &amp; @devonnebydemi! http://t.co/uUQRgNqqrG\n",
      "\n",
      "I adore these kids 💖 Only a few more days left to get involved in the @Prizeo campaign that supports @NVCCF!… https://t.co/12w2BqelhT\n",
      "\n",
      "Wow. Did we just make history?! Thank you so much to ALL of #Top40 and @RCARecords! UNREAL! I'm blown away! 🙏‼️\n",
      "\n",
      "https://t.co/WHoXiMp5Pe\n",
      "\n",
      "Life moves fast. \"If you don't stop and look around once in a while, you could miss it.\"\n",
      "\n",
      "https://t.co/qXCEYHJ8j3\n",
      "https://t.co/bMew3vsH1u\n",
      "\n",
      "I apologize to anyone that felt I was out of turn. I have nothing but LOVE FOR YOU AND ALL OF US.\n",
      "\n",
      "--JT\n",
      "\n",
      "There are 50 Dorys hidden all over https://t.co/APojFeehjF and https://t.co/codGmfrXdx. How many have you found? https://t.co/UfknDIy4ip\n",
      "\n",
      "@yaelgrobglas Thank you! I already know I’m going to love it!\n",
      "\n",
      "Woman Cards accepted here. https://t.co/nIu21XybZk\n",
      "\n",
      "Super Tonight Show Moon! #MOON http://t.co/2CYZZVILUB\n",
      "\n",
      "current mood https://t.co/OWHLlLhuGC\n",
      "\n",
      "6 weeks\n",
      "\n",
      "There's been great progress over the past 55 months—it's time to #RaiseTheWage to help keep the economy growing. http://t.co/2xqIw7MyC4\n",
      "\n",
      "Money on my mind #pouritup http://t.co/GhSEC1R7Z6\n",
      "\n",
      "or maybe i will..... we'll see 🙊☕️🌙 love u\n",
      "\n",
      "Say hello to 15-year-old snowboarder @chloekimsnow, who is riding today at the Burton US Open https://t.co/4AgoNwIWKj\n",
      "\n",
      "@Bing What's up?\n",
      "\n",
      "Ain’t it the truth. https://t.co/D4WJWxD92s\n",
      "\n",
      "Great rehearsals! #BBMAs https://t.co/dOh2ihkorR\n",
      "\n",
      "@toxicbrit YES!! Love it. Thanks for supporting!\n",
      "\n",
      "Doing interviews w/ a song stuck in my head=\"Focus. Answer the question. BABY YOU A SONG, YOU MAKE ME WANNA ROLL MY WINDOWS DOWN AND CRUISE\"\n",
      "\n",
      "1 hour until we go live from The Roxy on www.selenagomez.com! We have some special guests performing tonight!\n",
      "\n",
      "“@CodeFord: @Chilis these @jtimberlake remixed dranks are legit.” @Sauza901 🏆‼️\n",
      "\n",
      "The hydraulic press goes bowling. https://t.co/e4QlayZegR https://t.co/HRs23lmRcs\n",
      "\n",
      "Orlando hospital says it won’t bill victims of June shooting at Pulse nightclub. https://t.co/Gvt9h3I2hE https://t.co/oifxRg19CR\n",
      "\n",
      "The @EpicMealTime boys get that syrup in ‘em, they get all ansty in the pansty. https://t.co/g8tT31l9V4 #PancakeDay https://t.co/yLdSfMN2xX\n",
      "\n",
      "America, tune in tonight at 8/7c for the @NBCTheVoice Final 3!#VoiceFinal3 / Esta noche a las 8/7c  #VoiceFinal3 ShakiraHQ\n",
      "\n",
      "Yassss West Coast getting ready! #KUWTK  https://t.co/Qs2oUfEWKE\n",
      "\n",
      "The brother of JonBenét Ramsey files a defamation lawsuit against CBS and others over murder miniseries.… https://t.co/cDszqEPt87\n",
      "\n",
      "A snowboarder caught mid-loop https://t.co/EOqpcVjkmy\n",
      "\n",
      "I hope it all goes well with Abidal, and that he gets back soon.\n",
      "\n",
      "I ❤️ NY PT. 2 #CONFIDENT http://t.co/KwOryUceRi http://t.co/GtQ9Q7v5uk\n",
      "\n",
      "\"Don’t gain the world and lose your soul, wisdom is better than silver or gold.\" - @bobmarley #Marley70 http://t.co/Bdif875TVV\n",
      "\n",
      "Lots of love for the UNICEF show :)  http://t.co/7LPSk15G\n",
      "\n",
      "US fans, enter to win a trip for two to see Shak perform in LA with @iHeartRadio! http://t.co/TNXUNPTmI7 ShakHQ\n",
      "\n",
      "Ahoy! Meet today's #WeeklyFluff treasure, one-eyed @piratecatwillie https://t.co/QD7vZ7QOXo\n",
      "\n",
      "Four Americans were killed in attack in Afghanistan, Defense Secretary Ash Carter said. https://t.co/g05QqLa934 https://t.co/qPbnS4weSl\n",
      "\n",
      "Nothing like hiking to refocus your energy. Can't wait to get back to Vegas this week! https://t.co/n47IDtucy8\n",
      "\n",
      "Yum yum! “@dizzycoco: @katyperry Hey I baked these today, the photos not great hope you like the cakes http://t.co/6NKWwWH9yc”\n",
      "\n",
      "MY bag. “@MDMOLINARI: I had a feeling when I lost my #KarlLagerfeld bag it would come back tah meh...It has!!! 🙏🙈🙊😭 http://t.co/NdqJikgKzJ”\n",
      "\n",
      "@mtvema yes I am\n",
      "\n",
      "@iamwill @williamorbit That song is from another planet. I hope Earth is ready!!! :)\n",
      "\n",
      "#ratedr #killa http://t.co/ZpU6NNBrHR\n",
      "\n",
      "Charleston church shooter Dylann Roof should be sentenced to death, a federal jury finds. https://t.co/k7aTK8awSt https://t.co/bg6xy6Od83\n",
      "\n",
      "You guys are wonderful. http://t.co/WTo1o5Bu\n",
      "\n",
      "It’s #EarthDay! Take a minute to appreciate the world around you. Pet a squirrel. Scatter sunflower seeds around your home. Wash a tree.\n",
      "\n",
      "If you wanna Scream &amp; Shout and vote @beatricemiller, dial 1-855-843-9307 or text VOTE to 9307! #Vote4BritneyTeens\n",
      "\n",
      "Doing a show in my hometown... And this is my dressing room. Lol  http://plixi.com/p/59424048\n",
      "\n",
      "¡Queda una semana para el cierre de la convocatoria al Premio ALAS-BID! ¡Inscríbete! http://t.co/CLztzL4XYQ  @MovimientoALAS @el_BID\n",
      "\n",
      "#PURPOSETheMovement #IllShowYou \n",
      "\n",
      "https://t.co/Jd95SI99cV\n",
      "\n",
      "Performing Who Says live for the first time at COH concert. Enter for a chance to win tickets from @RyanSeacrest http://bit.ly/SelenaTrip\n",
      "\n",
      "@BabifanBritney happy early birthday!\n",
      "\n",
      "Hashtag game! Tweet out something dumb, weird, or embarrassing you've done or thought and tag with #ImDumb. Could be on our show!\n",
      "\n",
      "@Assistant_Ozil https://t.co/zsW7WZbmuS\n",
      "\n",
      "love you &amp; thank you alexanderwangny https://t.co/7QvNzYZoIK\n",
      "\n",
      "#taxicabconfessions @ursulastephen http://t.co/SjLLYQdNzr\n",
      "\n",
      "It's up! It's live! @Homemint or http://t.co/mffg5S8c... Ch, ch, ch, check it out.\n",
      "\n",
      "@petewentz yo totally already watched it... SO GOOD.. Research the conspiracy theories.. They're crazy\n",
      "\n",
      "@prismaticIights legend\n",
      "\n",
      "My next single #Confident is avail on @AppleMusic NOW when u preorder the album!! Go get it!! http://t.co/KwOryUtQfS http://t.co/azTo8eD1E6\n",
      "\n",
      "The perfect start to the weekend.\n",
      "\n",
      "Catch the recap from last night’s #NYGvsPHI live stream.👇 https://t.co/vtoZBDEeLF\n",
      "\n",
      "Italy http://t.co/B5fCPXkcuR\n",
      "\n",
      "@guiller_alapan Xo!\n",
      "\n",
      "\"If we're going to deal with this problem, and the inequities involved, we're going to have to speak honestly.\" —President Obama\n",
      "\n",
      "@AndreaMjaraa This thread. 🙌\n",
      "\n",
      "@Chanchis77 Hola. Saludos Guatemala.\n",
      "\n",
      "🎄🎅🏼 Friends! Watch me make ✨magic✨ as your festive fairy for the @hm #HappyandMerry campaign! See the… https://t.co/WOM4t3Z4be\n",
      "\n",
      "#StanLife #iheartmynavy #sneekpeekofmynextMACproject http://t.co/vC252iCN3a\n",
      "\n",
      "I just downloaded it. I really love this song too https://t.co/Sy7VLykgQ0\n",
      "\n",
      "Gone- NSYNC\n",
      "\n",
      "hi my............. baby love  https://t.co/iI8D9kVLFQ\n",
      "\n",
      "Tonight: Taylor Lautner, @iamdiddy, music from @Weezer, and your #MyKidIsWeird tweets! #FallonTonight\n",
      "\n",
      "I can't believe it WOW this is my 6th Grammy!! I could never do this without amazing fans, always stay true to yourself I love you so much!\n",
      "\n",
      "\"Romeo save me, they're trying to tell me how to feel. This love is difficult but it's real. Don't be afraid we'll make it out of this mess\"\n",
      "\n",
      "I'm doing a live chat on Tuesday at 12:15 PM EST from YouTube! Go to\n",
      "youtube.com/selgomez to send questions or... http://fb.me/TACbcQuQ\n",
      "\n",
      "Pleased to be part of @SacoorBrosME family,a Portuguese brand where you can find the perfect look #PerfectMatch http://t.co/JLpYhYLjtO\n",
      "\n",
      "Yup. Yep. Yeah. Yes.\n",
      "“@theshadowboxers: HAPPY #COVERTUESDAY \n",
      "Here's Stevie's \"All In Love Is Fair\" \n",
      "http://t.co/oTx4h0svYK”\n",
      "\n",
      "Now the party's getting started! Black Joe Lewis is rockin the stage @theparishatx. #sxsw\n",
      "\n",
      "Has anyone ever told you that you look like a baby polar bear? http://t.co/nZSk41cyEA\n",
      "\n",
      "@amethystazaleas hilarious\n",
      "\n",
      "In silent screams,\n",
      "In wildest dreams,\n",
      "I never dreamed of this.\n",
      "\n",
      "http://t.co/JhUZG7ADJ4\n",
      "#taylurking \n",
      "#TS1989 http://t.co/CQBpnBKDMd\n",
      "\n",
      "God. Nobody is about Him.  https://t.co/hzswMoocqZ\n",
      "\n",
      "°₊·ˈ∗ #14daysTilFocus ∗ˈ‧₊° http://t.co/Ssd0ZnLXv1\n",
      "\n",
      "Fun show tonight: Vin Diesel, @carlreiner &amp; @kobebryant are here! Plus @IGGYAZALEA &amp; @IAMJHUD perform and more #surprises! #FallonTonightLA\n",
      "\n",
      "I knew I shouldn't have left you two alone together. https://t.co/MG1LL9oLWx\n",
      "\n",
      "Nuestro colegio @fpiesdescalzos en Cartagena. Shak http://t.co/n9Xypu0nLS\n",
      "\n",
      "@NickDeMoura all day\n",
      "\n",
      "Fun show tonight! http://t.co/xyroAV6MmV #FallonTonight\n",
      "\n",
      "CHECKING WITH @iTunesMusic TECH NOW. Hold your horses (hehehe) We'll be back in the next 5.\n",
      "\n",
      ":') https://t.co/dldAq5FVfa\n",
      "\n",
      "What do you think my next Castrol EDGE Tested to the Limit challenge should be? Send me your ideas using #castroledgecr7\n",
      "\n",
      "@chasebenz 👏👏\n",
      "\n",
      "If you like beautiful things may I suggest going to see the JAMES TURRELL Exhibition @LACMA! 📷 by @shannonwoodward http://t.co/w2yv3WZEWg\n",
      "\n",
      "“@ElvisDuranShow: We are playing it again! #EW @jimmyfallon @iamwill \n",
      "\n",
      "http://t.co/YkWkNxF4HE” yesssssss!!!!\n",
      "\n",
      "#tweet  #4MusicLFSNavy\n",
      "\n",
      "@imissMilfie 20 lbs!\n",
      "\n",
      "Don't get tripped up by misinformation. Join the @OFA Truth Team today: https://t.co/09BpA6F9Ne https://t.co/Nxgp87o4iq\n",
      "\n",
      "What happens when #GirlsTalkBoys? @5SOS has the answer → https://t.co/qMHHFPjw30 https://t.co/rVdQ0lo7D2\n",
      "\n",
      "Goodbye Vancouver. Hello Los Angeles. http://t.co/R0VQLIzXXk\n",
      "\n",
      ".@ChrissyTeigen told me about opening @Rihanna’s mail. I’ve alerted the authorities. https://t.co/1mnT2sIwnA\n",
      "\n",
      "@frattaloneee You got it, Corrina ❗️❗️❗️\n",
      "\n",
      "@Ajnavarro91 @iTunesMusic &lt;3\n",
      "\n",
      "INNER CIRCLE: CHRISSY TEIGEN https://t.co/Siv1EJaucP https://t.co/oKGoLw8F2a\n",
      "\n",
      "@jackmiller2909 but do you blame it? It's a pretty great ass..........\n",
      "\n",
      "Thank u all SO much for the kind words!! I'm so happy u guys are loving the song as much as I do! #PerfumePremiere\n",
      "\n",
      "Looks like I'm actually singing the song 😝💰💰💰🔫🔫🔫 #bitchbettahavemy... #demiworldtour https://t.co/8RfhQ5RGwi\n",
      "\n",
      "Mothers, crossdressers and women tending goats: daily life on Mumbai trains (via @scroll_in) https://t.co/Cr6eEANr2F\n",
      "\n",
      "Su primera salida oficial al Camp Nou, con gol de su papito! Shak http://t.co/yBDa44Y7\n",
      "\n",
      "Q&amp;A with @iTunesMusic in an hour!\n",
      "\n",
      "@ryanmorey98 Great! Did you enjoy it?\n",
      "\n",
      "El vídeo de Addicted To You está a punto de ser Certificado por @VEVO (100 millones) http://t.co/BBNX7OFfBc  ShakHQ #addictedcertified\n",
      "\n",
      "had the best time listening to / singing with JRB and Shoshana last night. sheesh. my ears! my heart!!!! @MrJasonRBrown @ShoshanaBean\n",
      "\n",
      "Meet the incredible 9-year-old who wears his imagination on his sleeve https://t.co/ix7pc9FDGS (via @BabbleEditors)\n",
      "\n",
      ". @TheBieberFever @billboard Not every time but, yeah I still do sometimes.\n",
      "\n",
      "We can't afford to let this be the new normal. https://t.co/nJzyfz2Zlw #ActOnClimate\n",
      "\n",
      "http://t.co/6W8KoRgt #R7\n",
      "\n",
      "Spending a quiet New Years Eve in with my boys and little miss @hannahspears. Let's hear some interesting resolutions for 2013?\n",
      "\n",
      "cute. https://t.co/4f1vM8fNHv #IntoYou https://t.co/BIzMt1yOQ5\n",
      "\n",
      "Don’t go chasin’ waterfalls. https://t.co/kYtTL6fBKT https://t.co/HGnfP2J7pW\n",
      "\n",
      "@crybabysbinky idk I miss him 😭😭😭\n",
      "\n",
      "Music fans alert: @Billboard's Twitter Real-Time Charts are #NowLive ♬ https://t.co/8eHRjGUbTo\n",
      "\n",
      "LIVE: President Obama and @FLOTUS discuss expanding efforts to help #LetGirlsLearn around the world. http://t.co/TfhhouKtpU\n",
      "\n",
      "“@rustyrockets: “ Played our craziest game of Word Sneak yet with the Russy B http://t.co/Bd8EgGOAJo #FallonTonight” I won.” Rematch?\n",
      "\n",
      "Shakira's speech from Friday's conference to promote Early Childhood Development policies with the private sector  http://t.co/jwBmNmYs SHQ\n",
      "\n",
      "Clear blue water... http://t.co/kiNNkBiQOQ\n",
      "\n",
      "Maria Sharapova's 2-year drug ban reduced to 15 months on appeal. She'll be back in time for 2017 French Open. https://t.co/m4DgVgUcUn\n",
      "\n",
      "Fighting climate change will save Americans money at the gas pump. #ActOnClimate https://t.co/ePl93jLYTU\n",
      "\n",
      "Tonight: @tylerperry, @abigailspencer, @vanmorrison, and it's #ThankYouNoteFriday!! #FallonTonight\n",
      "\n",
      "#CANTchella https://t.co/hEXCLMb3bv\n",
      "\n",
      "Avocado toast is only the beginning (via @extracrispy) https://t.co/BadGbxGPfZ\n",
      "\n",
      "Mama AfRIHca by @gnlstudios http://t.co/g2AuUrASip\n",
      "\n",
      "@aliciakeys, from your music to your global outlook, thank you for everything you've shared with us. #LoveTwitter https://t.co/8q71r8Pafd\n",
      "\n",
      "Family time is precious time and I'm enjoying it. http://t.co/LAPuHMaJWH http://t.co/2bByuHWDLg\n",
      "\n",
      "@IAmChaotic_ \"Stevie Wonder, Marvin Gaye, Nat King Cole, Nina Simone, Aretha Franklin.\" - @johnlegend\n",
      "\n",
      "Tonight: Playing Box of Lies with @heidiklum, plus David Oyelowo stops by and @carlyraejepsen performs! #FallonTonight\n",
      "\n",
      "#DIAMONDS Congratulations Anthony Mandler and thank you for putting your heart into another project with me! I'm so happy, I love my video\n",
      "\n",
      "Into the tidal flats off the coast of Zanzibar #TheWeekOnInstagram\n",
      "https://t.co/ZHqWqXh0Hd\n",
      "\n",
      "Some of my best times are with her, laughing in the kitchen. Happy Birthday to the ray of light that is @karliekloss! http://t.co/qmyfae5w8C\n",
      "\n",
      "The bill would have put millions of people on a path to citizenship and grown the economy by a cumulative $1.2 trillion. #ImmigrationAction\n",
      "\n",
      "Had a blast playing on #xfactorUSA. Also, @Ddlovato's hair looks SO good tonight.\n",
      "\n",
      "Stay informed. Stay engaged. Speak up. Join the @OFA Truth Team: https://t.co/b0eae4PXDX\n",
      "\n",
      "Shak's taking over @GooglePlayMusic’s account from around 5pm ET / 11pm CET today to celebrate the release of her @LoveRocks game! ShakHQ\n",
      "\n",
      "You’re welcome.  https://t.co/FzOj01Y8HV\n",
      "\n",
      "watch my London #777Tour show TONIGHT Mon Nov 19 on http://t.co/eBh6INel and @lifeandtimes @YouTube channel, 10:15pm GMT/5:15pm ET/2:15pm PT\n",
      "\n",
      "Congrats @VictoriaOB_ and @JonathanOB_! Here's to your next chapter! 👏 🎉\n",
      "https://t.co/mGWPKSrmgs\n",
      "\n",
      "Tonight http://t.co/4paDlBRFlS\n",
      "\n",
      "As Abraham Lincoln said, “You can’t believe everything you read on the Internet.\" Tweet me YOUR favorite #ReallyRealQuote. Hashtag contest!\n",
      "\n",
      "Police search for Tunisian man in his 20s in connection with Berlin market attack, German security official says.… https://t.co/D1eXRZv4KO\n",
      "\n",
      "@MyLifeIsSelG Thank you so much.\n",
      "\n",
      "@LGMonsterFacts Wish they printed complete quote I said 'Beyonce' is a wonderful moment for her, &amp; I'm happy to see her respected as an icon\n",
      "\n",
      "@FuseTV is airing my performance of \"A Year Without Rain\" from this year's Z100 Jingle Ball at Madison Square... http://fb.me/GlDsVWNu\n",
      "\n",
      "When you just tryna make it back home by Monday.... https://t.co/Go1G0dOkgx\n",
      "\n",
      "Congrats to Dan Wheldon, the WR racing team and everyone else who put in the hard work for this victory! Unreal!\n",
      "\n",
      "Hashtag game! Tweet out a funny/embarrassing injury that happened to you or someone you know &amp; tag w/ #mydumbinjury. Could be on our show!\n",
      "\n",
      "Feels so good to be home! Shot my album artwork for the next record today! Ah, I can't wait for yall to see/hear all the new stuff!\n",
      "\n",
      "THE BLEACHED BROWS https://t.co/pv9ZC5753H https://t.co/B1xCmXpsQs\n",
      "\n",
      "Best Country Song and Best Country Solo Performance. I'm floating. http://t.co/ofrSlXrQ\n",
      "\n",
      "Wow.... the lights just started flickering. #mynightingale #chills #imissyou\n",
      "\n",
      "RIP Spawn... 😔💔🕊\n",
      "\n",
      "Spending the whole day with my family :) \n",
      "Needed it\n",
      "\n",
      "Be honest, have you ever even once spelled Wednesday without silently sounding it out in your head wed-nes-day?\n",
      "\n",
      "Check out JT answering questions from fans about @_RunnerRunner? http://t.co/KSf19uZy3k. Countdown to the film release Oct 4th!! -teamJT\n",
      "\n",
      "Come out with your hands up. https://t.co/IZ6CJiemKj\n",
      "\n",
      "\"Across the country, there are people who are directly benefiting from the law and don't even know it.\" —President Obama\n",
      "\n",
      "i love you more https://t.co/lNc7xKZL95\n",
      "\n",
      "Congratulations Fazil Tarriche.You won 2 tickets to the Final, Brazil!Be the next, last chance http://t.co/sJfQpcsnOA http://t.co/u1g6YwUbB5\n",
      "\n",
      "Oh my goodness!!! The BIGGEST thank u from me &amp; all my teens. U all never cease to amaze me - love u! #ThankYouBritneyArmy\n",
      "\n",
      "Ever wished you could meet President Obama? Here's your chance. https://t.co/XCeXSFtCYg https://t.co/AeFMTtBdf9\n",
      "\n",
      "I love @RedOne_Official and @TheBandPerry thank you for the ammaazzzing new single! ❤️❤️ #LiveForever http://t.co/MKXDONaJdl 💜💜💜\n",
      "\n",
      "“Don’t touch my hair.” — @solangeknowles. https://t.co/cWQLII4CmP https://t.co/3Hi4TVS2C7\n",
      "\n",
      "almooosst https://t.co/6HobWZjNiu\n",
      "\n",
      "@iHeartRadio @BrunoMars SWOON. What a talent. &lt;3 #iHeartRadio\n",
      "\n",
      "@KKWPlanet Awww love you sweets!\n",
      "\n",
      "You have a little something in your hair. https://t.co/1p414tSS1P\n",
      "\n",
      "My friends and I brought everything we needed to make blueberry pancakes on our camping trip - except a frying pan. #UnhappyCamper\n",
      "\n",
      "Participate in this weekend’s hashtag project: #WHPvibrant https://t.co/t1Ed8L0jZ5 https://t.co/aWIcRDaujB\n",
      "\n",
      "Extreme knitting with @jacquifink https://t.co/w6eOLaTiOj https://t.co/T2gt8XvMkN\n",
      "\n",
      "Dwayne Johnson (@TheRock) and I have an Intense Staredown http://t.co/r2xg86soFV #FallonTonight\n",
      "\n",
      "1 person killed, 6 hurt when car bomb explodes outside the CARE NGO in Kabul. https://t.co/Ls2qMTzbYh\n",
      "\n",
      "Does this cat make my nose look big? https://t.co/dLa1Jc8usI\n",
      "\n",
      "Tonight: Doing something special w/Paul Rudd! Plus Hugh Dancy is here, stand-up from @jackwhitehall &amp; #ThankYouNoteFriday! #FallonTonight\n",
      "\n",
      "Almost @gwenysloco ... Almost. 😒 http://t.co/28Cb74HMfu\n",
      "\n",
      "My girl @bonniemckee is l👀king to break the Internet with a combo of this song and dat ass! 🍑#BombASStic🍑 http://t.co/wS6DEPZJvv\n",
      "\n",
      "iiii love u https://t.co/JBozbRLbXU\n",
      "\n",
      "#Tuesdayz http://t.co/4Q2BCABA\n",
      "\n",
      "Congrats @SteveMartinToGo. #Oscars\n",
      "\n",
      "Shot a fun tutorial today with @makeupbymario using only drug store products on my app! Download my app now! https://t.co/yXZlMRlo3l\n",
      "\n",
      "Get ‘er dune. https://t.co/a21su9dCal https://t.co/Oesn4cSUFV\n",
      "\n",
      "MONTERREY!!! General on-sale starts now! http://t.co/7Nk3mrxKVv #PRISMATICWORLDTOUR\n",
      "\n",
      "sweet dreams https://t.co/A8jf5tMCmt\n",
      "\n",
      "Sounds cliched, but we learn from everything good and bad. You have to have the bad to appreciate the good. #InTime @ericamendez\n",
      "\n",
      "\"Star Wars\" actress Carrie Fisher hospitalized after having cardiac event on flight, sources tell CNN.… https://t.co/e9lWxsVqah\n",
      "\n",
      "@etnow love that guy @Skrillex\n",
      "\n",
      "Now, THIS is cool... #RyderCup #I'makidinacandystore http://t.co/7WqAhYCT\n",
      "\n",
      "Check out my team's amazing performances from last nights #knockouts! #TeamShakira #Liveshowsherewecome  What do you all think? Shak\n",
      "\n",
      "Ganhe uma viagem de 5 dias a Paris para comemorar o lançamento do novo perfume da Shakira, Elixir! https://t.co/sS5MoVen\n",
      "ShakHQ\n",
      "\n",
      "My heart is with @KeshaRose. 💜\n",
      "\n",
      "There's a lot of misinformation out there—help spread the facts with the @OFA Truth Team: https://t.co/srdrvXgfKA https://t.co/MrkBKYeCnm\n",
      "\n",
      "MOMMY JEWERLY http://t.co/5ddcX2phBT http://t.co/JvI8Y8nkch\n",
      "\n",
      "So... A paparazzi can't get a photo of me so he kicks my best friend's truck door in..? And they wonder why they can't get a \"fair\" shake.\n",
      "\n",
      ". @brandonvmaxwell can this be our Christmas card. 😂💗 http://t.co/Ezl5K9HivC\n",
      "\n",
      "ALL 3 of my dogs 😉... they're my babies❤️❤️❤️ #PieceOfMeIsBack  https://t.co/o5BsEOlrvf\n",
      "\n",
      "There were 3.3 billion impressions of #Oscars Tweets. Read more:\n",
      "https://t.co/AOKHr4IoGB\n",
      "\n",
      "I just want to say thank you all for an amazing birthday week. The success of this album has been the greatest gift! http://t.co/AIF1Isw3LG\n",
      "\n",
      "Presidential candidate @BernieSanders​ is ready for his entrance onto my show.\n",
      "https://t.co/cxVVL68hzJ\n",
      "\n",
      "I sat down with Perez at his house to chat about A Year Without Rain, clothes, food and so much more! I had a... http://fb.me/ttGe6fzb\n",
      "\n",
      "Jam-packed #RunnerRunner premiere #LasVegas http://t.co/xtjSc2hR4H\n",
      "\n",
      "mm hmmm. and since we made that promise I've kept my word bb. 😇 https://t.co/q4W4cG2Ztv\n",
      "\n",
      "In the middle of one of my concerts. #askjt\n",
      "\n",
      "@mohammadsohaib3 You're welcome, Muhammad! Gotta keep things comfortable. 😎\n",
      "\n",
      "Helicopter on our way to a glacier! @SimonHuck @kourtneykardash https://t.co/e30xuuRAse\n",
      "\n",
      "I see you aiming at my pedestal... I betta letcha know... #SOLDOUT #STADIUMSTATUS http://t.co/8gUtyWoRn4\n",
      "\n",
      ".@serenawilliams sends @DudePerfect back to tennis camp. https://t.co/KTLNDxbR0O https://t.co/ol5Hh6CLQo\n",
      "\n",
      "French President Francois Hollande says he will not seek re-election amid low approval ratings of his time in offic… https://t.co/71cz8ZkPyb\n",
      "\n",
      "https://t.co/5CGEisTVa0\n",
      "\n",
      "#FACTS THE TRUTH ABOUT MY CRAZIEST HEADLINES https://t.co/ksqDkE9lUD https://t.co/tu29Ga7p1k\n",
      "\n",
      "Tower of TERROR. @Lockoir @D8Caitlynn @Scott_Myrick @D8Clarice @cd_henderson @Taeok_Lee @mase_cut @amandacleghorn http://t.co/Qmz5gK0mCu\n",
      "\n",
      "This morning I had a bran muffin. It may have been blueberry. It was like a blueberry muffin without berries. &amp; a glaze. It was a cupcake.\n",
      "\n",
      "Tonight: the second of the US presidential #debates is streaming LIVE on Twitter. Watch here at 8:30pm ET. ⬇️\n",
      "https://t.co/l2fPw8j3O6\n",
      "\n",
      "Another win for the team. Hala Madrid! http://t.co/0KXHVqgC1X\n",
      "\n",
      "@headfirsts I heart you soooo much more :)\n",
      "\n",
      "#GOUSA Congrats to all the Olympians of 2012!!!\n",
      "\n",
      "The history of an internet cafe, from a time when people said “wait, what’s email?” https://t.co/KIoGvtQiPG https://t.co/hNpUxUDJCP\n",
      "\n",
      "welcome RT @RiverViiperi Really excited to go to #yankeestadium tomorrow @realmadrid vs #ACmilan w/ @justinhopwood_ … http://t.co/dxXJdLcZ\n",
      "\n",
      "Paul Ryan expresses confidence in electoral system in apparent rebuke to Trump's claim that election is 'rigged.' https://t.co/mwY7idGAlD\n",
      "\n",
      ". @MrRPMurphy The world is about to see your masterpiece! I love you! ( and I'm gonna be AN ACTRESS IN 40 minutes on the screen mom!)❤️🔪\n",
      "\n",
      "Turkey disbanding elite presidential guard unit after attempted coup, Prime Minister says. https://t.co/Oa4sUdmx11\n",
      "\n"
     ]
    }
   ],
   "source": [
    "random_poster = random.choice(top100)\n",
    "\n",
    "result = conn.query(f\"MATCH (u:User {{name: '{random_poster['b']['name']}'}})-[:POSTED]->(t:Tweet) RETURN t\")\n",
    "for tweet in result:\n",
    "    print(tweet['t']['content'])\n",
    "    print(\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Top 100 User mit den meisten Followern"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "user67743 hat 3383 Follower\n",
      "user71598 hat 3216 Follower\n",
      "user72657 hat 2735 Follower\n",
      "user3062 hat 2647 Follower\n",
      "user30726 hat 2471 Follower\n",
      "user60330 hat 2462 Follower\n",
      "user38541 hat 2133 Follower\n",
      "user59038 hat 2074 Follower\n",
      "user30474 hat 1905 Follower\n",
      "user37396 hat 1707 Follower\n",
      "user35169 hat 1632 Follower\n",
      "user19729 hat 1591 Follower\n",
      "user26715 hat 1521 Follower\n",
      "user64934 hat 1503 Follower\n",
      "user14889 hat 1500 Follower\n",
      "user2852 hat 1410 Follower\n",
      "user1938 hat 1402 Follower\n",
      "user11439 hat 1370 Follower\n",
      "user3994 hat 1337 Follower\n",
      "user40506 hat 1315 Follower\n",
      "user56924 hat 1273 Follower\n",
      "user23506 hat 1255 Follower\n",
      "user57335 hat 1231 Follower\n",
      "user5121 hat 1214 Follower\n",
      "user44896 hat 1201 Follower\n",
      "user4986 hat 1198 Follower\n",
      "user4367 hat 1186 Follower\n",
      "user65733 hat 1167 Follower\n",
      "user76352 hat 1154 Follower\n",
      "user68912 hat 1123 Follower\n",
      "user41967 hat 1120 Follower\n",
      "user47151 hat 1108 Follower\n",
      "user28248 hat 1098 Follower\n",
      "user71330 hat 1088 Follower\n",
      "user30325 hat 1072 Follower\n",
      "user18749 hat 1070 Follower\n",
      "user48664 hat 1059 Follower\n",
      "user63808 hat 1053 Follower\n",
      "user31249 hat 1047 Follower\n",
      "user59878 hat 1036 Follower\n",
      "user58811 hat 1022 Follower\n",
      "user67807 hat 1016 Follower\n",
      "user51433 hat 1014 Follower\n",
      "user59804 hat 992 Follower\n",
      "user37693 hat 989 Follower\n",
      "user45841 hat 977 Follower\n",
      "user66671 hat 957 Follower\n",
      "user3742 hat 928 Follower\n",
      "user35607 hat 920 Follower\n",
      "user52733 hat 915 Follower\n",
      "user9544 hat 915 Follower\n",
      "user35141 hat 913 Follower\n",
      "user34051 hat 911 Follower\n",
      "user31488 hat 900 Follower\n",
      "user38986 hat 894 Follower\n",
      "user55654 hat 889 Follower\n",
      "user60304 hat 884 Follower\n",
      "user34623 hat 865 Follower\n",
      "user50436 hat 859 Follower\n",
      "user71298 hat 852 Follower\n",
      "user64402 hat 852 Follower\n",
      "user10640 hat 844 Follower\n",
      "user65114 hat 839 Follower\n",
      "user36279 hat 831 Follower\n",
      "user7474 hat 818 Follower\n",
      "user9630 hat 813 Follower\n",
      "user45699 hat 793 Follower\n",
      "user19703 hat 786 Follower\n",
      "user1948 hat 784 Follower\n",
      "user51528 hat 778 Follower\n",
      "user80736 hat 761 Follower\n",
      "user69471 hat 754 Follower\n",
      "user70632 hat 750 Follower\n",
      "user35182 hat 750 Follower\n",
      "user26413 hat 750 Follower\n",
      "user31802 hat 749 Follower\n",
      "user4154 hat 747 Follower\n",
      "user15220 hat 743 Follower\n",
      "user25721 hat 743 Follower\n",
      "user50124 hat 738 Follower\n",
      "user46282 hat 737 Follower\n",
      "user31858 hat 736 Follower\n",
      "user74831 hat 736 Follower\n",
      "user30574 hat 735 Follower\n",
      "user71606 hat 732 Follower\n",
      "user42434 hat 731 Follower\n",
      "user16393 hat 730 Follower\n",
      "user45948 hat 728 Follower\n",
      "user12174 hat 714 Follower\n",
      "user66465 hat 712 Follower\n",
      "user15480 hat 710 Follower\n",
      "user13940 hat 709 Follower\n",
      "user49106 hat 697 Follower\n",
      "user43783 hat 683 Follower\n",
      "user38975 hat 679 Follower\n",
      "user66052 hat 672 Follower\n",
      "user52436 hat 672 Follower\n",
      "user33984 hat 669 Follower\n",
      "user48090 hat 666 Follower\n",
      "user54647 hat 665 Follower\n"
     ]
    }
   ],
   "source": [
    "top100 = conn.query(\"MATCH (a)-[:FOLLOWS]->(b) RETURN b, COUNT(a) as followers ORDER BY followers DESC LIMIT 100\")\n",
    "\n",
    "for user in top100:\n",
    "    print(user['b']['name'], \"hat\", user['followers'], \"Follower\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3. Top 100 User, die den meisten Usern der Top 100 folgen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"MATCH (follower:User)-[follows:FOLLOWS]->(followed:User)\n",
    "WHERE followed.userId IN [\"\"\" \n",
    "\n",
    "count = 0\n",
    "for user in top100:\n",
    "    query += f\"'{user['b']['userId']}'\"\n",
    "    if count < 99: query += \",\"\n",
    "    count += 1\n",
    "\n",
    "query += \"\"\"]\n",
    "WITH follower, COUNT(follows) AS numFollowed\n",
    "ORDER BY numFollowed DESC\n",
    "RETURN follower.name AS username, numFollowed\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "result = conn.query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "user30474 folgt 69 Usern\n",
      "user25721 folgt 55 Usern\n",
      "user735 folgt 50 Usern\n",
      "user50432 folgt 49 Usern\n",
      "user28248 folgt 47 Usern\n",
      "user16364 folgt 46 Usern\n",
      "user13760 folgt 44 Usern\n",
      "user29386 folgt 41 Usern\n",
      "user9913 folgt 40 Usern\n",
      "user42307 folgt 39 Usern\n",
      "user43513 folgt 38 Usern\n",
      "user58519 folgt 38 Usern\n",
      "user65949 folgt 37 Usern\n",
      "user21107 folgt 37 Usern\n",
      "user52394 folgt 37 Usern\n",
      "user45163 folgt 36 Usern\n",
      "user21975 folgt 35 Usern\n",
      "user59631 folgt 35 Usern\n",
      "user58811 folgt 35 Usern\n",
      "user31292 folgt 35 Usern\n",
      "user1489 folgt 34 Usern\n",
      "user47150 folgt 34 Usern\n",
      "user38986 folgt 34 Usern\n",
      "user40978 folgt 34 Usern\n",
      "user49162 folgt 34 Usern\n",
      "user7739 folgt 34 Usern\n",
      "user19703 folgt 33 Usern\n",
      "user38975 folgt 33 Usern\n",
      "user19729 folgt 33 Usern\n",
      "user45948 folgt 33 Usern\n",
      "user23925 folgt 31 Usern\n",
      "user46002 folgt 31 Usern\n",
      "user57612 folgt 31 Usern\n",
      "user14998 folgt 31 Usern\n",
      "user40958 folgt 31 Usern\n",
      "user26549 folgt 30 Usern\n",
      "user44896 folgt 30 Usern\n",
      "user76341 folgt 30 Usern\n",
      "user33997 folgt 30 Usern\n",
      "user77697 folgt 30 Usern\n",
      "user27910 folgt 30 Usern\n",
      "user56504 folgt 29 Usern\n",
      "user68922 folgt 29 Usern\n",
      "user70632 folgt 29 Usern\n",
      "user229 folgt 29 Usern\n",
      "user44000 folgt 29 Usern\n",
      "user10551 folgt 29 Usern\n",
      "user31893 folgt 28 Usern\n",
      "user13274 folgt 28 Usern\n",
      "user41967 folgt 28 Usern\n",
      "user61354 folgt 28 Usern\n",
      "user55654 folgt 28 Usern\n",
      "user55641 folgt 28 Usern\n",
      "user31081 folgt 28 Usern\n",
      "user51528 folgt 27 Usern\n",
      "user29674 folgt 27 Usern\n",
      "user43728 folgt 27 Usern\n",
      "user33720 folgt 27 Usern\n",
      "user16553 folgt 27 Usern\n",
      "user1938 folgt 27 Usern\n",
      "user29794 folgt 27 Usern\n",
      "user66306 folgt 27 Usern\n",
      "user25589 folgt 27 Usern\n",
      "user49518 folgt 27 Usern\n",
      "user13804 folgt 27 Usern\n",
      "user12832 folgt 27 Usern\n",
      "user66671 folgt 26 Usern\n",
      "user78253 folgt 26 Usern\n",
      "user16001 folgt 26 Usern\n",
      "user2545 folgt 26 Usern\n",
      "user27722 folgt 26 Usern\n",
      "user65945 folgt 26 Usern\n",
      "user51433 folgt 26 Usern\n",
      "user23655 folgt 26 Usern\n",
      "user32519 folgt 26 Usern\n",
      "user72262 folgt 26 Usern\n",
      "user60713 folgt 26 Usern\n",
      "user2230 folgt 25 Usern\n",
      "user59134 folgt 25 Usern\n",
      "user34981 folgt 25 Usern\n",
      "user32679 folgt 25 Usern\n",
      "user15205 folgt 25 Usern\n",
      "user8695 folgt 25 Usern\n",
      "user76318 folgt 25 Usern\n",
      "user6710 folgt 25 Usern\n",
      "user9424 folgt 25 Usern\n",
      "user77520 folgt 25 Usern\n",
      "user54465 folgt 25 Usern\n",
      "user21579 folgt 25 Usern\n",
      "user62528 folgt 25 Usern\n",
      "user19436 folgt 25 Usern\n",
      "user34367 folgt 25 Usern\n",
      "user14141 folgt 25 Usern\n",
      "user30574 folgt 24 Usern\n",
      "user29865 folgt 24 Usern\n",
      "user52964 folgt 24 Usern\n",
      "user76707 folgt 24 Usern\n",
      "user80964 folgt 24 Usern\n",
      "user4320 folgt 24 Usern\n",
      "user37034 folgt 24 Usern\n"
     ]
    }
   ],
   "source": [
    "for record in result:\n",
    "    print(record['username'], \"folgt\", record['numFollowed'], 'Usern')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4. Informationen für persönliche Startseite eines zufälligen Users (der Top 100 mit den meisten Followern)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "random_user = random.choice(top100)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1. Anzahl der Follower"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1214\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(f\"MATCH (follower:User)-[:FOLLOWS]->(user:User {{name: '{random_user['b']['name']}'}}) RETURN count(follower) AS followerCount\")\n",
    "print(result[0]['followerCount'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2. Anzahl der verfolgten Accounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "62\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(f\"MATCH (user:User {{name: '{random_user['b']['name']}'}})-[:FOLLOWS]->(followed:User) RETURN count(followed) AS followedCount\")\n",
    "print(result[0]['followedCount'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 3.1 Die 25 meistgeliketen Posts der verfolgten Accounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Trump offers retired Army Lt. Gen. Michael Flynn the role of national security adviser, transition official says… https://t.co/SHS0UjuhUt\n",
      "Likes:  112\n",
      "\n",
      "You won't want to miss a second of Premiere Week. Season 13 starts today. http://t.co/lLQpzpSN51\n",
      "Likes:  109\n",
      "\n",
      "Randy Jackson's leaving “American Idol.\" Said he wanted to go out when the show was on top, but decided to wait another 7 years. #fallonmono\n",
      "Likes:  109\n",
      "\n",
      "@HolyErotica coming next week BUB\n",
      "Likes:  106\n",
      "\n",
      "HOW TO WEAR OLYMPIC SIVER METALS https://t.co/hGcyAXkcix\n",
      "Likes:  104\n",
      "\n",
      "Congrats Whitney on making homecoming court, you deserve it.\n",
      "http://t.co/E2g8iLPd\n",
      "Likes:  104\n",
      "\n",
      "http://t.co/amRS3wkAIG\n",
      "Likes:  104\n",
      "\n",
      "Dublin... You sang beautifully and you danced your asses off. What a special night. Thanks for having… http://t.co/aqjslHFDwf\n",
      "Likes:  103\n",
      "\n",
      "I'm proud being named as the top player of the http://t.co/z55vCy1G 50. Thank you http://t.co/0mq6fNNp\n",
      "Likes:  103\n",
      "\n",
      "http://t.co/C1OGbgDdLv\n",
      "Likes:  101\n",
      "\n",
      "Add your name to let the Senate know: The Supreme Court is too important to be held hostage by partisan politics. https://t.co/jPIEbRS7ig\n",
      "Likes:  101\n",
      "\n",
      "goodnight https://t.co/0LId7b1K97\n",
      "Likes:  101\n",
      "\n",
      "Toulouse's thoughts narrated by @jonescrow #tb https://t.co/HktpieyUIb\n",
      "Likes:  101\n",
      "\n",
      "Good Girl Gone Bad #Complex #cover3 http://t.co/TiFiMF3O\n",
      "Likes:  101\n",
      "\n",
      "@scottkardashx happy birthday!!!!!! Xo\n",
      "Likes:  100\n",
      "\n",
      "@LotteyRoseLDN It was lovely. How was yours? xo\n",
      "Likes:  100\n",
      "\n",
      "https://t.co/nYGJ13R0CJ\n",
      "Likes:  100\n",
      "\n",
      "Ginger-Bae and Ginger-Boo \"taking care of business\" before the 🎉🎅🏻🎄 https://t.co/8fCcsmiNvQ https://t.co/EQ7QuirKm9\n",
      "Likes:  99\n",
      "\n",
      "Get your camera ready—this is your chance to meet President Obama. Enter now: http://t.co/0oV4SDhmTC http://t.co/RSAOEK6By5\n",
      "Likes:  99\n",
      "\n",
      "Could you describe color to a blind person? https://t.co/vldXGuowC0 https://t.co/V5EGMunFNA\n",
      "Likes:  99\n",
      "\n",
      "I'm loving that the windows jn Chanel are very 'Cheek To Cheek'! Love you Karl et ma petite Choupette! 😽 http://t.co/xD1TCg8Nsi\n",
      "Likes:  98\n",
      "\n",
      "Awwww thank you so much!  https://t.co/MgowcpxM5s\n",
      "Likes:  98\n",
      "\n",
      "#PrayForSyria watch this and think like a child. When love and the answer is so simple. https://t.co/rEK2O5rCUB\n",
      "Likes:  98\n",
      "\n",
      "#ARTPOPMemories Me &amp; the sensational R Kelly turning up the Oval Office, Doing What We Want, no matter what they say. http://t.co/nTAvA7kSk4\n",
      "Likes:  98\n",
      "\n",
      "#cannesfilmfestival https://t.co/IGUCBepNDR\n",
      "Likes:  98\n",
      "\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(f\"\"\"\n",
    "MATCH (follower:User)-[:FOLLOWS]->(followed:User)-[:POSTED]->(tweet:Tweet)\n",
    "WHERE follower.name = '{random_user['b']['name']}'\n",
    "WITH follower, collect(followed.name) AS followedUsers\n",
    "MATCH (t:Tweet)<-[:POSTED]-(u:User)\n",
    "WHERE u.name IN followedUsers\n",
    "OPTIONAL MATCH (t)<-[:LIKES]-(liker:User)\n",
    "RETURN t.content AS content, COUNT(liker) AS numLikes\n",
    "ORDER BY numLikes DESC\n",
    "LIMIT 25\n",
    "\"\"\")\n",
    "\n",
    "for tweet in result:\n",
    "    print(tweet['content'])\n",
    "    print(\"Likes: \", tweet['numLikes'])\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 3.2 Die 25 neuesten Posts der verfolgten Accounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Our family group chat about our 2016 goals is giving me life!!!! #WatchOutWorld\n",
      "Getweeted am:  31/12/2015 20:44\n",
      "\n",
      "Filmmaker @FinalCutKing’s Halloween tricks result in hilariously delightful treats https://t.co/DWFz4Diu7l https://t.co/DDgEMilChw\n",
      "Getweeted am:  31/10/2015 20:40\n",
      "\n",
      "Kristen, thank u for sharing ur story w me :) Keep up the good work girl! Hope to see u in Vegas!! #WorkBxxCH XO http://t.co/aEu8bm5ycL\n",
      "Getweeted am:  31/10/2013 01:58\n",
      "\n",
      "They just told me Red sold 1.2 million albums first week. How is this real life?! You are UNREAL. I love you so much. Thanks a million ;)\n",
      "Getweeted am:  31/10/2012 00:29\n",
      "\n",
      "Have u seen the official video yet for #WhatDoYouMean? http://t.co/kuntEnaDNe\n",
      "Getweeted am:  31/08/2015 14:08\n",
      "\n",
      "Blue water, rocky coast – California dreamin'. #TravelTuesday\n",
      "https://t.co/UIYeA6xzOl\n",
      "Getweeted am:  31/05/2016 21:29\n",
      "\n",
      "No se pierdan #LaBicicleta - el nuevo sencillo de @CarlosVives y Shak - ya disponible en descarga y stream! ShakHQ🚲\n",
      "https://t.co/oBtzP6iVng\n",
      "Getweeted am:  31/05/2016 18:53\n",
      "\n",
      "Congrats to the graduates! I loved when I got to speak to the Tulane grads. I'm sure by now you’re all millionaires. http://t.co/VYVGvFgyvI\n",
      "Getweeted am:  31/05/2015 20:32\n",
      "\n",
      "“@jjul_lynn: @jimmyfallon #candydecisions M&amp;M's or Reese's Pieces?!” M&amp;MS #squaredance\n",
      "Getweeted am:  31/05/2014 13:55\n",
      "\n",
      "@i_D 👀bb\n",
      "Getweeted am:  31/05/2014 03:35\n",
      "\n",
      "@KingJames LeBron when I grow up I want to be like you! Big fan!!\n",
      "Getweeted am:  31/01/2014 16:14\n",
      "\n",
      "Pit stop in dallas... @pmdeleon and the fam brought me food. Needed this badly.\n",
      "Ready south America??! http://plixi.com/p/73689823\n",
      "Getweeted am:  31/01/2011 01:24\n",
      "\n",
      "Break free. Add a profile photo to show the world who you really are. #TwitterTips\n",
      "https://t.co/1SZQnuIxhm\n",
      "Getweeted am:  30/12/2015 23:30\n",
      "\n",
      "I miss New Orleans. I am def coming back. I will make it a bounce back goal. When I reach my goal. I will be back and eat some beignets!!!\n",
      "Getweeted am:  30/11/2015 02:24\n",
      "\n",
      "This is why reform matters: Health care should be available when you need it. http://t.co/pwiHZxEsF4 http://t.co/8YRFejM868\n",
      "Getweeted am:  30/10/2014 16:07\n",
      "\n",
      "@EnigmaPopstar2 family things :) ❤️ JOANNE is a family thing :) I have thought about this\n",
      "Getweeted am:  30/09/2016 19:23\n",
      "\n",
      "Happy #YoureWelcomeWednesday http://t.co/b2W5gdKO77\n",
      "Getweeted am:  30/09/2015 21:26\n",
      "\n",
      "El video de #LaBicicleta ya tiene 150m de reproducciones! https://t.co/H8LiEMR8bW ShakHQ 🚴 CC: @carlosvives https://t.co/vpaVS1MgDC\n",
      "Getweeted am:  30/08/2016 14:54\n",
      "\n",
      "If you’re as outraged as I am about Cecil the lion, let’s do something. Help the Humane Society protect African lions http://t.co/Rk7nVGaJyN\n",
      "Getweeted am:  30/07/2015 21:40\n",
      "\n",
      "You like the new #TakeBackTN video w/ JT in NYC?! Turn up the volume, dance to it, share it, repeat: http://t.co/TbBeZycpHp -teamJT\n",
      "Getweeted am:  30/07/2013 20:11\n",
      "\n",
      "Shaping mini masterpieces with Salavat Fidai https://t.co/5ov390bpGj\n",
      "Getweeted am:  30/06/2016 18:15\n",
      "\n",
      "You asked: Can you say Hi? I'm your fan #1. I dream of seeing you again someday. Greetings from Paraguay http://t.co/abEu45BUdB\n",
      "Getweeted am:  30/06/2014 13:27\n",
      "\n",
      "He’s about that hug lyfe. https://t.co/j0Vd6V06z9 https://t.co/Be8QoRD0rK\n",
      "Getweeted am:  30/05/2016 15:00\n",
      "\n",
      "Discover music on Twitter http://t.co/SybWPkLs\n",
      "Getweeted am:  30/05/2012 16:36\n",
      "\n",
      "@shannonwoodward I hear you, dork\n",
      "Getweeted am:  30/03/2013 08:02\n",
      "\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(f\"\"\"\n",
    "MATCH (follower:User)-[:FOLLOWS]->(followed:User)-[:POSTED]->(tweet:Tweet)\n",
    "WHERE follower.name = '{random_user['b']['name']}'\n",
    "WITH follower, collect(followed.name) AS followedUsers\n",
    "MATCH (t:Tweet)<-[:POSTED]-(u:User)\n",
    "WHERE u.name IN followedUsers\n",
    "RETURN t.content AS content, t.date_time AS date\n",
    "ORDER BY t.date_time DESC\n",
    "LIMIT 25\n",
    "\"\"\")\n",
    "\n",
    "for tweet in result:\n",
    "    print(tweet['content'])\n",
    "    print(\"Getweeted am: \", tweet['date'])\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 4. Erstellung eines neuen Posts: Herstellen einer Cashing-Beziehung bei allen Followern"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "52542\n"
     ]
    }
   ],
   "source": [
    "num_tweets = conn.query(\"MATCH (t:Tweet) RETURN COUNT(t)\")[0]['COUNT(t)']\n",
    "print(num_tweets)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "tweet = {\n",
    "    \"tweetId\": str(num_tweets+1),\n",
    "    \"content\": \"Doing neo4j queries right now #BDEA\",\n",
    "    \"date_time\": \"18/06/2023 09:48\",\n",
    "    \"language\": \"en\"\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Tweet importieren"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "new_tweet = conn.query(f\"CREATE (t:Tweet {{tweetId: '{tweet['tweetId']}', content: '{tweet['content']}', date_time: '{tweet['date_time']}', language: '{tweet['language']}'}}) RETURN t\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record t=<Node id=133849 labels=frozenset({'Tweet'}) properties={'date_time': '18/06/2023 09:48', 'language': 'en', 'tweetId': '52543', 'content': 'Doing neo4j queries right now #BDEA'}>>]\n"
     ]
    }
   ],
   "source": [
    "print(new_tweet)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### POSTED-Beziehung herstellen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query(f\"MATCH (user:User {{userId: '{random_user['b']['userId']}'}}) MATCH (tweet:Tweet {{tweetId: '{new_tweet[0]['t']['tweetId']}'}}) CREATE (user)-[:POSTED]->(tweet)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### CACHED-Beziehung bei allen Followern des Posters herstellen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1214\n"
     ]
    }
   ],
   "source": [
    "followers = conn.query(f\"MATCH (follower:User)-[:FOLLOWS]->(user:User {{userId: '{random_user['b']['userId']}'}}) RETURN follower\")\n",
    "print(len(followers))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14230524\n"
     ]
    }
   ],
   "source": [
    "print(random_user['b']['userId'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [],
   "source": [
    "for follower in followers:\n",
    "    conn.query(f\"MATCH (user:User {{userId: '{follower['follower']['userId']}'}}) MATCH (tweet:Tweet {{tweetId: '{new_tweet[0]['t']['tweetId']}'}}) CREATE (user)-[:CACHED]->(tweet)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Check how many users have the tweet cached (should be the same as number followers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record COUNT(u)=1214>]"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query(\"MATCH (u:User)-[r:CACHED]->(tweet:Tweet {tweetId: '52543'}) RETURN COUNT(u)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 5. Die 25 beliebtesten Tweets, welche die Wörter \"hello\" und \"from\" enthalten"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "You asked: Hi Ronaldo! I love you so much! Please say hello to me! I am from Turkey!  http://t.co/xpDH5Ppb67\n",
      "Likes:  219\n",
      "\n",
      "You asked: \n",
      "Hello from Japan!\n",
      "I'm Anna!I I'm a big fan! Please say me hello Anna!\n",
      " http://t.co/5Oyi7SiUhY\n",
      "Likes:  208\n",
      "\n",
      "You asked: hello from morocco \n",
      " http://t.co/gbuEyP5953\n",
      "Likes:  144\n",
      "\n",
      "#JoanneVibes say hello from backstage at...??? https://t.co/m9PI2oUUo8\n",
      "Likes:  112\n",
      "\n",
      "Say hello to Himanshu Yadav and all my friends from #India. I will come shortly with more news. http://t.co/60xEW67c\n",
      "Likes:  78\n",
      "\n",
      "Why did @Adele cross the road? She wanted to say hello from the other side.\n",
      "Likes:  75\n",
      "\n",
      "You asked: Can you say hello to me?  My name is Narin and I am from Germany http://t.co/lx2CRb3xwh\n",
      "Likes:  75\n",
      "\n",
      "You asked: hello from France, champion ! :) im so proud of you http://t.co/AhDl5iMGzF\n",
      "Likes:  69\n",
      "\n",
      "You asked: Can you say hello to me ,please? I am from Bulgaria!!! http://t.co/dyNj55sAq4\n",
      "Likes:  57\n",
      "\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(\"\"\"\n",
    "MATCH (t:Tweet)\n",
    "WHERE ALL(word IN [' hello ', ' from '] WHERE t.content CONTAINS word)\n",
    "WITH t\n",
    "MATCH (t)<-[:LIKES]-(liker:User)\n",
    "RETURN t.content AS content, COUNT(liker) AS numLikes\n",
    "ORDER BY numLikes DESC\n",
    "LIMIT 25\n",
    "\"\"\")\n",
    "\n",
    "for tweet in result:\n",
    "    print(tweet['content'])\n",
    "    print(\"Likes: \", tweet['numLikes'])\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
