{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Creating CREATE File from Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: neo4j in /opt/conda/lib/python3.11/site-packages (5.9.0)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.11/site-packages (from neo4j) (2023.3)\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import random\n",
    "import csv"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = Neo4jConnection(uri=\"bolt://graph_db:7687\", user=\"neo4j\", pwd=\"password\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "follows_file = open('twitter_combined.txt', 'r')\n",
    "lines = follows_file.readlines()\n",
    "\n",
    "follows = []\n",
    "users = set()\n",
    "for line in lines:\n",
    "    line = line.replace('\\n','')\n",
    "    id1, id2 = line.split(' ')\n",
    "    users.add(id1)\n",
    "    users.add(id2)\n",
    "    follows.append([id1, id2])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "tweets = pd.read_csv(\"tweets.csv\")\n",
    "f = open(\"import/tweetsDB.csv\", \"w\")\n",
    "writer = csv.writer(f)\n",
    "writer.writerow([\"tweetId:ID\",\"content\",\"date_time\",\"language\",\":Label\"])\n",
    "count = 1\n",
    "for index, tweet in tweets.iterrows():\n",
    "    writer.writerow([count,tweet[\"content\"],tweet[\"date_time\"],tweet[\"language\"],\"TWEET\"])\n",
    "    count += 1\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "count = 0\n",
    "f = open(\"import/users.csv\", \"w\")\n",
    "f.write(\"userId:ID,name,:Label\\n\")\n",
    "for user in users:\n",
    "   f.write(user + \",user\" + str(count) + \",USER\\n\")\n",
    "   count += 1\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "f = open(\"import/follows.csv\", \"w\")\n",
    "f.write(\":START_ID,:END_ID,:TYPE\\n\")\n",
    "for follow in follows:\n",
    "    f.write(follow[0] + \",\" + follow[1] + \",FOLLOWS\\n\")\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "top100 = conn.query(\"MATCH (a)-[:FOLLOWS]->(b) RETURN b, COUNT(a) as followers ORDER BY followers DESC LIMIT 100\")\n",
    "user_ids = []\n",
    "for record in top100:\n",
    "    user_ids.append(record.get(\"b\").get(\"userId\"))\n",
    "\n",
    "tweets = pd.read_csv(\"import/tweetsDB.csv\")\n",
    "f = open(\"posted.csv\", \"w\")\n",
    "f.write(\":UserID,:TweetID,:TYPE\\n\")\n",
    "for index, tweet in tweets.iterrows():\n",
    "    f.write(f'{random.choice(user_ids)},{tweet[\"tweetId:ID\"]},POSTED\\n')\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Query failed: {code: Neo.TransientError.General.MemoryPoolOutOfMemoryError} {message: The allocation of an extra 2.0 MiB would use more than the limit 1.4 GiB. Currently using 1.4 GiB. dbms.memory.transaction.total.max threshold reached}\n"
     ]
    }
   ],
   "source": [
    "conn.query(f\"MATCH (n:USER) WITH n LIMIT 50000 DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[]\n"
     ]
    }
   ],
   "source": [
    "response = conn.query(\"MATCH (n:USER) RETURN n LIMIT 1\")\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///users.csv' AS row CREATE (:User {userId: row.userId, name: row.name})\")\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///tweetsDB.csv' AS row CREATE (:Tweet {tweetId: row.tweetId, content: row.content, date_time: row.date_time, language: row.language})\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record labels=['USER']>]\n"
     ]
    }
   ],
   "source": [
    "response = conn.query(\"MATCH (n) RETURN DISTINCT labels(n) as labels\")\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 100 Users with most followers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "user35027 :  8660\n",
      "user54813 :  7700\n",
      "user2152 :  7623\n",
      "user34088 :  7558\n",
      "user72268 :  4798\n",
      "user8424 :  4337\n",
      "user73919 :  3986\n",
      "user28899 :  3850\n",
      "user50223 :  3712\n",
      "user31553 :  3655\n",
      "user30954 :  3623\n",
      "user47453 :  3255\n",
      "user47156 :  3197\n",
      "user62060 :  3172\n",
      "user3125 :  2974\n",
      "user59409 :  2904\n",
      "user13601 :  2874\n",
      "user49733 :  2858\n",
      "user61763 :  2725\n",
      "user58494 :  2693\n",
      "user40363 :  2680\n",
      "user48585 :  2678\n",
      "user69861 :  2634\n",
      "user74702 :  2593\n",
      "user60959 :  2560\n",
      "user69512 :  2539\n",
      "user22616 :  2425\n",
      "user32642 :  2399\n",
      "user51781 :  2356\n",
      "user75560 :  2346\n",
      "user42050 :  2342\n",
      "user79112 :  2317\n",
      "user42152 :  2291\n",
      "user14006 :  2241\n",
      "user4659 :  2238\n",
      "user44411 :  2209\n",
      "user62704 :  2208\n",
      "user26782 :  2122\n",
      "user68089 :  2095\n",
      "user43796 :  2083\n",
      "user37826 :  2073\n",
      "user6074 :  2069\n",
      "user4368 :  2031\n",
      "user78988 :  2014\n",
      "user13875 :  1981\n",
      "user26124 :  1927\n",
      "user44994 :  1897\n",
      "user1138 :  1862\n",
      "user27660 :  1821\n",
      "user11241 :  1799\n",
      "user42159 :  1775\n",
      "user54601 :  1774\n",
      "user63984 :  1763\n",
      "user41718 :  1752\n",
      "user58597 :  1742\n",
      "user77403 :  1725\n",
      "user8908 :  1718\n",
      "user25209 :  1710\n",
      "user44083 :  1696\n",
      "user27385 :  1674\n",
      "user22744 :  1668\n",
      "user58887 :  1665\n",
      "user24523 :  1657\n",
      "user14493 :  1656\n",
      "user50130 :  1625\n",
      "user17459 :  1600\n",
      "user42306 :  1591\n",
      "user35116 :  1568\n",
      "user57497 :  1567\n",
      "user27799 :  1559\n",
      "user2069 :  1550\n",
      "user48923 :  1536\n",
      "user19961 :  1529\n",
      "user29476 :  1528\n",
      "user39089 :  1524\n",
      "user18306 :  1520\n",
      "user51858 :  1496\n",
      "user39223 :  1493\n",
      "user8327 :  1491\n",
      "user76611 :  1480\n",
      "user405 :  1479\n",
      "user6357 :  1479\n",
      "user41050 :  1472\n",
      "user48646 :  1467\n",
      "user53494 :  1439\n",
      "user47278 :  1437\n",
      "user79144 :  1426\n",
      "user50434 :  1411\n",
      "user12263 :  1406\n",
      "user64011 :  1405\n",
      "user35684 :  1402\n",
      "user7161 :  1399\n",
      "user46450 :  1396\n",
      "user53393 :  1395\n",
      "user55805 :  1391\n",
      "user8756 :  1385\n",
      "user72049 :  1381\n",
      "user77623 :  1378\n",
      "user23928 :  1372\n",
      "user7170 :  1370\n"
     ]
    }
   ],
   "source": [
    "for user in top100:\n",
    "    print(user['b']['name'], \": \", user['followers'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "tweets_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 100 Users who follow the most users"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "results = conn.query(\"MATCH (a)-[:FOLLOWS]->(b) RETURN a, COUNT(b) as following ORDER BY following DESC LIMIT 100\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for record in results:\n",
    "    print(record['following'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
