{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neo4J Import and Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting neo4j\n",
      "  Downloading neo4j-5.9.0.tar.gz (188 kB)\n",
      "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m188.5/188.5 kB\u001b[0m \u001b[31m4.8 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25h  Installing build dependencies ... \u001b[?25ldone\n",
      "\u001b[?25h  Getting requirements to build wheel ... \u001b[?25ldone\n",
      "\u001b[?25h  Installing backend dependencies ... \u001b[?25ldone\n",
      "\u001b[?25h  Preparing metadata (pyproject.toml) ... \u001b[?25ldone\n",
      "\u001b[?25hRequirement already satisfied: pytz in /opt/conda/lib/python3.11/site-packages (from neo4j) (2023.3)\n",
      "Building wheels for collected packages: neo4j\n",
      "  Building wheel for neo4j (pyproject.toml) ... \u001b[?25ldone\n",
      "\u001b[?25h  Created wheel for neo4j: filename=neo4j-5.9.0-py3-none-any.whl size=259467 sha256=7d771a685bc27000c954892ad5dfc871af0224b66a61cca7f61e90a6d6c1d442\n",
      "  Stored in directory: /home/jovyan/.cache/pip/wheels/5a/6a/b3/89ab0efac04cf204cfc65f2bff4776865cfe5ff2e1b94ebaff\n",
      "Successfully built neo4j\n",
      "Installing collected packages: neo4j\n",
      "Successfully installed neo4j-5.9.0\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import random\n",
    "import csv"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Aufbau der Datenbankverbindung"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = Neo4jConnection(uri=\"bolt://graph_db:7687\", user=\"neo4j\", pwd=\"password\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query(f\"MATCH (n) RETURN n LIMIT 1;\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Importieren der Knoten und Beziehungen"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Einlesen des \"twitter_combined\" Files"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "follows_file = open('twitter_combined.txt', 'r')\n",
    "lines = follows_file.readlines()\n",
    "\n",
    "follows = []\n",
    "users = set()\n",
    "for line in lines:\n",
    "    line = line.replace('\\n','')\n",
    "    id1, id2 = line.split(' ')\n",
    "    users.add(id1)\n",
    "    users.add(id2)\n",
    "    follows.append([id1, id2])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der User"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "count = 0\n",
    "f = open(\"import/users.csv\", \"w\")\n",
    "f.write(\"userId,name,:Label\\n\")\n",
    "for user in users:\n",
    "    f.write(user + \",user\" + str(count) + \",USER\\n\")\n",
    "    count += 1\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Importieren der User"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.05 ms, sys: 0 ns, total: 3.05 ms\n",
      "Wall time: 2.48 s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///users.csv' AS row CREATE (:User {userId: row.userId, name: row.name})\")\n",
    "conn.query(\"CREATE CONSTRAINT user_constraint IF NOT EXISTS FOR (u:User) REQUIRE u.userId IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der Tweets anhand des \"tweets\" CSV Files "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "jupyter": {
     "source_hidden": true
    }
   },
   "outputs": [],
   "source": [
    "tweets = pd.read_csv(\"tweets.csv\")\n",
    "f = open(\"import/tweetsDB.csv\", \"w\")\n",
    "writer = csv.writer(f)\n",
    "writer.writerow([\"tweetId\",\"content\",\"date_time\",\"language\",\":Label\"])\n",
    "count = 1\n",
    "for index, tweet in tweets.iterrows():\n",
    "    writer.writerow([count,tweet[\"content\"],tweet[\"date_time\"],tweet[\"language\"],\"TWEET\"])\n",
    "    count += 1\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Importieren der Tweets"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.3 ms, sys: 539 µs, total: 3.84 ms\n",
      "Wall time: 1.58 s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///tweetsDB.csv' AS row CREATE (:Tweet {tweetId: row.tweetId, content: row.content, date_time: row.date_time, language: row.language})\")\n",
    "conn.query(\"CREATE CONSTRAINT tweet_constraint IF NOT EXISTS FOR (t:Tweet) REQUIRE t.tweetId IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der FOLLOWS-Beziehung"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "f = open(\"import/follows.csv\", \"w\")\n",
    "f.write(\"userId,followerId,:TYPE\\n\")\n",
    "for follow in follows:\n",
    "    f.write(follow[0] + \",\" + follow[1] + \",FOLLOWS\\n\")\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import der FOLLOWS-Beziehungen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.06 ms, sys: 658 µs, total: 4.72 ms\n",
      "Wall time: 1min 5s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///follows.csv' AS row MATCH (e:User {userId: row.userId}) MATCH (c:User {userId: row.followerId}) MERGE (e)-[:FOLLOWS]->(c)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der POSTED-Beziehung\n",
    "Jeder der Tweets wird zufällig auf einen der 100 User mit den meisten Followern verteilt."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "top100 = conn.query(\"MATCH (a)-[:FOLLOWS]->(b) RETURN b, COUNT(a) as followers ORDER BY followers DESC LIMIT 100\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "user_ids = []\n",
    "for record in top100:\n",
    "    user_ids.append(record.get(\"b\").get(\"userId\"))\n",
    "\n",
    "tweets = pd.read_csv(\"import/tweetsDB.csv\")\n",
    "f = open(\"import/posted.csv\", \"w\")\n",
    "f.write(\"userId,tweetId,:TYPE\\n\")\n",
    "for index, tweet in tweets.iterrows():\n",
    "    f.write(f'{random.choice(user_ids)},{tweet[\"tweetId\"]},POSTED\\n')\n",
    "f.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import der POSTED-Beziehungen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.94 ms, sys: 252 µs, total: 2.19 ms\n",
      "Wall time: 1.55 s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///posted.csv' AS row MATCH (u:User {userId: row.userId}) MATCH (t:Tweet {tweetId: row.tweetId}) MERGE (u)-[:POSTED]->(t)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Erstellung des CSV Files für den Import der LIKES-Beziehung\n",
    "Für jeden Tweet werden aus den Followern des Posters etwa 10 % ausgewählt, welche des Post liken. Die Like-Zahlen aus dem \"tweets\" CSV File werden dabei nicht berücksichtigt."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "allTweets = conn.query(\"Match (t: Tweet) RETURN t\");\n",
    "f = open(\"import/likes.csv\",\"w\")\n",
    "f.write(\"userId,tweetId,:TYPE\\n\")\n",
    "\n",
    "for user in top100: \n",
    "    followers = conn.query(f\"MATCH (follower:User)-[:FOLLOWS]->(following:User) WHERE following.userId ='{user['b']['userId']}' RETURN follower\")\n",
    "    tweets = conn.query(f\"MATCH (u:User {{userId: '{user['b']['userId']}'}})-[:POSTED]->(t:Tweet) RETURN t\");\n",
    "    for tweet in tweets: \n",
    "        for follower in followers:\n",
    "            shouldLike = random.random() < 0.1\n",
    "            if shouldLike:\n",
    "                f.write(f\"{follower['follower']['userId']},{tweet['t']['tweetId']},LIKES\\n\")\n",
    "\n",
    "f.close()    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import der LIKES-Beziehungen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 11 ms, sys: 205 µs, total: 11.2 ms\n",
      "Wall time: 5min 5s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "conn.query(\"LOAD CSV WITH HEADERS FROM 'file:///likes.csv' as row CALL { with row MATCH (u:User {userId: row.userId}) MATCH (t:Tweet {tweetId: row.tweetId}) MERGE (u)-[:LIKES]->(t) }  IN TRANSACTIONS OF 100000 ROWS\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Alle Posts eines zufälligen Users"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "#PrayingForDallas 🙏🏼😢 #PrayingForPeace\n",
      "\n",
      "Together with the team for tomorrow's game. Hala Madrid!\n",
      "\n",
      "Blonday #monsterstyle on Place http://t.co/fQBxFOqwCc http://t.co/cZPEEKp1wZ\n",
      "\n",
      "When the Dalai Lama and Archbishop Desmond Tutu write a book, you gotta read it and #ShareTheJoy https://t.co/WQydH6Sr8q\n",
      "\n",
      "@orgasmicgomez Luv that! :) #BritneyJeanOutNow\n",
      "\n",
      "BEST joke of the year https://t.co/Z77g8WC9WC\n",
      "\n",
      "@SuchaBandhoe I'm MORE excited that you found one of the #TheBritneyFantasy100! ;)\n",
      "\n",
      "Day 1 that's a wrap\n",
      "\n",
      "love you more https://t.co/hSEWcQMUHW\n",
      "\n",
      "Ethiopia says marathoner has nothing to fear after Olympic protest. https://t.co/2cQ5X8jcMo https://t.co/zVRYyp8zKv\n",
      "\n",
      "Throwback 2 when we were in Cuba! Can't wait to watch tonight's episode w u guys! A new episode of KUWTK starts soon https://t.co/7KCnFlJgBc\n",
      "\n",
      "Tonight on the show: @Edward_Burns, @StevieVanZandt, music from @FLAGALine and someone let @JeffAnimalGuy back in the building. #LateNight\n",
      "\n",
      "These four @JustinBieber fans got a surprise that you need to see to belieb. https://t.co/5BlJ23E7Zy\n",
      "\n",
      "\"I get by with a little help from my friends...\" Haha! https://t.co/NI0U6r7k4x\n",
      "\n",
      "In the tranquil French countryside! ¡Ya en la tranquilidad de la campiña francesa!\" Shak http://t.co/YiVkl4KMVX\n",
      "\n",
      "Tonight, @KingBach is hosting the @streamys in LA. Watch our Instagram story to follow Bach on his big night! https://t.co/ngpAvrFLbN\n",
      "\n",
      "Girls can be anything they want to be. Even President of the United States.  https://t.co/oD49R54jT0\n",
      "\n",
      "Read how President Obama's common-sense actions could help #StopGunViolence in America: https://t.co/lUlXKUPKvP\n",
      "\n",
      "#throwbackriri http://t.co/jMbmKV1K\n",
      "\n",
      "Lot of ideas received and some really nice that I'll use for sure. #Celebrate15M\n",
      "\n",
      "Thank you for the Cannes Glam!  @makeupbymario &amp; @jenatkinhair #Snatched https://t.co/ue2w9so1gp\n",
      "\n",
      "Tune into our Instagram story to learn why voting is important to young people this year. https://t.co/y8mkdLhWKD\n",
      "\n",
      "Reminder to those who came to day 1 of @chirp; don't forget to redeem your giving card. It's real money! http://www.donorschoose.org/chirp\n",
      "\n",
      "#GagaOnAHS I hope u like being scared. https://t.co/JINa5MP7xd\n",
      "\n",
      "Our BRITS performance:) http://t.co/Aw2FwbnnqC\n",
      "\n",
      "When you see ⏪👆⏩ on a GIF, break it down — frame by frame.\r\n",
      "\r\n",
      "Give these ScratchReels a scrub:\r\n",
      "https://t.co/zS4NL4sZIr\r\n",
      "https://t.co/3UzQwBEZln\n",
      "\n",
      "If you think Judge Merrick Garland deserves a fair hearing and an up-or-down vote, add your name: https://t.co/EDECatQHmj #DoYourJob\n",
      "\n",
      "Congrats Martin. My guy. Great people and super talented. https://t.co/BgLEm64TrT\n",
      "\n",
      "@ddIpurpose bowing down. Jealous\n",
      "\n",
      "We out here, #Cannes! And I...\r\n",
      "#CannesStopTheFeeling\r\n",
      "#SeeWhatIDidHere \r\n",
      "#OKThatWasCheesy\r\n",
      "#CantStopTheFeeling https://t.co/iqCAfrQfox\n",
      "\n",
      "http://901.com, now . . . right now.\n",
      "\n",
      "A few days into #Sundance and we're already inspired. 😍 @TheGigiGorgeous and @TylerOakley explained how creators af… https://t.co/ZF74klCl7I\n",
      "\n",
      "Say you support decisive action to tackle climate change. https://t.co/S9gkxn0wpv #ActOnClimate\n",
      "\n",
      "At the #TwitterRetreat setting up for a panel on tech in Tunisia. If you're around come join us. We have blankets! #SxSW http://t.co/360aFQx\n",
      "\n",
      "I love you all so much. You are all so stunning and your light is what keeps me going.. Don't ever let anyone tell you otherwise\n",
      "\n",
      "Retweet if you agree with President Obama. #SOTU http://t.co/OgcHFJ3JSt\n",
      "\n",
      "@IAmMarkSpears Neither can I!\n",
      "\n",
      "Share the ways you love the environment! Browse the #MyEarthAction hashtag on Instagram for inspiration 🌎 https://t.co/ePmF5hX64C\n",
      "\n",
      "Bff's Takes New Orleans http://t.co/U0XTjbbvmZ\n",
      "\n",
      "Love me...I'm #DOPE http://t.co/cgL2meAP\n",
      "\n",
      "Thank you @MichelleObama and #OpeneBooks for giving children access to books they need to learn and dream! https://t.co/bTNATKbo2Y\n",
      "\n",
      "This is what I'm wearing tonight! / Lo que llevo puesto esta noche! http://t.co/Sjnxkw0mvq\n",
      "\n",
      "#TBT to when RIFF RAFF @JODYHiGHROLLER &amp; I were dating &amp; we took it to da studio to make dat real  ✨magic✨http://t.co/RB1rx6wmBY 💁\n",
      "\n",
      "@abiander CAN I COME OVER\n",
      "\n",
      "Brooklyn night 1 #PurposeTourBrooklyn https://t.co/ID9OujyJZf\n",
      "\n",
      "“@jtsnum1fan1988: @jimmyfallon history of rap!!!!!!” @jtimberlake is amazing. #BestOfFallon\n",
      "\n",
      "Close up Glam Shot 💋 https://t.co/WWkU5eMUSp\n",
      "\n",
      "What do you see when you're #sittingshotgun? https://t.co/0rp4F2TA4m\n",
      "\n",
      "@WonderwallMSN my cousin Priscilla haha but it's cause I love her to death!\n",
      "\n",
      "Finally got to meet Dylan, the 7-yr-old who passionately danced to Shake it Off on @TheEllenShow-- and this happened. http://t.co/hq9OaewA2G\n",
      "\n",
      "What tip do you most often share with people who could learn a thing or two about using Twitter? #TwitterTip\n",
      "\n",
      "CNN/ORC battleground poll: Trump ahead in Nevada, Arizona; Clinton up in Florida, Pennsylvania.… https://t.co/vVnETP5efb\n",
      "\n",
      "Happy Birthday, @austinswift7! I made an annoying meme to celebrate this momentous occasion! http://t.co/PxxEbMkI5N\n",
      "\n",
      "The EPA's standards for trucks will save billions of dollars while decreasing carbon pollution: http://t.co/8r50Jx68md #ActOnClimate\n",
      "\n",
      "“@questlove: I'm trying folks. but i gotta draw the line.....a mofo likes his peanut butter to be secular....not saved.” #SecularPB\n",
      "\n",
      "Guess who @FLOTUS invited to the #atTheWH today!? Watch the student workshop live stream starting 11am ET. http://t.co/nkBC2KOapA -teamJT\n",
      "\n",
      "The uninsured rate is the lowest it's been in decades, thanks to #Obamacare. Spread the word.… https://t.co/ZkN8HVbn3E\n",
      "\n",
      "\"Over the last few decades, we've locked up more and more nonviolent drug offenders for longer than ever before.\" —President Obama\n",
      "\n",
      "RT @realmadrid @Cristiano Ronaldo: “Hay que ser positivos y seguir peleando” http://bit.ly/gQBGlP  - http://say.ly/glL7Es\n",
      "\n",
      "When Snapchat gets too real. https://t.co/b62NhX7CXL https://t.co/DVzaMdfRvL\n",
      "\n",
      "Good result against Bilbao : 3-0\n",
      "\n",
      "Our @fpiesdescalzos' school in Cartagena, Colombia. Shak http://t.co/0lv7PkvOcT\n",
      "\n",
      "Don't forget who you are http://t.co/DRcsJRZ1\n",
      "\n",
      "10m views in 3 days! 10m de reproducciones en 3 días!  #Chantaje https://t.co/hF1MESxQUR ShakHQ https://t.co/mFam0VIAvC\n",
      "\n",
      "Balenciaga. No make up today. https://t.co/l2WknhHoiy\n",
      "\n",
      "#5hours #WhatDoYouMean http://t.co/RuZi80tKtL\n",
      "\n",
      "My audience showed me their Bad Behavior in this round of Heads Up! Now on @amznunderground! #LaughDancePartner http://t.co/MRIScNj3sy\n",
      "\n",
      "Kicking off #TransWeek over brunch with @TheGigiGorgeous and friends. https://t.co/owNoHrgiIn #KikiWithGigiGorgeous https://t.co/c1WhDvGYBQ\n",
      "\n",
      "We're so impressed with your #ShakiraCountdown pics! Here's @aljavier12's for 16 days! Do send yours for tomorrow…SHQ http://t.co/k4WxGpJrsC\n",
      "\n",
      "I miss it when my little angel falls asleep on my face..... I miss you little man 💕 https://t.co/Mr5fdgQaku\n",
      "\n",
      "#DailyFluff 🐾  https://t.co/XqPJgJzc7a https://t.co/k3uNNT5z3n\n",
      "\n",
      ".@VALLINIAndre @fhollande This is great news! Looking forward to it!\n",
      "\n",
      "“@MeritaAppleHead: If Michael Jackson were still here and came on..\" I think about him a lot. I think he would've liked what we are doing.\n",
      "\n",
      "“If you’re not paying attention, you can definitely get into trouble.”  —weather photographer @kellydelay https://t.co/FS1yBd9Lid\n",
      "\n",
      "I have seen that there are young Spaniards and Portuguese such as @Hala Garrido and @Felipe Munoz who are fighting t... http://say.ly/fgo3ie\n",
      "\n",
      "Chicago get ready. #EveningWithJB #purpose\n",
      "\n",
      "my son! https://t.co/i6bwWsFdzO\n",
      "\n",
      "Hey @tim_cook. FYI… I went with the champagne gold.\n",
      "\n",
      ".@POTUS tells @FLOTUS: “You made the White House a place that belongs to everybody…you have made me proud.” https://t.co/PTl7bwvaSd\n",
      "\n",
      "Wow, I'm honored! MT @aklemme5 @shakira writing my ceremonial speech about you because you deserve all the praise &amp; respect in the world\n",
      "\n",
      "Sometimes being a big fan really pays off. Thanks, Chevy! https://t.co/nyPvPGUg6x https://t.co/fcy5aW66R5\n",
      "\n",
      "“@jamdickiedick: @jimmyfallon i hate school. Do you hate school?” Nope. I loved school.\n",
      "\n",
      "Piñatas 2 http://t.co/IPB07TRU2s\n",
      "\n",
      "CEO John Stumpf retires, Wells Fargo says, a stunning downfall for one of industry's most powerful banking figures.… https://t.co/vUD9EbX7GM\n",
      "\n",
      "Hey @SFSU, I hope you’re ready because something big is happening TODAY. I hope you’re feeling Sporty. #SFSUonEllen\n",
      "\n",
      "WAIT new poll. Which album title do you like best? @kanyewest\n",
      "\n",
      "stop. I'm screaming. ☄ NASA Adds to Evidence of Mysterious Ancient Earthworks\r\n",
      "\r\n",
      "https://t.co/P8DtxQ1Zek\n",
      "\n",
      "I'm enjoying my vacations and just been informed that I've been nominated for the ESPYS awards. It's not my first time… http://t.co/UYmactk3\n",
      "\n",
      "Celebrating World Emoji Day with @emojimasks 😃 😎 : https://t.co/hiTy6GzVto\n",
      "\n",
      "You asked: Por favor Cristiano me podrías decir \"hola Macarena\" me haría muy feliz.  http://t.co/KcttYB5E7W\n",
      "\n",
      "#ratedr http://t.co/IAWZtwJnM2\n",
      "\n",
      "Global climate action became a reality this year—keep the progress going in 2016: https://t.co/LoFVusJz5p https://t.co/0Xqt4gJM3G\n",
      "\n",
      "@aliwehr \"Well, the only challenge is to try to make it great.  Keep working on it til it's great or scrap it.\" - @johnlegend\n",
      "\n",
      "@SisterRude it doesn't just matter to me. It matters to my new management. It matter to my entire team. Every album will be like this now.\n",
      "\n",
      "Marry me. Wait ur my brother 😩 “@sirdavidD: never pretend to be perfect in any way. it's the flaws that make up your beauty.”\n",
      "\n",
      "Two “levitating” golfers hang on tight #WHPseeingdouble https://t.co/R7JCuyE8x3\n",
      "\n",
      "💗 Thank you to SO YOU THINK YOU CAN DANCE for performing Tony and I version of 'Anything Goes' during the show tonight! #CheekToCheek\n",
      "\n",
      "Happy 4th of July! #DailyFluff\r\n",
      "https://t.co/Wnl73ukbjk 🐾 https://t.co/9hp72OiSRp\n",
      "\n",
      "Movie time with my boys 😊 #PieceOfMeIsBack  https://t.co/zfZ3lK5l5z\n",
      "\n",
      "“@stevenkolb: Introducing the 2014 CFDA Fashion Icon of the Year… -  http://t.co/NCVw2Crji5 #cfda” I'm truly honored. Thank you.\n",
      "\n",
      "#RIPNelsonMandela. \"..to live in a way that respects and enhances the freedom of others.\" http://t.co/48VUAvwGYV http://t.co/3yeb4hk9wD\n",
      "\n",
      "Update: @meetup, @stackexchange, @tellapart joining @jellyhq &amp; @liftapp, adopting Innovator's Patent Agreement. https://t.co/ggHve8knoX\n",
      "\n",
      ".@zacefron and I face-off in a game of Egg Russian Roulette https://t.co/wrnmPpQKOl #FallonTonight\n",
      "\n",
      "I would wait forever and ever.\r\n",
      "\r\n",
      "http://t.co/JhUZG7ADJ4\r\n",
      "#TS1989 \r\n",
      "#taylurking http://t.co/0LEV9xZZmM\n",
      "\n",
      "Gearing up for the Golden Globes with @TheMandyMoore\r\n",
      "https://t.co/M2WVauuiKR\n",
      "\n",
      "I love you guys so much💓 https://t.co/mSPGeQOo4W\n",
      "\n",
      "haha thank you! we had so much fun watching the lightening driving in a convertable! https://t.co/NDGAZqDsCd\n",
      "\n",
      "My second show at 30 Rock is starting in half an hour! NYC, I hope to see you here. #EllenInNYC http://t.co/4vEORjYWv2\n",
      "\n",
      "Teamwork. http://t.co/BMbKjVgbxo\n",
      "\n",
      "BadGal x @StanceMuse https://t.co/aC3uhBIkB6\n",
      "\n",
      "jk\n",
      "\n",
      "@Liam_SoCal Now you got the coolest backpack in school!\n",
      "\n",
      "Hey guys, by now I'm sure most of you know that my voice is gone and that I had to cancel some of my shows http://bit.ly/9Nwkpg\n",
      "\n",
      "When you forget to wear sunscreen. https://t.co/DqOVQ5Iq1t https://t.co/iApSKCsZwu\n",
      "\n",
      "Magnitude 7.7 earthquake hits off southern Chile. Tsunami threat message issued for parts of Pacific. https://t.co/Mo2lWwpeL8\n",
      "\n",
      "Thank you for all the love and support for http://t.co/FHnZxiTVZf. If you get anything, post a photo!\n",
      "\n",
      "Bitch Better Have My $$$ Get #BBHMM now: http://t.co/AfLAX79Fv8 http://t.co/F4Y5Af37AN\n",
      "\n",
      "@AmiraDee One of my favorites too!!\n",
      "\n",
      "omg what is this I love you so much  https://t.co/MzTJX1Mu09\n",
      "\n",
      "Thank you elz_  for this fantastic piece of art! @dilekkeysan made sure it was delivered!! http://t.co/j2L5iP7TT8\n",
      "\n",
      "Tonight: Word Sneak w/@melissamccarthy, @ChristianSlater stops by, plus @JLo &amp; @Lin_Manuel perform #LoveMakeTheWorldGoRound!  #FallonTonight\n",
      "\n",
      "#nailedit #thankyou https://t.co/rlPTSFRKkZ\n",
      "\n",
      "Thank you, dumplings, for tasting way better than you sound. #thankyounotefriday\n",
      "\n",
      "You know you're living right when you wake up, brush your hair &amp; confetti falls out. NBD.\n",
      "\n",
      "Thanks for Jeremy @blakeshelton… also, don't forget the lettuce and tomato on that sandwich! #hungry #VoicePremiere\n",
      "\n",
      "“@Mjjfan1958: @jtimberlake As a loyal Michael Jackson fan I just wanted to commemorate you on your part in #LoveNeverFeltSoGood” MY HONOR!🙏\n",
      "\n",
      "Thank you guys for making today unforgettable.(!!!!!!) #1989 #ShakeItOff http://t.co/HdupN0cppT\n",
      "\n",
      "Yay!! RT @iamjonathancook: Is it really?! How do you know? RT @djknucklehead: #7 album on iTunes overall............ *faints*\n",
      "\n",
      "Watch @jtimberlake kick off the new season of @OWNTV @OWN_MasterClass on May 11th 10 PM PT/ET. http://t.co/9QPeIF6jd6 -teamJT\n",
      "\n",
      "Thank you @omimusiconline for singing 'Cheerleader' tonight in San Diego!! You're amazing :)\r\n",
      "#1989toursandiego http://t.co/qnnUvcr3ok\n",
      "\n",
      "Patient kiddies! It's coming MUCH sooner than you think ;) RT @BritneySpearsID \"We Are Ready Britney\" is trending!! http://t.co/M6eTrz22wK\n",
      "\n",
      "The #TS1989 physical cd comes with 13 Polaroids. There are 5 different sets (65 different poloroids in all) \r\n",
      "9 hours. http://t.co/wAKgcUDNrO\n",
      "\n",
      "@MattGronenthal hey that's my friend your talkin about knock it off. Rude.\n",
      "\n",
      "@anye_malaga Thank You XOXO\n",
      "\n",
      "Hiii. Memphis. http://t.co/2F0XBi8i\n",
      "\n",
      "is this what it sounds like @alexaluria? #28daysTilFocus https://t.co/fIEPPi6dFt\n",
      "\n",
      "Reinterpreting beauty at Paris Fashion Week with @patmcgrathreal #PFW https://t.co/Y0zzxdWE9m https://t.co/0DCTXxkiiO\n",
      "\n",
      "my favorite face in the world ☁️☁️☁️☁️☁️☁️☁️☁️☁️☁️ thanks for guiding me everyday \r\n",
      "I miss you \r\n",
      "https://t.co/FBwE2XRqTb\n",
      "\n",
      "screenshots are forever ❤️ https://t.co/3NNVHJ1d6b\n",
      "\n",
      "Thank you, bars that have dart boards, for supplying drunk people with sharp objects to throw. #ThankYouNoteFriday\n",
      "\n",
      "#Navy http://t.co/lpVAcTzMSr\n",
      "\n",
      "My brand, ED, is collaborating with GAP Kids! Perhaps you’ve heard of them. http://t.co/6djEfVQtqU\n",
      "\n",
      "I hope every one enjoyed thanksgiving! So thankful for all of you!!\n",
      "\n",
      "Turkish and Russian envoys will meet today to discuss Syria, day after killing of Russia's ambassador to Turkey.… https://t.co/Gw4TdF3Dl0\n",
      "\n",
      "Heading back to the hotel with this great surprise. Thank you guys. http://t.co/UZIbyr5QDf\n",
      "\n",
      "Haven't done one of these in a while.  \r\n",
      "\r\n",
      "Also Il Volo is sold out tonight. So... come watch Late… http://t.co/yJ6bJoRcFw\n",
      "\n",
      "queen of #AMAs !!!! thinking of you today &amp; missing you. see you soon QM https://t.co/UOE41gANli\n",
      "\n",
      "Tonight: Playing \"Box of Lies\" w/Vince Vaughn, @RyanSeacrest is here + music from @deadandcompany! #DeadAndCompanyFallon #FallonTonightLA\n",
      "\n",
      "Ponferradina 0-2 Real Madrid C.F. ¡¡Hala Madrid!! http://t.co/TDd2ybNL\n",
      "\n",
      "This was such a fun day. I ❤️ Kate McKinnon. #BackstageAtEllen https://t.co/WF4i9RVGkl\n",
      "\n",
      "❤️ https://t.co/AtevCjO5sP\n",
      "\n",
      "@HeyGomezBieber &lt;3 #YouBettaWorkB\n",
      "\n",
      "Imagine all that hair! https://t.co/8MChatOIbq https://t.co/xFw9qT389w\n",
      "\n",
      "!Gracias a todos ustedes por estas 6 nominaciones @Univision Premios Lo Nuestro y por premiarme esta noche! Los quiero mucho! Shak\n",
      "\n",
      "Who bought the album?\n",
      "\n",
      "That time when @NickJonas and I let @Twitter run our lives with @Buzzfeed 😂😈 https://t.co/A2xiEDvlpn\n",
      "\n",
      "#CoolForTheSummer 😎☀️🍦🍉\r\n",
      "https://t.co/ZiLXT8JcdK\n",
      "\n",
      "“@GloriaMarson: @jtimberlake a friend is playing an acoustic version of mirrors at my wedding while we read our vows!” Nice!!!\n",
      "\n",
      "A COLOR THAT POPS https://t.co/L4qtHhm9Rt https://t.co/tMVsEawVOS\n",
      "\n",
      ".@TherealTaraji and I play Fast Family Feud https://t.co/Xm1f4xeosH #FallonTonight\n",
      "\n",
      "Ain't over till it's over. Every last vote today counts!!! @jtimberlake Artist of the Year #AMAs: http://t.co/LwKop4VeTi -teamJT\n",
      "\n",
      "I love my monsters, gypsy travel day. Hope you are enjoying every moment of the tour as much as I am. #artRAVEBrisbane\n",
      "\n",
      "Suspect in knife attack at facility for disabled in Japan turned himself in, NHK reports. https://t.co/93vR2DX69L https://t.co/ZGHioGg1ZT\n",
      "\n",
      "Participate in this weekend’s hashtag project: #WHPbookworm https://t.co/rYU0fwiga1 https://t.co/WHb7VXtQz7\n",
      "\n",
      ".@iTunesMusic Judy Garland and Jason Mraz! #AskSelena\n",
      "\n",
      "Supernatural (super cold) nights with photographer @maria_lax_ https://t.co/pV9uCflUtr https://t.co/r8cfugpuVr\n",
      "\n",
      "“Often I’ll be somewhere and I’ll see a pile of stuff and think, ‘Should I stick that on my face?’” —prop master Michael Gump\n",
      "\n",
      "\"That spirit of discovery is in our DNA. America is Thomas Edison and the Wright Brothers and George Washington Carver.\" —President Obama\n",
      "\n",
      "Happy birthday Zony and Yony! You were so adorable on the show. I hope you go out tonight and really Taiwan on. http://t.co/9aovdXxF0M\n",
      "\n",
      "I have a 30 minutes before I leave for @GlobalFestival #UNICEF or #HotelTransylvania for a quick Q &amp; A.  LOVE YOU GUYS\n",
      "\n",
      "Playing tourists with my grandparents today. Why does that mean I just know the best restaurants. -I like food. A lot.\n",
      "\n",
      "Did you catch Shak &amp; @blakeshelton's performance of Medicine on @ACMawards tonight? Download it now on iTunes: http://t.co/3oW56Dc95F ShakHQ\n",
      "\n",
      "Happy Father's Day!! Happy to see so many dads reading to their children today. So cool. Have the… https://t.co/pp7UhwMhLk\n",
      "\n",
      "@the7thleland Wish I was there!! So glad you like Shake it Off!!!!\n",
      "\n",
      "@GloZell a CLASSIC.\n",
      "\n",
      "If you enjoyed Shak's performance of #Empire on @NBCTheVoice, you can download the song from @iTunesMusic at http://t.co/CvFDqLlnIJ ShakHQ\n",
      "\n",
      "Highlight reel vibes, just in case you missed our little announce party. http://t.co/oi8pLMTuDZ\n",
      "\n",
      "Get ready... #PricelessSurprises has officially kicked off: http://t.co/1lzgrZDMhE -TeamJT\n",
      "\n",
      "Hey guys, I'm throwing 1st pitch tonight at Dodgers Game! Hope I'll be better than on the @BusterBash PRO.\n",
      "\n",
      "“@SoumsluvRiri: You decided what your next single should be already?? @Rihanna *wishes for Stay*” who knows?!\n",
      "\n",
      "@BrieLarson, congrats on your Oscar win and for sharing the moment with us on Twitter! #LoveTwitter https://t.co/N7F98c9sXF\n",
      "\n",
      "Hoy con la madrina-tía abuela que nos vino a visitar y los pirineos franceses al fondo! http://t.co/0x96NGvqHK\n",
      "\n",
      "\"A man who has no imagination has no wings.\" —#MuhammadAli https://t.co/ssEM7YRR2h\n",
      "\n",
      "The President's #ImmigrationAction will be good for the economy—but opponents are standing in the way: http://t.co/jpWzOdt71b\n",
      "\n",
      "90 million! 90 Millones! #Chantaje https://t.co/hF1MESxQUR ShakHQ\n",
      "\n",
      "Our CEO, @dickc, will step down as CEO, and we’ll welcome @jack as Interim CEO on July 1 #TWTRannouncement: http://t.co/q8Ygg91jzc\n",
      "\n",
      "@UltimateKimK no they both work!!!! same link! i was just letting people know where to get it! xoxoxo\n",
      "\n",
      "We wrote 'Style' exactly a year ago. Max, the guy flexin on the right, just won Producer of the Year at the Grammys. http://t.co/P1HekaITNA\n",
      "\n",
      "Good night 👍😜 https://t.co/v9aHmCggSz\n",
      "\n",
      "Documenting life in Afghanistan with @paulaphoto https://t.co/2dMLx715NM\n",
      "\n",
      "better make up your mind wdym??? #22days 💭💭💭 https://t.co/CJ8N6eo4IZ\n",
      "\n",
      "Shout out to Matt Williams for this sick shoot &amp; video we did just for the site!\n",
      "\n",
      "THANK YOU https://t.co/TgVoB619V3\n",
      "\n",
      "Introducing my new label venture with @capitolrecords featuring my first artist FERRAS @ohferras http://t.co/v9RrvZ8Hfb\n",
      "\n",
      "Another weekend and some more unnecessary press.  If you want to know me, trust in what I write, not in all the stor... http://say.ly/map3gF\n",
      "\n",
      "Congratulations to Peyton Manning and the Denver @Broncos on a great win. Keep your heads up @Panthers. You did good. #SB50\n",
      "\n",
      "#tbt\r\n",
      "\r\n",
      "The history of nostalgia → https://t.co/z66YxfNIHv https://t.co/Ln73n2wIdu\n",
      "\n",
      "Lol https://t.co/dphENq2tvS\n",
      "\n",
      "On the show tonight we've got Denzel Washington, @Shaun_White &amp; music from @SaraBareilles. #FallonTonight\n",
      "\n",
      "\"The most important title is not president or prime minister, but citizen.\" —President Obama #CGI2014\n",
      "\n",
      "Thanks @jimmyfallon @theroots @questlove @higbones for the #ASLIceBucketChallenge: http://t.co/CA62e0RpcE Donate! http://t.co/PXxvcfdkPS\n",
      "\n",
      ":) thanks http://t.co/guDqrRG3My\n",
      "\n",
      "U guys crashed http://t.co/UJRSow9mYb amazing!! And you made #BuyComeAndGeItOniTunesTONIGHT trend.  #selenatorsarethebest trend that. :)\n",
      "\n",
      "A song I wrote with @jackantonoff called 'You Are in Love' is finally up on @iTunesMusic!!!!\n",
      "\n",
      "US fertility rate fell to its lowest point since record keeping started more than a century ago, CDC says. https://t.co/xfp9g6WIH5\n",
      "\n",
      "Not when playing, but before and after, yes. @manar141 @Cristiano wonderig: do you ever read youe fans signs while playing?\n",
      "\n",
      "Boston http://t.co/csEjt8XTtP\n",
      "\n",
      "No es momento de bajar los brazos sino de seguir luchando por la igualdad de oportunidades https://t.co/AZuhoZU5H3 Shak\n",
      "\n",
      "Ben Mor &amp; I are finally finished with #WorkBxxCH. So proud of this video &amp; overjoyed to share with my beautiful fans. http://t.co/3z7OnVfC3d\n",
      "\n",
      "Editorial boards across the country are calling on Senate leaders to fill the Supreme Court vacancy. Read more: https://t.co/IArYejb7bN\n",
      "\n",
      "I AM NOWWW A CHECKERBOARD CHICK #HairsprayLive #Penny\n",
      "\n",
      "I'm not sure. I'd love to go sometime. @nafu786 @cristiano when do you plan on visiting south africa again?\n",
      "\n",
      "It’s different every night, but right now I’d say “Toxic\" #AskBritney https://t.co/elYkHCGJcX\n",
      "\n",
      "@jasonsproblem I'll hit @BriLoveLife  @iamSkot &amp; tell them y'all want a tutorial\n",
      "\n",
      "Performing with Mary was a dream. Thank you @maryjblige for this incredible moment you created in LA. ❤️ \r\n",
      "https://t.co/fKRtvtpkLw\n",
      "\n",
      "You don't need super powers to help push progress forward. Chip in today: https://t.co/yCxp5APr5E https://t.co/iHbjSMt3Ug\n",
      "\n",
      "are you an 80's baby?\n",
      "\n",
      "Here’s the @SuicideSquadWB mural taking over Miami’s art district https://t.co/HHyRYlaShd\n",
      "\n",
      "Hoy la 1a entrega Premios ALAS BID que galardonan el esfuerzo de aquellos q labran el camino del éxito para nuestros niños latinoamericanos\n",
      "\n",
      "These sand videos are so oddly satisfying (thanks, @POPSUGARTech!) https://t.co/NFsDi5Yhm7\n",
      "\n",
      "#DIAMONDSVideo  http://t.co/o6k0cuf3\n",
      "\n",
      "Black boxes from plane that crashed in Colombia have been found, according to civil aviation authority… https://t.co/fkEbcKTvoY\n",
      "\n",
      "@sortedfood Grace’s face = us.\n",
      "\n",
      "NFL clears Harrison, Matthews and Peppers after allegation over performance-enhancing drugs https://t.co/LP9PporvQz https://t.co/6LaT3Ged11\n",
      "\n",
      "Writing letters, giving haircuts, signing cd covers. Backstage activities.\n",
      "\n",
      "💅 💁 💋  RRRAARRWHHGWWR 💋 💁 💅 https://t.co/pV4zmi9vkB https://t.co/6S7fQTdvvM\n",
      "\n",
      "Knicks. http://t.co/H2IwFXMor0\n",
      "\n",
      "Tonight: Playing Pyramid with Nathan Lane &amp; Keri Russell, stand-up from @MaryLynnRajskub and it's #ThankYouNoteFriday! #FallonTonight\n",
      "\n",
      "@spearsexy yep!  soon.... :)\n",
      "\n",
      "oh shittt get ready for @Sirah #NowPlayingCONFIDENT https://t.co/VKz2i6VaYt\n",
      "\n",
      "Thank you, @mindykaling for your honesty, humor and activism. #LoveTwitter\r\n",
      "https://t.co/rD9zqwYo7a\n",
      "\n",
      "Let's just say that my little divas are going to take diva week to a whole new level on Wendesday night! Wow. #BritneysDivas\n",
      "\n",
      "New cover for @theFADER out now! Read the article:\r\n",
      " ---&gt; http://t.co/cS6R6VcA8J #FADER100 http://t.co/ZK8Eyj86hj\n",
      "\n",
      "And on to the next.. http://t.co/kY9NB0Palf\n",
      "\n",
      "Obsessed w my Kimoji phone case! Not many left so get it now on my app or https://t.co/Ht05cGDKAB #KimojiMerch https://t.co/Jorf6jBQiS\n",
      "\n",
      "Diving into integration examples of @anywhere today, @chloes glimmers on stage @chirp.  http://flic.kr/p/7TDJyG\n",
      "\n",
      "Learn more about the 10 powerful photos shared with @Pontifex (via @TIME) https://t.co/uv57vNAqnw\n",
      "\n",
      "BTS 👀 #GlamRock http://t.co/ByostiyP2e\n",
      "\n",
      "Today with the penguins! Definitely friendlier!! Hoy con los pingüinos! definitivamente más amigables! Shak http://t.co/EKCYHzOd\n",
      "\n",
      "@smalls485 @lizakoshy You can do it, Molly!\n",
      "\n",
      "Happy #LeapDay! Today lets the sun catch up to the moon’s rotation. I have no idea. I just hope it means free breadsticks somewhere.\n",
      "\n",
      "Take flight this #TravelTuesday and explore the otherworldly rock formations and caverns of Cappadocia, Turkey. https://t.co/FfexrYRbfd\n",
      "\n",
      "Yaaassss!!!! https://t.co/aKIjQgc629\n",
      "\n",
      "She's my rock so I hold on to she tight!!! http://t.co/N8PQIwHudE\n",
      "\n",
      "Took the day in today. What another incredible release day. I'm so grateful to be living my dreams.. Thank you all for supporting me 💗\n",
      "\n",
      "Introducing the cartoon version of me in my new game #KatyPerryPop! We’ve been working on this game… https://t.co/Q9yug3l1or\n",
      "\n",
      "Whether you need a forest fire or just a good cry, there’s music for you. https://t.co/IOZhYIeTWh #YouTubeMusic https://t.co/ouq6aXFr2r\n",
      "\n",
      "Fashionable follows for #NYFW (via @TimeOutNewYork) https://t.co/RbVUUMXMy7\n",
      "\n",
      "@ProSyndicate, thank you for owl-ways being on Twitter! #LoveTwitter https://t.co/BjAsJiCM7V\n",
      "\n",
      "mom's genuine reaction when I played her the album. #1monthTilDangerousWoman #loveyoumommy https://t.co/kokpHV6ERM\n",
      "\n",
      "I'm back!! Neil!!!\n",
      "\n",
      "Living that bucket list lyfe 🙏🏼\r\n",
      "📷 ronyalwin @ Machu Picchu https://t.co/ar0A92HhLE\n",
      "\n",
      "Emma Stone and I play the Singing Whisper Challenge https://t.co/r41t9httHQ #FallonTonight\n",
      "\n",
      "#TBT Working at Good Burger (Thanks Kenan Thompson and @Iamkelmitchell!!) https://t.co/gKUJqQHLnu\n",
      "\n",
      "Under the Obama administration, the deficit is down nearly 75 percent—the lowest it's been since 2007. http://t.co/3LCue7Fe7s\n",
      "\n",
      "My @lumeecase is life! Yep we own the patent so go 2 https://t.co/GYe09RX1HX 2 get the original! Selfies will be lit https://t.co/PnlpFbiTUW\n",
      "\n",
      "Stretching boy👍 https://t.co/0tsFbOGsnW\n",
      "\n",
      "#Portugal vs #Czech Republic http://t.co/EPFoKUss\n",
      "\n",
      "Michael Phelps wins record-extending 23rd Olympic medal as US swimmers take gold in men's 4x100m relay at Rio 2016. https://t.co/bQCW3wz2lf\n",
      "\n",
      "My music/rhythm game Cristiano Ronaldo Freestyle is now on Android phones! Who's going to download it right now? … http://t.co/ZQdVV6Aq\n",
      "\n",
      "@GloZell 🎶 We’ve been watching this all night. We’ve been watching this all day. 🎶\n",
      "\n",
      "Sitting in leaves has never been more adorable. Or more punk rock. https://t.co/Z94y9l3yBv\n",
      "\n",
      "Reflecting on the shores of the Brahmaputra River. #TheWeekOnInstagram https://t.co/3QjCuIFA4l\n",
      "\n",
      "This kid carries a beat around the entire world. https://t.co/8mu2fLlJo8 https://t.co/CkAzvrE8YJ\n",
      "\n",
      "I was driving on the highway, didn't see a car for 15 min. When I finally did see one, it was being driven by a clown. #ThatHappened\n",
      "\n",
      "Love it then come and get it, I know that ya fuckin wid it! Ya see me ya like it huh?  Heels Givenchy huh?\n",
      "\n",
      "@BigCountrySport no way man, I 100 percent sang it live ❤️ but good question 🎤\n",
      "\n",
      "83 people arrested at Dakota Access Pipeline protest, North Dakota authorities say https://t.co/Tl8dzmRdq6\n",
      "\n",
      "Let's start the 10 day countdown with a little couture maisonvalentino  #theprismaticworldtour http://t.co/G0PwJi2qmH\n",
      "\n",
      ".@justinbieber, you never disappoint. #GRAMMYs\n",
      "\n",
      "♡  https://t.co/zSX4JqOJ2I\n",
      "\n",
      "4 people were killed when a tree fell on a home as a tornado swept through a rural Alabama community, officials sai… https://t.co/l9bxqpjj1F\n",
      "\n",
      "I be at the afterparty like...#thisishowwedovmas http://t.co/WTIfmNEItD\n",
      "\n",
      "Wow. Did we just make history?! Thank you so much to ALL of #Top40 and @RCARecords! UNREAL! I'm blown away! 🙏‼️\r\n",
      "\r\n",
      "https://t.co/WHoXiMp5Pe\n",
      "\n",
      "Mark My Words. #PURPOSE https://t.co/QTYt8y3mur\n",
      "\n",
      "One. More. Week!!! Can’t wait to watch @CWJaneTheVirgin next Monday 👯  Don’t miss it at 9/8c! https://t.co/ma7A71fhz4\n",
      "\n",
      "🇮🇹 http://t.co/xPXFXXQU7U\n",
      "\n",
      "These sorority girls may have spent the whole time at my show takings selfies, but at least I was in ‘em. http://t.co/V4nve9MJAd\n",
      "\n",
      "Ever met a music legend? Here's your chance—meet James Taylor in Chicago this summer: https://t.co/6QAeg2ZqxX https://t.co/Q0EyXlAXA4\n",
      "\n",
      "Got to share the stage with my best friend @VICTORIAMONET_ today for the first time. I have no… https://t.co/jXMchviI3j\n",
      "\n",
      "I love Japan\n",
      "\n",
      "Oh hay twin! @Pink excited to see your pretty @COVERGIRL face perform at the @TheGRAMMYs 🙌🎤\n",
      "\n",
      "I just fell in love with Sue Bird and Diana Taurasi in their post-game interview... #Swagger #Rio2016\n",
      "\n",
      "Discover: Literature http://t.co/e5pUEXlX\n",
      "\n",
      "It's easy to take a meaningful stand for cutting carbon pollution right now: http://t.co/E7sUJxG9sc #ActOnClimate\n",
      "\n",
      "\"My name in the video is Destructa X, which I think is perfect for me.\" \r\n",
      "@elliegoulding \r\n",
      "http://t.co/IcQyWxrEm2 http://t.co/hQE6K3jjav\n",
      "\n",
      "2. #KillEmWithKindness #REVIVALListeningParty http://t.co/uOdVcm8baV\n",
      "\n",
      "Couldn't have wished for a better birthday yesterday... Hello, 33! #Club33 http://t.co/LX7OHEtRGZ\n",
      "\n",
      "Check out these great pics from yesterday's match. Great game from @realmadrid http://t.co/GRmXeED\n",
      "\n",
      "This morning at bishopjakes The Potters house. Unbelievable message. Had me in tears. Thank you Bishop… http://t.co/qZsWXu3Hgv\n",
      "\n",
      "In the airport with Richard Jenkins who plays my dad becuase 1) he is an amazing actor and 2) its my favorite relationship my character...\n",
      "\n",
      "It's time💃🏼 #BBMAs are starting... Get your @Shazam ready! https://t.co/a48ifVtfIj\n",
      "\n",
      "Early childhood education is needed to counteract the negative consequences of growing up in disadvantaged households http://t.co/kAGerH8O0P\n",
      "\n",
      "My cousin's contact lens fell out, so in every wedding photo, he looks like he's winking at the camera. #WeddingFail\n",
      "\n",
      "Yay!!!! https://t.co/Dn583l6VOY\n",
      "\n",
      "Driving in the carpool lane with @khloekardashian &amp; the kids &amp; hate that the paparazzi break the law &amp; drive solo in the carpool lane!\n",
      "\n",
      "Don’t miss @AmySchumer: Live At The Apollo on @HBO tonight at 10pm! #AmyAtTheApollo\n",
      "\n",
      "@IGGYAZALEA to remember that chicken noodle soup we had at your house? 🙌🏼🙌🏼🙌🏼\n",
      "\n",
      "!!! https://t.co/WOQs1n72C6\n",
      "\n",
      "If you’re under thirty, you’re welcome. https://t.co/7lFyhODJBa\n",
      "\n",
      "@bealrgths 10000%\n",
      "\n",
      "New sweaters and shirts coming soon to https://t.co/FHnZxjbwQN! You’ve officially been teased. https://t.co/XIfxvutnAf\n",
      "\n",
      "#Justmoji is available on the @AppStore for iMessage #iMessageApps https://t.co/iM63PrCy7L\n",
      "\n",
      "How @Simone_Biles stays grounded while her career takes off https://t.co/1dTjLax9Lw\n",
      "\n",
      "STEAL YOUR MAN’S STYLE: GLASTONBURY EDITION https://t.co/GlERzMHrM7\n",
      "\n",
      "It's Activity Monday! Everyone now has the Activity & @username tabs. Learn more about these features in our blog post: http://t.co/sybjT6WM\n",
      "\n",
      "Meredith is allergic to joy. http://t.co/FIaVmUVCid\n",
      "\n",
      "Bet he has the sickest secret handshakes. https://t.co/IXEMlTseZz https://t.co/uDJuwvWOAR\n",
      "\n",
      "Ayyye...It's all about the long plaaaaay...\n",
      "\n",
      "hey @BetteMidler I know it's past your bedtime but if you're still up and reading this send nudes #justkidding\n",
      "\n",
      "Quedan solo 15 días para nominar a los premios ALAS-BID a aquellos educadores extraordinarios que conoces. Participa ya! @MovimientoALAS\n",
      "\n",
      "#Vogue thank you! https://t.co/Aa6uKKtaqc\n",
      "\n",
      "Obrigado. @DriBonome Parabéns ao @RealKaka e ao @Cristiano pelo jogo de hoje! #HALAMADRID\n",
      "\n",
      "sure do 💭 https://t.co/sZMIIOtTXx\n",
      "\n",
      "LOL!!!! My money got a bad habit of pissing people off!! If you sincerely wanna help little girls more… http://t.co/T4knLMNKjC\n",
      "\n",
      "i missed y'all sm https://t.co/oHJXZH6qY6\n",
      "\n",
      "Just posted a photo http://t.co/mF8sO7wPVu\n",
      "\n",
      "¡La canción de Shak La La La (Brasil 2014) ft @carlinhosbrown está en el álbum de @FIFAcom @2014WC_Brazil  http://t.co/xJWWzUUTT1\r\n",
      "ShakiraHQ\n",
      "\n",
      "#bae 💜💞💜 https://t.co/rgYEHNPTBK\n",
      "\n",
      "Follow #NYFW on @Twitter and @vineapp! Here's all the details: http://t.co/f0ag6ziy\n",
      "\n",
      "Turkish official ID'd suspect in Russian envoy's killing as police officer; he didn't say if officer was off duty.… https://t.co/Fz6ZUyC4mw\n",
      "\n",
      "Hey @ElvisPresley, thanks for the PB-banana sandwich! RT@ElvisPresley: Look what stopped by Graceland today!  #PRISM https://t.co/4ljGQEk9rl\n",
      "\n",
      "@itsKELSEYtho happy birthday beautiful doll!!! 🎂🎂🎂\n",
      "\n",
      "@MylifeasMajoo what an interesting proposition, LOL. Followed u!\n",
      "\n",
      "If you're willing to work hard and play by the rules, you should be able to get ahead. https://t.co/394hdJttgO\n",
      "\n",
      "2 Turkish soldiers killed by PKK fighters in southeast Turkey, state-run news agency reports https://t.co/MJO2WMoqAD https://t.co/K9HrlS7c6R\n",
      "\n",
      "Syrian human rights group says 83 killed in airstrikes that Syria blames on coalition. https://t.co/m1aSfWfpmP https://t.co/qY2JOMbx1Y\n",
      "\n",
      "Five minutes to go… en cinco minutos... #ShakiraTODAY @TODAYshow ShakHQ http://t.co/36CwXYmrB6\n",
      "\n",
      "RT @NBCTheVoice  Button Pressing 101: The @Shakira Method https://t.co/dqb3x3CpAY\n",
      "\n",
      "#springbreakforever http://t.co/vk0I62ys\n",
      "\n",
      "\"@TraceAyala: T.G.I.F.F. Baby! #901\" Amen, brother.\n",
      "\n",
      "Going to live stream making rice Krispy treats!\n",
      "\n",
      "Watch: Professor Obama has a #SCOTUS lesson for obstructionists in the Senate. #DoYourJob https://t.co/CtFP33X8Lv\n",
      "\n",
      "That's a wrap for #TNF\r\n",
      "\r\n",
      "Tune in next week for @RamsNFL vs @Seahawks streaming LIVE on Twitter.\r\n",
      "https://t.co/WdzHD9qrrO\n",
      "\n",
      "A stranger’s swinging shadow = #BoomerangOfTheWeek! https://t.co/JdwLz7Anfg\n",
      "\n",
      "YOU ARE MY EMOTIONAL EPI PEN cc: @sofifii 💉\n",
      "\n",
      "Russia's Putin and Turkey's Erdogan set to meet after rift. https://t.co/q7G0TcHUCP\n",
      "\n",
      "I love A-YO I couldn't wait to share it with you, I❤️U                  \r\n",
      "x o x o  #JOANNE \r\n",
      " 🎶mirror on the.ceilin'🎶… https://t.co/b35aC6bjeg\n",
      "\n",
      "Thanks for joining us! Live video on Instagram Stories is rolling out globally in the next few weeks. Learn more: https://t.co/Y3uGVcKtzz\n",
      "\n",
      ". #starsdancetour is on sale now!!!! http://t.co/vNzp2dHCtR to get your tickets.  Which show are you going to? http://t.co/ONndzloLIm\n",
      "\n",
      "@socal627 Happy Bday! See u soon :)\n",
      "\n",
      "Flash flood emergency issued for portions of Baltimore area, with NWS citing \"severe\" flooding. https://t.co/opzdkx6rb7\n",
      "\n",
      "@HIDEO_KOJIMA_EN, thank you! Here's to new beginnings, Kojima-san. #LoveTwitter  https://t.co/GOlq50G2VU\n",
      "\n",
      "So excited for the world premiere video and song with me and http://t.co/wioC2aXEWA (@iamwill)! Tonight! #FallonTonight\n",
      "\n",
      "Just a few dollars buys vaccines to help @UNICEF's battle against polio. #WorldBabyShower SHQ http://t.co/uoveg7531u\r\n",
      "https://t.co/x0GWqESv6d\n",
      "\n",
      "Congrats, Peta Murgatroyd &amp; Maksim Chmerkovskiy on your engagement! I wonder if there are a lot of Murgatroyd-Chmerkovskiys registered.\n",
      "\n",
      "It feels so good to be back in Vegas!! Can't wait to kick off #PieceOfMe 2017 tomorrow night! ⭐️ https://t.co/XHq85urZf7\n",
      "\n",
      "Great win last night, love to be back playing. http://t.co/EoTSU4Qu8S\n",
      "\n",
      "BE ALRIGHT ♡ DANGEROUS WOMAN \r\n",
      "https://t.co/X1TBDlCDds https://t.co/AsiSVko5fh\n",
      "\n",
      "We’re channeling @VanierDanielle’s confidence and beauty #PerfectlyMe https://t.co/9v5BOmzo0S\n",
      "\n",
      "Tonight: @MileyCyrus, @joshgad, plus @Bourdain &amp; @Mariobatali stop by! #FallonTonight\n",
      "\n",
      "“@ComplexMag: Justin Timberlake is a king. #AMAs” 🙏 Thank you for the shout-out! I'm currently at home taking the trash out. #LikeAKing\n",
      "\n",
      "Started to pack for the move to Vegas today. Can't believe how close we are to opening night... OMG! #21Days\n",
      "\n",
      "Introducing the last social network you’ll never need. This is #BadInternet’s Hive Mind → https://t.co/Ex7LpSLYzz https://t.co/qC7POeR5ts\n",
      "\n",
      "Sometimes I fall asleep on my mom's face....... 💤💗 https://t.co/7DNzv2bRWU\n",
      "\n",
      "\"America, this will change—but only when we stand up, together, and demand it.\" —President Obama https://t.co/hTcIIsK5Ai #SandyHook\n",
      "\n",
      "@Tsavo @starwars The Force is strong with you, Cory.\n",
      "\n",
      "\"For too long, we’ve been blind to the unique mayhem that gun violence inflicts upon this nation.\" —President Obama\n",
      "\n",
      "Starting today, you can add stickers to your stories! 💖 https://t.co/JQgae1SSXk https://t.co/hueVO0SW1N\n",
      "\n",
      "My baby miss me❤️ https://t.co/WNkUjDWwRY\n",
      "\n",
      ".@jasonderulo gets dance lessons from toddlers. https://t.co/q8AOAfDRNF https://t.co/ZMifl1TQRP\n",
      "\n",
      "Clean air makes for healthier and safer communities. #ActOnClimate https://t.co/uuPdv41v0u\n",
      "\n",
      "It's almost here ... #MakeThePilgrimage https://t.co/bPfJkqMho7\n",
      "\n",
      "Tour bus that crashed into a freight truck in California resulted in 13 fatalities and 31 injuries, official says.… https://t.co/XdrHWzCETm\n",
      "\n",
      "Another day, another wig snatch't   #phuckyoviewz #phuckyofav #phuckyophanz #allmyniggazNavi http://t.co/WrzYEhTY9Z\n",
      "\n",
      "I confess, I am lost, in the age of the social. On our knees, take a test, to be loving and grateful. -Angel Down… https://t.co/yyFmA9gycC\n",
      "\n",
      "What's hatching at Twitter HQ?  http://t.co/wk9A1tF\n",
      "\n",
      "¡Ya está aquí! El nuevo vídeo de Shakira #AddictedToYou. Esperamos sus comentarios... http://t.co/O4SQqDhc ShakiraHQ\n",
      "\n",
      "Everybody's talkin' bout my tight pants. Feat. Jennifer Lopez (@JLo ) http://t.co/5gcH4PnIUq #gotmytightpantson\n",
      "\n",
      "Everyone has a role to play in ending sexual assault. #ItsOnUs: http://t.co/h4Xcensx3J\n",
      "\n",
      "wkorea x dennisleupold x badgal x 10th Anniversaries http://t.co/OXCB106qmp\n",
      "\n",
      "You can download the #AddictedToYou video from @iTunesMusic worldwide at http://t.co/j7RbTLOd ShakiraHQ\n",
      "\n",
      "7 people injured in explosion in Turkey, state-run news agency says. Police killed 2 attackers, are hunting a third. https://t.co/gWGHjXSlpp\n",
      "\n",
      "I'm joining @SacoorBrosGL for the celebration of their 25th anniversary! #Heritage is a must see collection! https://t.co/xbeF4oLs2r\n",
      "\n",
      "SPARKLES.\r\n",
      "https://t.co/KqpRmNF8cM\n",
      "\n",
      "“@YerdMe_CMB: @rihanna You ready for the Brazil match sis? 😊” yussss\n",
      "\n",
      "Last night @MirandaKerr and I faced off in a game of Flip Cup http://t.co/UwrZfmCNqp #FallonTonight\n",
      "\n",
      "Happy birthday to the hilarious @rickygervais. I hope it’s as golden as your underwear. https://t.co/cHuecqw8Ce\n",
      "\n",
      "Wooooiiiiiiiiiii @mforde11 WAKE UP!!! It's your birthday heaux!!!! http://t.co/mYTnriheAh\n",
      "\n",
      ".@robknox_ys Finally... A road win.\n",
      "\n",
      "Happy birthday to the very talented @SabrinaAnnLynn! Keep twirling 😉 https://t.co/B6mxbQoRLH\n",
      "\n",
      "Grab your tissues and watch @Kelly_Clarkson perform “Piece by Piece”… https://t.co/bqUFNYOoBy https://t.co/HEwFx2ub38\n",
      "\n",
      "@Lyyssaaaa13 I actually cannot stop unintentionally matching with my friends. Look at us wearing dark blue like that.\n",
      "\n",
      "So excited to add Emily's sound to #TeamShakira this season! #BlindsContinue\n",
      "\n",
      "Someone knitted this sweater of a Polaroid of me and gave it to my mom at the show. \r\n",
      "Thank you, mysterious knitter. http://t.co/firiax6SzS\n",
      "\n",
      "Tomorrow night, I’m gonna be live tweeting a new episode of #OneBigHappy! Watch along and tweet with me! 9:30/8:30c on NBC\n",
      "\n",
      "I know you want my cropped knot tank #RIHforRiverIsland http://t.co/6FLTOOaA\n",
      "\n",
      "The Puppy Predictors are hanging out backstage live on Facebook right now! https://t.co/DcJaV97pcq\n",
      "\n",
      "It takes just 25 cents to give a child a nutritious school meal. Donate now to the @WFP at http://t.co/ZJWGGrfS2G ShakHQ #daretodream\n",
      "\n",
      "#Zoolander2 https://t.co/ubryPQmn05\n",
      "\n",
      "@loganhopper stay strong\n",
      "\n",
      "@_sbk101 But why? Don't you want people to see the beautiful rainbow you'll be once you let the rain fall?? 🌈😊💗\n",
      "\n",
      "\"The pipeline would not make a meaningful, long-term contribution to our economy.\" —President Obama on rejecting the #KeystoneXL\n",
      "\n",
      "Clean energy currently employs 2.5 million people in the United States. Check it out: https://t.co/ToV5ZYc5kI #ActOnClimate\n",
      "\n",
      "Bye Vegas..... ✈️✈️✈️\n",
      "\n",
      "#SeptemberIssue @Wmag http://t.co/Etjp8BHnqq\n",
      "\n",
      "I got to eat one of my favorites- cavala com milho de vilhão. It was delicious.... http://say.ly/xRV5qC\n",
      "\n",
      "“@jimmyfallon: Hey @jtimberlake, thanks for those camp memories. #CampWinnipesaukee #Fun #ThirdEyeBlind” I WOULD UNDERSTAAAAYEEEAAAND...\n",
      "\n",
      "Some people just like to drink blood for fun. #ahspremiere #AHSfans #ahshotel https://t.co/eMk8lnIS0Z\n",
      "\n",
      "#OhMy21 Stepan!! #GORangers #JoeyClams\n",
      "\n",
      "Whurr my navy @ http://t.co/r4tI7fzHoI\n",
      "\n",
      "Incase you missed it on #Tidal , watch “Bitch Better Have My Money” in the studio here ---&gt; http://t.co/m2GWzwk6IC\n",
      "\n",
      "West Coast your turn!!! Citi pre-sales up now!! #FutureNowTour https://t.co/y0mejWNpX9\n",
      "\n",
      "You asked: Do you like Greece??:-)\r\n",
      " http://t.co/L23btlKvPw\n",
      "\n",
      "Nearly 40 million people are under wind chill advisories or warnings from today through Friday morning.… https://t.co/iZYKPkgfqh\n",
      "\n",
      "Warming up...Countdown till show time. #iTunesFestival #The2020Experience #2of2 #London http://t.co/6EN2r69mM0\n",
      "\n",
      "This is the saddest news ever!!! #whatsjustice #pray4theMartinFamily\n",
      "\n",
      "You know what Biggie said, \"...and if ya don't know, then ya go.\" https://t.co/2DN82rrfbI https://t.co/2GQcGb6xsC\n",
      "\n",
      "Here I go by \"Mini LeBron\", respect! Shak #instavideo http://t.co/l7NtZRUvCU\n",
      "\n",
      "A peek inside the minds and lives of people competing for the Google Lunar XPRIZE → https://t.co/u9cQUDw5Sb https://t.co/J0jyl9Wfc5\n",
      "\n",
      "\"Across the country, there are people who are directly benefiting from the law and don't even know it.\" —President Obama\n",
      "\n",
      ".@UniversalORL see you guys soon!! We have our own ride!?!! Thank you! https://t.co/hODpmbHLRO\n",
      "\n",
      "Just posted a photo http://t.co/3HHazJJCxN\n",
      "\n",
      "@995thewolfdfw used to listen to the wolf when I lived in Texas!! So cool.. Thanks for playing w/o a fight!!\n",
      "\n",
      "Ugh up early with a cold 😢😷🤒\n",
      "\n",
      ".@McConaughey and I play Facebreakers  http://t.co/uWVnJDBh04  #FallonTonight\n",
      "\n",
      "Big day tomorrow. http://t.co/ZZoVkhTLaO\n",
      "\n",
      "About to DO IT! #NYC http://t.co/9T7G6ilFrL\n",
      "\n",
      "Take a look back at some of the moments that defined 2015. https://t.co/bdryhNTS5D #YearInSearch https://t.co/ZpmAiRPT1r\n",
      "\n",
      "Judd!!!! Nice move!! https://t.co/CJkX9ZeqeO\n",
      "\n",
      "Into the wild with bear scientist Wesley Larson (aka @grizkidd) https://t.co/fdpMwEbOvJ\n",
      "\n",
      "@YeezysK awww happy birthday!!!!\n",
      "\n",
      "だいすき Tokyo https://t.co/G4ViuNKoFc\n",
      "\n",
      "I love my fans #artRaveGlasgow #monster4life http://t.co/j8Z9nPKV3V\n",
      "\n",
      "Haeppy baoirthday, Saoirse Ronan\n",
      "\n",
      "@JamieLynnSpears Rematch on Christmas ;) #IAmBritneyJean\n",
      "\n",
      "Twitter world: it's spelled Hillary with 2 L's (but I kinda have no room to talk re typos🙄)\n",
      "\n",
      "Ummm.... What am I doing with my face and how cute is @hollyletchworth?! I love these women so… https://t.co/SiY8A2rc04\n",
      "\n",
      "@AlexaAbrams Hilarious + accurate = #RetweetYourself. We're rolling this out today Alexa, so now you can!\n",
      "\n",
      "Great show tonight! @LievSchreiber, Rob Reiner, and stand-up from Gabriel Iglesias (@fluffyguy). Plus new #ThankYouNotes! #FallonTonight\n",
      "\n",
      "\"@mightybracewell:  Welcome! and thanks for 'bringing it on down to Athens-ville' Hope you enjoy our #ClassicCity.\" Thanks for having us\n",
      "\n",
      "Can you land a helicopter with a busted engine? Only one way to find out! https://t.co/V1q1oeIhId https://t.co/CZJJ3CwF7K\n",
      "\n",
      "SO excited @iamwill! The fans are unstoppable... should we give them another taste of the video today?\n",
      "\n",
      "Take this survey—it's only one question: http://t.co/S5cMYwNwyM http://t.co/Iypp6BaRLg\n",
      "\n",
      "see you today Ny babes @vevo #2daystilDangerousWoman my heart about to pop\n",
      "\n",
      "Bloomberg on Trump: \"I'm a New Yorker, and I know a con when I see one.\" Follow #DemsInPhilly events and analysis: https://t.co/WjyAgarNGq\n",
      "\n",
      "Tonight: Presidential candidate @realDonaldTrump, @terrencehoward and a very special musical performance from @Pharrell! #FallonTonight\n",
      "\n",
      "This man will forever be a legend in my eyes #MichealBolton http://t.co/Rkid5BQ2\n",
      "\n",
      "Pushing the bounds of homemade animation with @pinot https://t.co/L9Bt9ZPtTg https://t.co/hD0e9BsCdy\n",
      "\n",
      "Yeah, there are all sorts of fun things to do while sick and on vocal rest. Like sitting here, popping bubble wrap by myself.#wishiwasontour\n",
      "\n",
      ".@TheSlyStallone is here today. He’s an actor, an artist, a lover, a fighter… What was I talking about? https://t.co/0CJHInyRIt\n",
      "\n",
      "see you tonight Jones Beach ♡ ♡ @billboard @Hot100Fest https://t.co/pQ6Qpldcj7\n",
      "\n",
      "Best of luck to our director Dave Diomedi tonight at the #EMMYS. We love you buddy! #TheTonightShow\n",
      "\n",
      "Tengo la suerte de tener a los fans que hablan muchos idiomas. @enriquenerd @Cristiano abla al español para tus fans que no saben inglés\n",
      "\n",
      "Did you watch our exclusive new interview video with Shak in Paris yet? http://t.co/m7AzSruhgJ ShakiraHQ\n",
      "\n",
      "Watch #ElectionNight coverage from @BuzzFeedNews streaming LIVE on Twitter! Go to ⚡️ Moments or… https://t.co/1ftM7LBxRs\n",
      "\n",
      "Share &amp; listen to this amazing P&amp;G #ThankYouMom video with your mom and all the strong moms out there! 😭 #ad https://t.co/2kSyW5mU67\n",
      "\n",
      "Today my friend @RichardWilkins made the astute observation that 'Meredith' contains 'Red'. 😸 I was astounded. And the fans were amazing.\n",
      "\n",
      "LIVE: President Obama is in West Virginia hosting a community discussion on drug abuse. https://t.co/qmZGAfdf39\n",
      "\n",
      "OK America, this is where we need your help! Please #VOTESASHA (for free) at http://t.co/sRNIUIvxiH now! Thank you ShakiraHQ\n",
      "\n",
      "Guys Meet my adorb teddy bear's lil sis Claire Bear, now available at Claire's as part of my 12… http://t.co/3Q3eqLj8Re\n",
      "\n",
      "Like a raw pounded whale❗️🎌🎎🎌❗️ https://t.co/BPC3i1PaHB\n",
      "\n",
      "UFC star Ronda Rousey is motivated by redemption (and revenge) \r\n",
      "https://t.co/kATgnMmWjK\n",
      "\n",
      "I still can't believe I've been NOMINATED FOR A GRAMMY.... you guys have no idea how unbelievably grateful and happy I am.. wow... #pinchme\n",
      "\n",
      "Just picked my dress for Billboard Awards, which reminds me- only a few days left to vote for the Milestone Award! http://t.co/ws1epSxEUp\n",
      "\n",
      "“#MyStory is about variety. I could never settle in one place or be one thing.” —Imogen Lehtonen https://t.co/9Bci3X9bSA\n",
      "\n",
      "Let's go Champ! https://t.co/SaBkR145ph\n",
      "\n",
      "M-Town! I LOVE MY CITY!!! @memgrizz @StJude @LeBonheurChild https://t.co/mZf5LBAP00\r\n",
      "\r\n",
      "#CantStopTheFeeling 🏆‼️ https://t.co/JMq7Aj9aEu\n",
      "\n",
      "In all fairness, I’m pretty sure they can’t read. http://t.co/RCciOBX8uB\n",
      "\n",
      "Thank you for all the kind words, I won't ever forget this moment. Tony &amp; I love you RT #CheekToCheek ORDER/BUY NOW: http://t.co/zu4nMBCmZq\n",
      "\n",
      "9PM PT @DWAnimation @AnnaKendrick47 @kunalnayyar @gwenstefani @RonFunches @JKCorden @IconaPop #CantStopTheFeeling\r\n",
      "https://t.co/Thd5jmXRxo\n",
      "\n",
      "Best thing I ever did. #8years #HappyAnniversary https://t.co/kb0oLj2RAS\n",
      "\n",
      "Tonight: Pictionary with Martin Short and some special guests. Plus @itsgabrielleu stops by and music from @MaryJBlige! #FallonTonight\n",
      "\n",
      "You can now tag up to 10 friends in photos on http://t.co/JbzACuw5a2. Learn more: https://t.co/icJVBHrgwN http://t.co/qVYOMnb3sF\n",
      "\n",
      "Just doin' what I love.. 💋💥 #demiworldtour #Brisbane https://t.co/cqg3Au1sRw\n",
      "\n",
      "Mexico City, #777tour touch down! Limited tix avail at El Plaza Condesa now. Come get it #Navy! #HTC http://t.co/kCw0UaHf\n",
      "\n",
      "And the world spins madly on. https://t.co/qDr3nSjXRQ https://t.co/qcxOzEcK0Y\n",
      "\n",
      "After a sunny morning looking out for ‘Bunnies &amp; Truffles’, I love sniffing around the rose garden… https://t.co/VA6DPZle81\n",
      "\n",
      "Dispel misinformation with facts from the @OFA Truth Team. https://t.co/zjexLUJXAC\n",
      "\n",
      "Enter to win $10K and an @EvenfloBaby car seat right here. Everyone can enter — Carla, Lucy, Maurice, even Flo. https://t.co/GQzoIEZpGb\n",
      "\n",
      "The Whenever, Wherever video is now just 300k from being @Vevo certified for 100m views! Thanks everyone! http://t.co/YSIS1uEl ShakiraHQ\n",
      "\n",
      "Globe-trotting isn’t always glamorous with Russian photographer @avdeev https://t.co/8sJEYp4bNS https://t.co/Nhuuq7xXde\n",
      "\n",
      "Come on http://t.co/Fe5IkT7Qma listeners!! Request Ew! Let's break the Billboard Hot 100!!! https://t.co/SpFGCKRk8D we find out today\n",
      "\n",
      "It's Hollywood's night to shine! Watch videos from the #Oscars on Instagram https://t.co/6cgfM6ImPM\n",
      "\n",
      "My new Gucci Cadi whip 💅 http://t.co/DI6AOq3rrh\n",
      "\n",
      "u alright love? 🙊🙈 https://t.co/JpqeDtvI6r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "random_poster = random.choice(top100)\n",
    "\n",
    "result = conn.query(f\"MATCH (u:User {{name: '{random_poster['b']['name']}'}})-[:POSTED]->(t:Tweet) RETURN t\")\n",
    "for tweet in result:\n",
    "    print(tweet['t']['content'])\n",
    "    print(\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Top 100 User mit den meisten Followern"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "user37092 hat 3383 Follower\n",
      "user44740 hat 3216 Follower\n",
      "user6432 hat 2735 Follower\n",
      "user60693 hat 2647 Follower\n",
      "user53882 hat 2471 Follower\n",
      "user12527 hat 2462 Follower\n",
      "user38584 hat 2133 Follower\n",
      "user49269 hat 2074 Follower\n",
      "user39357 hat 1905 Follower\n",
      "user25599 hat 1707 Follower\n",
      "user79574 hat 1632 Follower\n",
      "user68562 hat 1591 Follower\n",
      "user24754 hat 1521 Follower\n",
      "user15250 hat 1503 Follower\n",
      "user18158 hat 1500 Follower\n",
      "user55950 hat 1410 Follower\n",
      "user71190 hat 1402 Follower\n",
      "user12729 hat 1370 Follower\n",
      "user47268 hat 1337 Follower\n",
      "user21840 hat 1315 Follower\n",
      "user34229 hat 1273 Follower\n",
      "user25044 hat 1255 Follower\n",
      "user24164 hat 1231 Follower\n",
      "user75352 hat 1214 Follower\n",
      "user55915 hat 1201 Follower\n",
      "user3575 hat 1198 Follower\n",
      "user75920 hat 1186 Follower\n",
      "user14617 hat 1167 Follower\n",
      "user60714 hat 1154 Follower\n",
      "user19411 hat 1123 Follower\n",
      "user11733 hat 1120 Follower\n",
      "user78789 hat 1108 Follower\n",
      "user22837 hat 1098 Follower\n",
      "user40933 hat 1088 Follower\n",
      "user14819 hat 1072 Follower\n",
      "user30997 hat 1070 Follower\n",
      "user53316 hat 1059 Follower\n",
      "user28901 hat 1053 Follower\n",
      "user29042 hat 1047 Follower\n",
      "user79338 hat 1036 Follower\n",
      "user52388 hat 1022 Follower\n",
      "user73616 hat 1016 Follower\n",
      "user22992 hat 1014 Follower\n",
      "user4564 hat 992 Follower\n",
      "user30585 hat 989 Follower\n",
      "user4654 hat 977 Follower\n",
      "user38602 hat 957 Follower\n",
      "user26597 hat 928 Follower\n",
      "user57155 hat 920 Follower\n",
      "user7084 hat 915 Follower\n",
      "user27285 hat 915 Follower\n",
      "user56629 hat 913 Follower\n",
      "user28984 hat 911 Follower\n",
      "user64541 hat 900 Follower\n",
      "user51391 hat 894 Follower\n",
      "user34356 hat 889 Follower\n",
      "user67619 hat 884 Follower\n",
      "user54562 hat 865 Follower\n",
      "user25706 hat 859 Follower\n",
      "user79008 hat 852 Follower\n",
      "user15062 hat 852 Follower\n",
      "user17163 hat 844 Follower\n",
      "user50052 hat 839 Follower\n",
      "user10366 hat 831 Follower\n",
      "user12372 hat 818 Follower\n",
      "user6409 hat 813 Follower\n",
      "user36471 hat 793 Follower\n",
      "user61225 hat 786 Follower\n",
      "user73175 hat 784 Follower\n",
      "user5078 hat 778 Follower\n",
      "user29386 hat 761 Follower\n",
      "user18840 hat 754 Follower\n",
      "user70174 hat 750 Follower\n",
      "user66901 hat 750 Follower\n",
      "user36856 hat 750 Follower\n",
      "user23108 hat 749 Follower\n",
      "user64134 hat 747 Follower\n",
      "user66702 hat 743 Follower\n",
      "user9111 hat 743 Follower\n",
      "user58546 hat 738 Follower\n",
      "user25358 hat 737 Follower\n",
      "user43567 hat 736 Follower\n",
      "user959 hat 736 Follower\n",
      "user16325 hat 735 Follower\n",
      "user80555 hat 732 Follower\n",
      "user39619 hat 731 Follower\n",
      "user19361 hat 730 Follower\n",
      "user42528 hat 728 Follower\n",
      "user25974 hat 714 Follower\n",
      "user46500 hat 712 Follower\n",
      "user14997 hat 710 Follower\n",
      "user18648 hat 709 Follower\n",
      "user15667 hat 697 Follower\n",
      "user47802 hat 683 Follower\n",
      "user11975 hat 679 Follower\n",
      "user45611 hat 672 Follower\n",
      "user50686 hat 672 Follower\n",
      "user14154 hat 669 Follower\n",
      "user48548 hat 666 Follower\n",
      "user4258 hat 665 Follower\n"
     ]
    }
   ],
   "source": [
    "top100 = conn.query(\"MATCH (a)-[:FOLLOWS]->(b) RETURN b, COUNT(a) as followers ORDER BY followers DESC LIMIT 100\")\n",
    "\n",
    "for user in top100:\n",
    "    print(user['b']['name'], \"hat\", user['followers'], \"Follower\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3. Top 100 User, die den meisten Usern der Top 100 folgen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"MATCH (follower:User)-[follows:FOLLOWS]->(followed:User)\n",
    "WHERE followed.userId IN [\"\"\" \n",
    "\n",
    "count = 0\n",
    "for user in top100:\n",
    "    query += f\"'{user['b']['userId']}'\"\n",
    "    if count < 99: query += \",\"\n",
    "    count += 1\n",
    "\n",
    "query += \"\"\"]\n",
    "WITH follower, COUNT(follows) AS numFollowed\n",
    "ORDER BY numFollowed DESC\n",
    "RETURN follower.name AS username, numFollowed\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "result = conn.query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "user39357 folgt 69 Usern\n",
      "user66702 folgt 55 Usern\n",
      "user9615 folgt 50 Usern\n",
      "user53146 folgt 49 Usern\n",
      "user22837 folgt 47 Usern\n",
      "user42799 folgt 46 Usern\n",
      "user63538 folgt 44 Usern\n",
      "user55559 folgt 41 Usern\n",
      "user47694 folgt 40 Usern\n",
      "user77717 folgt 39 Usern\n",
      "user49803 folgt 38 Usern\n",
      "user6684 folgt 38 Usern\n",
      "user18469 folgt 37 Usern\n",
      "user67633 folgt 37 Usern\n",
      "user71803 folgt 37 Usern\n",
      "user76680 folgt 36 Usern\n",
      "user67405 folgt 35 Usern\n",
      "user27072 folgt 35 Usern\n",
      "user52388 folgt 35 Usern\n",
      "user47722 folgt 35 Usern\n",
      "user34700 folgt 34 Usern\n",
      "user60305 folgt 34 Usern\n",
      "user72368 folgt 34 Usern\n",
      "user78827 folgt 34 Usern\n",
      "user51391 folgt 34 Usern\n",
      "user64787 folgt 34 Usern\n",
      "user61225 folgt 33 Usern\n",
      "user68562 folgt 33 Usern\n",
      "user42528 folgt 33 Usern\n",
      "user11975 folgt 33 Usern\n",
      "user76622 folgt 31 Usern\n",
      "user13415 folgt 31 Usern\n",
      "user23869 folgt 31 Usern\n",
      "user71776 folgt 31 Usern\n",
      "user55719 folgt 31 Usern\n",
      "user76576 folgt 30 Usern\n",
      "user11037 folgt 30 Usern\n",
      "user59719 folgt 30 Usern\n",
      "user475 folgt 30 Usern\n",
      "user8350 folgt 30 Usern\n",
      "user55915 folgt 30 Usern\n",
      "user76136 folgt 29 Usern\n",
      "user75029 folgt 29 Usern\n",
      "user20380 folgt 29 Usern\n",
      "user19233 folgt 29 Usern\n",
      "user36856 folgt 29 Usern\n",
      "user54755 folgt 29 Usern\n",
      "user27716 folgt 28 Usern\n",
      "user36209 folgt 28 Usern\n",
      "user53892 folgt 28 Usern\n",
      "user34356 folgt 28 Usern\n",
      "user11733 folgt 28 Usern\n",
      "user53926 folgt 28 Usern\n",
      "user34968 folgt 28 Usern\n",
      "user66072 folgt 27 Usern\n",
      "user60897 folgt 27 Usern\n",
      "user71190 folgt 27 Usern\n",
      "user3900 folgt 27 Usern\n",
      "user2853 folgt 27 Usern\n",
      "user66718 folgt 27 Usern\n",
      "user61938 folgt 27 Usern\n",
      "user77678 folgt 27 Usern\n",
      "user31867 folgt 27 Usern\n",
      "user46639 folgt 27 Usern\n",
      "user5078 folgt 27 Usern\n",
      "user56384 folgt 27 Usern\n",
      "user58319 folgt 26 Usern\n",
      "user38602 folgt 26 Usern\n",
      "user59337 folgt 26 Usern\n",
      "user21279 folgt 26 Usern\n",
      "user62737 folgt 26 Usern\n",
      "user51441 folgt 26 Usern\n",
      "user43326 folgt 26 Usern\n",
      "user22992 folgt 26 Usern\n",
      "user63272 folgt 26 Usern\n",
      "user14286 folgt 26 Usern\n",
      "user56134 folgt 26 Usern\n",
      "user41819 folgt 25 Usern\n",
      "user56074 folgt 25 Usern\n",
      "user34876 folgt 25 Usern\n",
      "user50792 folgt 25 Usern\n",
      "user41151 folgt 25 Usern\n",
      "user6801 folgt 25 Usern\n",
      "user17368 folgt 25 Usern\n",
      "user16029 folgt 25 Usern\n",
      "user65793 folgt 25 Usern\n",
      "user53141 folgt 25 Usern\n",
      "user44674 folgt 25 Usern\n",
      "user57970 folgt 25 Usern\n",
      "user23711 folgt 25 Usern\n",
      "user7442 folgt 25 Usern\n",
      "user12208 folgt 25 Usern\n",
      "user50613 folgt 25 Usern\n",
      "user70810 folgt 24 Usern\n",
      "user67749 folgt 24 Usern\n",
      "user58480 folgt 24 Usern\n",
      "user47788 folgt 24 Usern\n",
      "user43990 folgt 24 Usern\n",
      "user23515 folgt 24 Usern\n",
      "user30398 folgt 24 Usern\n"
     ]
    }
   ],
   "source": [
    "for record in result:\n",
    "    print(record['username'], \"folgt\", record['numFollowed'], 'Usern')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4. Informationen für persönliche Startseite eines zufälligen Users (der Top 100 mit den meisten Followern)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "random_user = random.choice(top100)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1. Anzahl der Follower"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1337\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(f\"MATCH (follower:User)-[:FOLLOWS]->(user:User {{name: '{random_user['b']['name']}'}}) RETURN count(follower) AS followerCount\")\n",
    "print(result[0]['followerCount'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2. Anzahl der verfolgten Accounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "189\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(f\"MATCH (user:User {{name: '{random_user['b']['name']}'}})-[:FOLLOWS]->(followed:User) RETURN count(followed) AS followedCount\")\n",
    "print(result[0]['followedCount'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 3.1 Die 25 meistgeliketen Posts der verfolgten Accounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Para descubrir más voces sorprendentes de la comunidad hispanohablante sigue a @InstagramES en Instagram y Twitter\n",
      "Likes:  350\n",
      "\n",
      "baby, it's cold outside\n",
      "Likes:  247\n",
      "\n",
      "Request #company\n",
      "Likes:  237\n",
      "\n",
      "i love you\n",
      "Likes:  236\n",
      "\n",
      "We've set a date! Perfume vid will premiere Tuesday on @VEVO . http://t.co/ID74wBjy91 #3DaysToPerfumeVideo\n",
      "Likes:  198\n",
      "\n",
      "'Cheek To Cheek' is now #5 on US iTunes! Keep up the good work Monsters! We're so happy. Friends just ran in screaming \"CONDRAGULATIONS\" !\n",
      "Likes:  192\n",
      "\n",
      "🌧🌧🌧 surreal. love you.  https://t.co/iTB1nV8Mk3\n",
      "Likes:  190\n",
      "\n",
      "Oh gosh 😳 #IAmBritneyJean\n",
      "Likes:  187\n",
      "\n",
      "YES selenagomez's photo http://t.co/af11UyAAmt\n",
      "Likes:  185\n",
      "\n",
      "A night of songwriting 💋 http://t.co/FP8BsJc22U\n",
      "Likes:  184\n",
      "\n",
      "A Tweet for those who need us, 2009 http://t.co/3Q14WKu #5yrs\n",
      "Likes:  183\n",
      "\n",
      "@WillWTH Of course! She does deserve that #1 spot\n",
      "Likes:  183\n",
      "\n",
      "Streaming LIVE in one hour:\r\n",
      "\r\n",
      "@HillaryClinton \r\n",
      "#debates \r\n",
      "@realDonaldTrump\r\n",
      "\r\n",
      "#GoLive on Twitter ⬇️\r\n",
      "https://t.co/l2fPw8j3O6\n",
      "Likes:  182\n",
      "\n",
      "Head's up! Insane views of the #XGames are on Instagram now https://t.co/8rQvXk6Ic5\n",
      "Likes:  181\n",
      "\n",
      "What do Justin, Bill Murray, Michael Phelps, and George Lopez have in common? http://t.co/1D4rAuA9  #rydercup  -teamJT\n",
      "Likes:  181\n",
      "\n",
      "Just finishing up with my vocal coach &amp; now I'm off to dance rehearsals. How's everyone's Friday? Where you going for Labor Day weekend? :)\n",
      "Likes:  181\n",
      "\n",
      "Cynics, take note: When we #ActOnClimate, we build a stronger future. https://t.co/wHHMdo2ro6\n",
      "Likes:  181\n",
      "\n",
      "Mondays are less Monday-y when it's #InternationalCatDay! 😺 (oh hi @CheetoTuxedo) https://t.co/ADSArJONE9\n",
      "Likes:  181\n",
      "\n",
      "420\n",
      "Likes:  180\n",
      "\n",
      "Shak's up for Best International Female at this year's NRJ #NMA Awards. You can vote for her at http://t.co/BuUnctQlBa (thanks!) ShakHQ\n",
      "Likes:  180\n",
      "\n",
      "Thanks! So pleased you like it. Shak RT @PacifictoPark Absolutely obsessed with the new @shakira album #Empire #TheOneThing\n",
      "Likes:  180\n",
      "\n",
      "The Tokyo show was a DREAM. Plus, we've added another show in Singapore on June 9th!! See you there! http://t.co/aox1ID193n\n",
      "Likes:  180\n",
      "\n",
      "Love to win. Hate to lose http://t.co/js6bHDbU\n",
      "Likes:  180\n",
      "\n",
      "❤️💋🎤SEE YOU THERE 🎤🎶❤️✌️️ https://t.co/lC8B97qXQz\n",
      "Likes:  180\n",
      "\n",
      "This is nothing more than shameless partisanship. The Supreme Court should be held in higher regard. #DoYourJob https://t.co/I0TN3csv0O\n",
      "Likes:  179\n",
      "\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(f\"\"\"\n",
    "MATCH (follower:User)-[:FOLLOWS]->(followed:User)-[:POSTED]->(tweet:Tweet)\n",
    "WHERE follower.name = '{random_user['b']['name']}'\n",
    "WITH follower, collect(followed.name) AS followedUsers\n",
    "MATCH (t:Tweet)<-[:POSTED]-(u:User)\n",
    "WHERE u.name IN followedUsers\n",
    "OPTIONAL MATCH (t)<-[:LIKES]-(liker:User)\n",
    "RETURN t.content AS content, COUNT(liker) AS numLikes\n",
    "ORDER BY numLikes DESC\n",
    "LIMIT 25\n",
    "\"\"\")\n",
    "\n",
    "for tweet in result:\n",
    "    print(tweet['content'])\n",
    "    print(\"Likes: \", tweet['numLikes'])\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 3.2 Die 25 neuesten Posts der verfolgten Accounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Feliz 2017 de los Piqué Mebarak! Happy 2017 from the Piqué Mebarak family! https://t.co/XIayfbHnZK\n",
      "Getweeted am:  31/12/2016 22:58\n",
      "\n",
      "\"Despite everything, no one can dictate who you are to other people.\" https://t.co/Vw9cZsFGqI\n",
      "Getweeted am:  31/12/2016 21:32\n",
      "\n",
      "OMG JUMP SCARES R US!!! 😱 😱 😱  https://t.co/ebi36sQIrw https://t.co/KkIe4TBSVw\n",
      "Getweeted am:  31/12/2016 18:30\n",
      "\n",
      "Quién ha incluido Chantaje en su playlist de @Spotify de fin de año? Nos indican dónde van a celebrarlo? https://t.co/EAtARlrG6F ShakHQ\n",
      "Getweeted am:  31/12/2016 14:53\n",
      "\n",
      "#DailyFluff\r\n",
      "https://t.co/LUvfxwzfNl 🐾 https://t.co/nyl0tkxdOG\n",
      "Getweeted am:  31/12/2016 12:03\n",
      "\n",
      "KEEP THIS STUFF AWAY FROM CATS, MEOW! 🙀🙀🙀 https://t.co/R08apeBvyU https://t.co/8FJYoxSuBA\n",
      "Getweeted am:  31/12/2016 00:30\n",
      "\n",
      "🎿thank you to our fans and loved ones who bless us with so much each year. We had a beautiful… https://t.co/SRgCNbo2ob\n",
      "Getweeted am:  31/12/2015 23:13\n",
      "\n",
      "Ameowzing. Get it … aMEOWzing. Oh, Zing! https://t.co/7O5QKD8blT https://t.co/D0lcNw0xSa\n",
      "Getweeted am:  31/12/2015 23:00\n",
      "\n",
      "Con mi suegrita!! https://t.co/9BmZ9QYs1h\n",
      "Getweeted am:  31/12/2015 22:06\n",
      "\n",
      "#RockinEve tonight!! Celebrate with #CONFIDENT on sale for a special price on @AppleMusic 😜😜 https://t.co/UFMTpIsceX https://t.co/Pgh5Y5PiXe\n",
      "Getweeted am:  31/12/2015 21:38\n",
      "\n",
      "NEW YEARS RESOLUTIONS https://t.co/A02mVD067O https://t.co/7zumq6T06S\n",
      "Getweeted am:  31/12/2015 21:30\n",
      "\n",
      "DEADLINE: Chip in to help fund the fight for more progress in 2016. https://t.co/ezVFTh8LJ2\n",
      "Getweeted am:  31/12/2015 19:24\n",
      "\n",
      "It’s so cool to be Apple’s Top Paid App of 2015. I hope you love playing Heads Up! as much as I do. https://t.co/93T5wqurCJ\n",
      "Getweeted am:  31/12/2015 16:22\n",
      "\n",
      "I can't thank you enough for making 1989 the best selling album of 2014.\r\n",
      "NOW LETS GO CELEBRATE!\r\n",
      "See you on ABC @OfficialNYRE tonight!\n",
      "Getweeted am:  31/12/2014 22:34\n",
      "\n",
      "Before the ball drops, make sure you chip in to help fight for change in 2015: http://t.co/m9rFZYIPyI\n",
      "Getweeted am:  31/12/2014 22:10\n",
      "\n",
      "This deadline matters for anyone who believes in fighting for change—chip in today: http://t.co/uuowMGeGbP\n",
      "Getweeted am:  31/12/2014 14:25\n",
      "\n",
      "“@Timbaland: @jtimberlake my brother last 2 shows it's been 3 years 20/20 experience… http://t.co/wqRAOdq7EV” Love you, brother!!! Always! 🙏\n",
      "Getweeted am:  31/12/2014 04:48\n",
      "\n",
      "I believe it's clear that I won the birthday cake war! http://t.co/6oyQnSuHb3\n",
      "Getweeted am:  31/12/2014 01:14\n",
      "\n",
      "I heard 2014 is gonna be even more fun than 2013. #HappyNewYear #BabyNewYear http://t.co/CTqytBcXaC\n",
      "Getweeted am:  31/12/2013 17:11\n",
      "\n",
      "Awww you're the best! Xo! RT @louisocks your cd\n",
      "Getweeted am:  31/12/2013 16:04\n",
      "\n",
      "OMG Vegas yes! What a show!!!! I heart you all xoxox\n",
      "Getweeted am:  31/12/2013 06:52\n",
      "\n",
      "Had a wonderfully relaxing day off yesterday with the fam. &lt;3\n",
      "Getweeted am:  31/12/2013 04:59\n",
      "\n",
      "Here’s the last challenge. What are your wishes for the New Year? Reply with #Celebrate15M in the next 24 hours.\n",
      "Getweeted am:  31/12/2012 15:59\n",
      "\n",
      "What's Happening\r\n",
      "https://t.co/a0WSI52OuH https://t.co/7gpXqUrqXJ\n",
      "Getweeted am:  31/10/2016 22:58\n",
      "\n",
      "Look 1, Part 3:\r\n",
      "All is forgiven. \r\n",
      "More later.... 💛⚡️ https://t.co/9A34XSw4O2\n",
      "Getweeted am:  31/10/2016 21:33\n",
      "\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(f\"\"\"\n",
    "MATCH (follower:User)-[:FOLLOWS]->(followed:User)-[:POSTED]->(tweet:Tweet)\n",
    "WHERE follower.name = '{random_user['b']['name']}'\n",
    "WITH follower, collect(followed.name) AS followedUsers\n",
    "MATCH (t:Tweet)<-[:POSTED]-(u:User)\n",
    "WHERE u.name IN followedUsers\n",
    "RETURN t.content AS content, t.date_time AS date\n",
    "ORDER BY t.date_time DESC\n",
    "LIMIT 25\n",
    "\"\"\")\n",
    "\n",
    "for tweet in result:\n",
    "    print(tweet['content'])\n",
    "    print(\"Getweeted am: \", tweet['date'])\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 4. Erstellung eines neuen Posts: Herstellen einer Cashing-Beziehung bei allen Followern"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "52542\n"
     ]
    }
   ],
   "source": [
    "num_tweets = conn.query(\"MATCH (t:Tweet) RETURN COUNT(t)\")[0]['COUNT(t)']\n",
    "print(num_tweets)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "tweet = {\n",
    "    \"tweetId\": str(num_tweets+1),\n",
    "    \"content\": \"Doing neo4j queries right now #BDEA\",\n",
    "    \"date_time\": \"18/06/2023 09:48\",\n",
    "    \"language\": \"en\"\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Tweet importieren"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "new_tweet = conn.query(f\"CREATE (t:Tweet {{tweetId: '{tweet['tweetId']}', content: '{tweet['content']}', date_time: '{tweet['date_time']}', language: '{tweet['language']}'}}) RETURN t\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Record t=<Node element_id='4:267137f2-efed-4ac8-a216-d502978a187b:133848' labels=frozenset({'Tweet'}) properties={'date_time': '18/06/2023 09:48', 'language': 'en', 'tweetId': '52543', 'content': 'Doing neo4j queries right now #BDEA'}>>]\n"
     ]
    }
   ],
   "source": [
    "print(new_tweet)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### POSTED-Beziehung herstellen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query(f\"MATCH (user:User {{userId: '{random_user['b']['userId']}'}}) MATCH (tweet:Tweet {{tweetId: '{new_tweet[0]['t']['tweetId']}'}}) CREATE (user)-[:POSTED]->(tweet)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### CACHED-Beziehung bei allen Followern des Posters herstellen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1337\n"
     ]
    }
   ],
   "source": [
    "followers = conn.query(f\"MATCH (follower:User)-[:FOLLOWS]->(user:User {{userId: '{random_user['b']['userId']}'}}) RETURN follower\")\n",
    "print(len(followers))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15853668\n"
     ]
    }
   ],
   "source": [
    "print(random_user['b']['userId'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "for follower in followers:\n",
    "    conn.query(f\"MATCH (user:User {{userId: '{follower['follower']['userId']}'}}) MATCH (tweet:Tweet {{tweetId: '{new_tweet[0]['t']['tweetId']}'}}) CREATE (user)-[:CACHED]->(tweet)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Check how many users have the tweet cached (should be the same as number followers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record COUNT(u)=1337>]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query(\"MATCH (u:User)-[r:CACHED]->(tweet:Tweet {tweetId: '52543'}) RETURN COUNT(u)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 5. Die 25 beliebtesten Tweets, welche die Wörter \"hello\" und \"from\" enthalten"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "You asked: hello from France, champion ! :) im so proud of you http://t.co/AhDl5iMGzF\n",
      "Likes:  216\n",
      "\n",
      "You asked: \r\n",
      "Hello from Japan!\r\n",
      "I'm Anna!I I'm a big fan! Please say me hello Anna!\r\n",
      " http://t.co/5Oyi7SiUhY\n",
      "Likes:  179\n",
      "\n",
      "You asked: Hi Ronaldo! I love you so much! Please say hello to me! I am from Turkey!  http://t.co/xpDH5Ppb67\n",
      "Likes:  120\n",
      "\n",
      "You asked: Can you say hello to me?  My name is Narin and I am from Germany http://t.co/lx2CRb3xwh\n",
      "Likes:  114\n",
      "\n",
      "You asked: Can you say hello to me ,please? I am from Bulgaria!!! http://t.co/dyNj55sAq4\n",
      "Likes:  97\n",
      "\n",
      "Say hello to Himanshu Yadav and all my friends from #India. I will come shortly with more news. http://t.co/60xEW67c\n",
      "Likes:  93\n",
      "\n",
      "#JoanneVibes say hello from backstage at...??? https://t.co/m9PI2oUUo8\n",
      "Likes:  91\n",
      "\n",
      "You asked: hello from morocco \r\n",
      " http://t.co/gbuEyP5953\n",
      "Likes:  86\n",
      "\n",
      "Why did @Adele cross the road? She wanted to say hello from the other side.\n",
      "Likes:  70\n",
      "\n"
     ]
    }
   ],
   "source": [
    "result = conn.query(\"\"\"\n",
    "MATCH (t:Tweet)\n",
    "WHERE ALL(word IN [' hello ', ' from '] WHERE t.content CONTAINS word)\n",
    "WITH t\n",
    "MATCH (t)<-[:LIKES]-(liker:User)\n",
    "RETURN t.content AS content, COUNT(liker) AS numLikes\n",
    "ORDER BY numLikes DESC\n",
    "LIMIT 25\n",
    "\"\"\")\n",
    "\n",
    "for tweet in result:\n",
    "    print(tweet['content'])\n",
    "    print(\"Likes: \", tweet['numLikes'])\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
